{
  "Naruto Uzumaki": {
    "info": {
      "Birthdate": "October 10",
      "Sex": "Male",
      "Age": "Part I: 12–13, Part II: 15–17",
      "Height": "Part I: 145.3 cm–147.5 cm, Part II: 166 cm, Blank Period: 180 cm",
      "Weight": "Part I: 40.1 kg–40.6 kg, Part II: 50.9 kg",
      "Blood type": "B",
      "Kekkei Genkai": "Lava Release,  Magnet Release,  Boil Release",
      "Classification": "Jinchūriki, Sage, Sensor Type",
      "Tailed Beast": "Shukaku, Matatabi, Isobu, Son Gokū, Kokuō, Saiken, Chōmei, Gyūki, Kurama (Forms)",
      "Occupation": "Hokage",
      "Affiliation": "Konohagakure,  Mount Myōboku,  Allied Shinobi Forces",
      "Team": "Team Kakashi, Sasuke Recovery Team, Konoha 11 (Anime only), Bikōchū Search Team (Anime only), Kaima Capture Team (Anime only), Star Guard Team (Anime only), Peddlers Escort Team (Anime only), Kazekage Rescue Team, Team One (Anime only), Eight Man Squad, Hanabi Rescue Team (Movie only)",
      "Clan": "Uzumaki Clan"
    },
    "about": [
      "Naruto Uzumaki (うずまきナルト, Uzumaki Naruto) is a shinobi of Konohagakure's Uzumaki clan. He became the jinchūriki of the Nine-Tails on the day of his birth — a fate that caused him to be shunned by most of Konoha throughout his childhood. After joining Team Kakashi, Naruto worked hard to gain the village's acknowledgement all the while chasing his dream to become Hokage. In the following years, through many hardships and ordeals, he became a capable ninja regarded as a hero both by the villagers, and soon after, the rest of the world, becoming known as the Hero of the Hidden Leaf (木ノ葉隠れの英雄, Konohagakure no Eiyū, literally meaning: Hero of the Hidden Tree Leaves). He soon proved to be one of the main factors in winning the Fourth Shinobi World War, leading him to achieve his dream and become the village's Seventh Hokage (七代目火影, Nanadaime Hokage, literally meaning: Seventh Fire Shadow).",
      "Naruto was born on the night of October 10th to Minato Namikaze (the Fourth Hokage) and Kushina Uzumaki (the second jinchūriki of the Nine-Tails). He was named after Naruto Musasabi, the protagonist of Jiraiya's first book, which made the Sannin his godfather. The Third Hokage made special arrangements for Minato to preserve Kushina's seal containing the Nine-Tails while she gave birth to Naruto in a remote location, escorted by midwives and Anbu. A masked man, Tobi, tracked down their location, however, killed the midwives and Anbu, and captured Naruto, forcing Minato to quickly rescue him and teleport him to a safe house.",
      "With Minato gone, Tobi captured Kushina and released the Nine-Tails from her, using it to devastate Konoha. Since the Nine-Tails' chakra was too immense to be sealed into an infant, Minato sacrificed his soul to split the fox's chakra in half, sealing the Yin half within himself and the Yang half within Naruto. After telling Naruto how much they loved him, Minato and Kushina succumbed to their wounds from protecting their son from the Nine-Tails and passed away.",
      "Orphaned, not having parents or anyone else to provide for him, Naruto received monthly income from the village in order to afford daily necessities. Naruto grew up not knowing who his parents were, receiving only his mother's surname, as Hiruzen wanted to protect Naruto from his father's enemies. However, Naruto's peers emulated their parents' hatred of him, despite not knowing why. This social isolation caused Naruto to crave acknowledgement, which he would gain by pulling pranks.",
      "On the day of his enrolment in the Ninja Academy",
      "In the Academy, Naruto became a student of Iruka Umino, who acted as a surrogate older brother to keep him in line and help him work harder. Naruto also met his class-mate Sasuke Uchiha and tried to befriend him, since he was alone as well. Jealous of Sasuke's skills and popularity, however, Naruto also grew close with the owner of Ramen Ichiraku, Teuchi and his daughter Ayame, being welcomed as their favourite customer.",
      "Naruto is noted as boisterous, exuberant, and unorthodox, quite similar to Hashirama Senju."
    ],
    "images": [
      "https://static.wikia.nocookie.net/naruto/images/0/09/Naruto_newshot.png/revision/latest?",
      "https://static.wikia.nocookie.net/naruto/images/f/fa/Naruto_Uzumaki_Part_2_Thumbnail.png/revision/latest?",
      "https://static.wikia.nocookie.net/naruto/images/0/08/Naruto_part_III.png/revision/latest?"
    ]
  },
  "Minato Namikaze": {
    "info": {
      "Birthdate": "January 25",
      "Sex": "Male",
      "Age": "Part II: 24",
      "Status": "Deceased",
      "Height": "Part I: 179.2 cm",
      "Weight": "Part I: 66.1 kg",
      "Blood type": "B",
      "Classification": "Jinchūriki, Sage, Sensor Type",
      "Tailed Beast": "Kurama (Yin half) (Forms)",
      "Occupation": "Hokage",
      "Affiliation": "Konohagakure,  Mount Myōboku,  Allied Shinobi Forces",
      "Team": "Team Jiraiya, Team Minato"
    },
    "about": [
      "Minato Namikaze (波風ミナト, Namikaze Minato) was the Fourth Hokage (四代目火影, Yondaime Hokage, literally meaning: Fourth Fire Shadow) of Konohagakure. He was renowned all over the world as Konoha's Yellow Flash (木ノ葉の黄色い閃光, Konoha no Kiiroi Senkō, English TV: Yellow Flash of the Leaf). He died during the Nine-Tailed Demon Fox's Attack, sacrificing his life to seal a part of the Nine-Tails into his newborn son, Naruto Uzumaki.",
      "Minato entered Konoha's Academy with the dream of earning the villagers' respect and recognition by becoming Hokage.",
      "Years later, after they graduated and became ninja, Kushina was kidnapped by Kumogakure forces. Konoha mobilised its ninja to retrieve her, but only Minato noticed the strands of red hair Kushina left behind to mark their path. Minato, acting alone, rescued her from her captors. – to fall in love with him.",
      "Minato and Kushina were a couple from the time that he rescued her, and with his love, Kushina was able to keep the Nine-Tails sealed within her at bay. They eventually married. From observing a Tailed Beast Ball, Minato began a three-year process of creating the Rasengan, the height of shape transformation. He would spend the rest of his life trying to combine it with his own nature.",
      "After proving himself an accomplished and responsible ninja, Minato was placed in charge of his own team, consisting of Rin Nohara, Obito Uchiha, and Kakashi Hatake. In the anime, the Third Hokage gave Minato the special task of helping Kakashi overcome the bitterness caused by his father's death and remind him of the human element of being a ninja. Minato often held back less against the prodigious Kakashi than with Rin and Obito so they couldn't obtain the bells without teamwork. Unfortunately, Kakashi realised this, but only used Obito and Rin as a means to an end to obtain the bells. Nonetheless, he passed them because they accomplished the goal of the test by working as a team. Although he did encourage them to improve their teamwork afterwards, a message that Obito and Rin took to heart, but fell on deaf ears with Kakashi.",
      "When Konoha became involved in the Third Shinobi World War, Minato's obligations became split between training his students and helping with the war effort. During a mission into Kusagakure to destroy the Kannabi Bridge, Minato transferred leadership of the mission to Kakashi – who had recently become a jōnin – while he headed to the front lines. He met up with the surviving and out-numbered Konoha ninja and single-handedly wiped out the opposing Iwagakure forces. In the anime, his victory in this battle against a thousand ninja convinced the Third Tsuchikage to accept a peace treaty. Minato's competing obligations would later repeat the tragedy of Obito's death: while he was away on another mission, Rin was kidnapped by Kirigakure and died during Kakashi's attempt to retrieve her.",
      "Minato encountered A of Kumogakure a number of times during the war."
    ],
    "images": [
      "https://static.wikia.nocookie.net/naruto/images/7/71/Minato_Namikaze.png/revision/latest?"
    ]
  },
  "Sasuke Uchiha": {
    "info": {
      "Birthdate": "July 23",
      "Sex": "Male",
      "Age": "Part I: 12–13, Part II: 16–17",
      "Height": "Part I: 150.8 cm–153.2 cm, Part II: 168 cm, Blank Period: 182 cm",
      "Weight": "Part I: 42.2 kg–43.5 kg, Part II: 52.2 kg",
      "Blood type": "AB",
      "Kekkei Genkai": "Sharingan,  Eternal Mangekyō Sharingan,  Rinnegan",
      "Classification": "Missing-nin",
      "Occupation": "Head of the Uchiha Clan",
      "Affiliation": "Konohagakure,  Otogakure,  Ryūchi Cave,  Akatsuki",
      "Team": "Team Kakashi,  Sound Four, Taka",
      "Clan": "Uchiha Clan"
    },
    "about": [
      "Sasuke Uchiha (うちはサスケ, Uchiha Sasuke) is one of the last surviving members of Konohagakure's Uchiha clan. After his older brother, Itachi, slaughtered their clan, Sasuke made it his mission in life to avenge them by killing Itachi. He is added to Team 7 upon becoming a ninja and, through competition with his rival and best friend, Naruto Uzumaki, Sasuke starts developing his skills. Dissatisfied with his progress, he defects from Konoha so that he can acquire the strength needed to exact his revenge. His years of seeking vengeance and his actions that followed become increasingly demanding, irrational and isolates him from others, leading him to be branded as an international criminal. After learning the truth of his brother's sacrifice, later proving instrumental in ending the Fourth Shinobi World War, and being happily redeemed by Naruto, Sasuke decides to return to Konoha and dedicate his life to help protect the village and its inhabitants, becoming referred to as the \"Supporting Kage\" (支う影, Sasaukage, literally meaning: Supporting Shadow).",
      "Sasuke is the second and youngest son of Mikoto and Fugaku Uchiha; they named him after Sasuke Sarutobi in the hopes that he would someday be just as strong of a shinobi. Itachi in return rarely helped Sasuke himself become a better shinobi; when asked, he would often instead poke Sasuke's forehead and promise to do so some other time. Sasuke found this annoying, but didn't allow it to blemish his high opinion of his brother.",
      "On entering the Konoha Ninja Academy, Sasuke proved to be the standout of his class, consistently getting top grades. Fugaku stated his pride in Sasuke for this accomplishment, but at the same time encouraged him not to follow in Itachi's footsteps.",
      "After a long day of training, Sasuke returned home one night to find the streets littered with the bodies of the Uchiha. He rushed home to notify his family of this Uchiha Clan Massacre, only to find Itachi standing over the bodies of their parents. Sasuke tried to solicit help and comfort from Itachi, who responded by using Tsukuyomi on him to torment him with visions of him murdering their family. Horrified by what Itachi had done, Sasuke pleaded for an explanation, to which Itachi replied that it was to test his own power. Fearful that he would be next, Sasuke tried to run. Itachi cornered him and explained that Sasuke, as he then was, would not be worth killing. Only by becoming stronger, such as by acquiring his own Mangekyō Sharingan, could he prove a worthwhile challenge to Itachi's abilities. Before leaving, Itachi encouraged Sasuke to hate him, to desire revenge, and to gain power from that. Sasuke immediately followed through, pursuing Itachi and using his newly-awakened Sharingan to attack him. The attack failed and Sasuke passed out, but not before glimpsing Itachi crying; Sasuke would forget this had happened for many years.",
      "Sasuke, now one of the last surviving Uchiha, was alone. He spent the first few days after the massacre wandering his family's compound, reflecting on the people who were now gone, killed by Itachi. Sasuke decided to do what Itachi had instructed and dedicated his life to vengeance, having no other interest than bringing about Itachi's death. He threw himself into his studies at the Academy, making no efforts to form friendships and ignoring all of the girls' attempts to gain his affection. One of his classmates, Naruto, disliked Sasuke's cool personality and the attention he received, and developed a one-sided rivalry in his pursuit to prove himself just as good as, if not better than, Sasuke. For his part, Sasuke thought little of Naruto and was usually annoyed by his outbursts, but would, at times, secretly smile at how hard Naruto worked because of him. Ironically, for all the attention he received, Naruto was the only person among his peers who understood Sasuke due to the painful experiences he had.",
      "Sasuke was a happy child, eager to please and be worthy of his clan name. ",
      "In his pursuit for the power to take his revenge, whenever he meets new people, he makes an evaluation of their abilities: those he perceives to be weaker than himself he arrogantly disregards, giving them little attention so that they won't hold him back; those he perceives as stronger he fixates over and tries to surpass. As a member of Team 7 he is repeatedly exposed to Kakashi Hatake's philosophy that there is strength in teamwork. For a time, Sasuke accepts this, experiencing it first-hand on several of Team 7's missions. He even become attached to his teammates and started to forget the vengeance he craved, achieving after so many years a measure of happiness. However, between both the manipulations of Orochimaru and meeting Itachi again in Part I, where he was and is utterly defeated, Sasuke decides to sever all ties to his village in a single-minded pursuit of power, leaving Konoha to focus solely on himself. Kakashi tried to help Sasuke realise the contradiction in his viewpoint: he is driven to gain power because he lost his family, yet sacrifices the family he still has (Team 7) in order to gain that power, which did have a profound impact on Sasuke and would have turned him away from the path of darkness had he not been influenced by the Sound Four. "
    ],
    "images": [
      "https://static.wikia.nocookie.net/naruto/images/2/21/Sasuke_Part_1.png/revision/latest?",
      "https://static.wikia.nocookie.net/naruto/images/1/13/Sasuke_Part_2.png/revision/latest?",
      "https://static.wikia.nocookie.net/naruto/images/b/b7/Sasuke_Part_3.png/revision/latest?"
    ]
  },
  "Sakura Haruno": {
    "info": {
      "Birthdate": "March 28",
      "Sex": "Female",
      "Age": "Part I: 12–13, Part II: 15–17",
      "Height": "Part I: 148.5 cm–150.1 cm, Part II: 161 cm, Blank Period: 165 cm",
      "Weight": "Part I: 35.4 kg–35.9 kg, Part II: 45.4 kg",
      "Blood type": "O",
      "Classification": "Medical-nin",
      "Occupation": "Director of Konoha Children Mental Health Clinic, Head of Konoha Medical Department",
      "Affiliation": "Konohagakure,  Allied Shinobi Forces,  Shikkotsu Forest",
      "Team": "Team Kakashi, Konoha 11 (Anime only), Team Asuma (Anime only), Kazekage Rescue Team, Eight Man Squad, Team Three (Anime only), Third Division, Hanabi Rescue Team (Movie only), Ino–Saku–Sai (Novel only), Medic Corps",
      "Clan": "Uchiha Clan"
    },
    "about": [
      "Sakura Uchiha (うちはサクラ, Uchiha Sakura, née Haruno (春野)) is a kunoichi of Konohagakure. When assigned to Team 7, Sakura quickly finds herself ill-prepared for the duties of a shinobi. However, after training under the Sannin Tsunade, she overcomes this, and becomes recognised as one of the greatest medical-nin in the world.",
      "Sakura is the only child of Mebuki and Kizashi Haruno. She had an ordinary childhood, raised by her parents without any serious tragedy or complications, unlike her team members. When she entered Konoha's Academy, a few of the girls in her class started picking on her because of her broad forehead. Sakura tried to combat their teasing by hiding her forehead with her bangs, but this proved to the other girls that it bothered her and caused them to tease her even more. Ino Yamanaka, one of her classmates, saw this, and defended Sakura from her bullies and encouraged her to embrace her forehead rather than hide it.",
      "Over the following years, Ino's guidance and friendship helped Sakura become comfortable with herself and develop into her own person. Though she felt indebted to Ino for helping her, Sakura began to feel that she was living in Ino's shadow when she, instead, wanted to be Ino's equal. At some point after she entered in the Academy, Sakura met Sasuke Uchiha and she developed a crush on him. When she told her friends, she was surprised to learn how popular Sasuke was with the girls. Sakura heard a rumour of Sasuke being attracted to girls with long hair and she began letting her hair grow to get his attention. A couple of years later, when she learned Ino had a crush on Sasuke, Sakura ended their friendship so that they could compete for Sasuke's love, thus beginning a bitter rivalry between them. After they were placed in their teams, Sakura approached Ino, telling her of her liking towards Sasuke. Ino revealed that she too had feelings towards him. Sakura took it to end their friendship, starting their dislike towards each other in the beginning of the series.",
      "As a child, Sakura was insecure and highly self-conscious about her large forehead, covering it with her bangs. It was not until she met Ino, who defended her from bullies and became her friend, that she become more self-confident. At the start of Part I, Sakura typically gives the outward impression of being polite to her superiors, considerate of her peers, and confident in herself. She has occasional moments of bashfulness around Sasuke and competitiveness around Ino, but otherwise appears quite collected. This reservation, though never disingenuous, frequently masks how Sakura feels: in certain situations, she has pronounced feelings of delinquency, jealousy, and anger. Rather than display these emotions to others, she projects them inward, allowing a manifestation of who she truly is — what is labelled \"Inner Sakura\" (内なるサクラ, Uchi Naru Sakura) — to have the opinions Sakura wants to keep to herself. Inner Sakura, whose appearances are marked by an exclamation of \"Shannarō!\", is in a sense a personality separate from Sakura herself, a fact that allows her to overcome the Mind Body Switch Technique. At other times, Sakura and Inner Sakura are indistinguishable from each other, usually with regards to Naruto. If Naruto says or does something that annoys or upsets her, Sakura responds with violence, a reaction that under other circumstances would be delegated to Inner Sakura.",
      "As Part I progresses, Sakura becomes increasingly exposed to the realities of the world, difficulties for which she cannot rely upon Inner Sakura to cope with alone. When she was an Academy student, Sakura succeeded through studying alone to the point of pride, able to avoid physical trials and thus allowing her to focus on her physical appearance in a bid to appeal to Sasuke. As a shinobi, however, this is proven insufficient as her long hair can become a liability for opponents to exploit. Missions cannot be truly completed merely with book smarts, and it is necessary to be able to fight so that other shinobi will not kill her or her teammates. The latter makes Sakura particularly disappointed in herself, as she is unable to contribute much in battle and must rely on Naruto and Sasuke to save her. She sets out to change this about herself, dedicating nearly three years of training to making herself as capable as Naruto and Sasuke; in the meantime, she becomes willing to sacrifice herself to protect them, coming to value them both very deeply. She looks to Naruto as a model for this goal, inspired by his rapid growth and his determination to be there for her and all those he held dear. When Sakura realises that she is as rude to Naruto as Sasuke usually is to her at his urging, she starts treating him better, cheering for his accomplishments, and confiding her hopes and fears with him.",
      "Inner Sakura makes one appearance at the very start of Part II and then is never seen in the series again.",
      "Sakura has been in love with Sasuke since childhood and initially focuses on getting his attention above everything else. Her initial infatuation for him was rooted in his good looks, and calm, collecting attitude, and his rejections failed to deter her. Despite being grateful of her loving him after she confesses to stop him from defecting from Konoha, Sasuke rejects her but thanks her before leaving."
    ],
    "images": [
      "https://static.wikia.nocookie.net/naruto/images/6/64/Sakura_Part_1.png/revision/latest?",
      "https://static.wikia.nocookie.net/naruto/images/b/ba/Sakurap2.png/revision/latest?",
      "https://static.wikia.nocookie.net/naruto/images/a/a5/Sakura_Part_III.png/revision/latest?"
    ]
  },
  "Kakashi Hatake": {
    "info": {
      "Birthdate": "September 15",
      "Sex": "Male",
      "Age": "Part I: 26–27, Part II: 29–31",
      "Height": "Part I: 181 cm",
      "Weight": "Part I: 67.5 kg",
      "Blood type": "O",
      "Kekkei Genkai": "Sharingan,  Mangekyō Sharingan",
      "Occupation": "Anbu Captain (Former), Third Division Commander of the Allied Shinobi Forces, Hokage, Genin Exams Proctor (Anime only)",
      "Affiliation": "Konohagakure,  Root (Anime only),  Allied Shinobi Forces",
      "Team": "Team Minato, Team Ro (Anime only), Team Kakashi, Kazekage Rescue Team, Team Asuma (Temporarily), Team One (Anime only), Team 8 (Temporarily), Eight Man Squad, Third Division",
      "Clan": "Hatake Clan"
    },
    "about": [
      "Kakashi Hatake (はたけカカシ, Hatake Kakashi) is a shinobi of Konohagakure's Hatake clan. Famed as Kakashi of the Sharingan (写輪眼のカカシ, Sharingan no Kakashi), he is one of Konoha's most talented ninja, regularly looked to for advice and leadership despite his personal dislike of responsibility. To his students on Team 7, Kakashi teaches the importance of teamwork, a lesson he received, along with the Sharingan, from his childhood friend, Obito Uchiha. After the Fourth Shinobi World War, Kakashi becomes Konoha's Sixth Hokage (六代目火影, Rokudaime Hokage, literally meaning: Sixth Fire Shadow).",
      "Because his mother died when he was very young,",
      "In the Academy, Kakashi earned top grades, earning him recognition as a prodigy and the best of his generation.",
      "Konoha eventually became embroiled in the Third Shinobi World War. As part of the war effort, Team Minato was assigned to destroy the Kannabi Bridge in Kusagakure in order to cut off Iwagakure's supply line. Minato was needed on the front lines at the time, leaving Kakashi, recently promoted to jōnin at age 12, in charge. Before embarking on the mission, Minato and Rin gave him presents to celebrate his promotion; Obito forgot to get him anything. Shortly after entering Kusa, they encountered an Iwa-scout, Mahiru. Kakashi tried to eliminate him with his new jutsu, Chidori, but the attack speed left him vulnerable to counter-attack, forcing Minato to step in, save Kakashi, and kill Mahiru himself. Before leaving them, Minato advised Kakashi to not use the Chidori again.",
      "Kakashi, Rin, and Obito continued further in to Kusa. They were eventually found by Mahiru's teammates, Kakkō and Taiseki, who kidnapped Rin in order to find out what their mission was. Obito immediately suggested that they rescue her, but Kakashi elected to abandon Rin, believing it was more important to finish the mission before concerning themselves with her safety. Obito refused to go along with this and went off to save Rin by himself. Before he left, he told Kakashi that Sakumo had been a hero and that, although it was bad to abandon one's mission, it was worse to abandon one's teammates. Kakashi began carrying out the mission alone, but ultimately decided that Obito was right and went to join him. He arrived in time to save Obito from Taiseki with his White Light Chakra Sabre, which he inherited from his father.",
      "Taiseki turned invisible and tried launching a sneak attack on Obito. Kakashi protected him, but his left eye was badly damaged in the process. In that moment, Obito awakened his Sharingan and used it to kill Taiseki. They then entered the cave where Rin was being held, drove off Kakkō, and released Rin from the genjutsu he placed her under. Kakkō retaliated by forcing a cave-in and Kakashi, due to his damaged eye, was struck in his blind spot and had difficulty avoiding the falling rocks. Before he could be crushed by a large boulder, Obito pushed him out of the way, becoming trapped instead. Unable to get free and knowing his injuries were too serious to survive, Obito decided to make his last act giving Kakashi the present he forgot to give him earlier: his Sharingan to replace the eye Kakashi lost.",
      "After Rin transplanted Obito's Sharingan into him, Kakashi confronted Kakkō. His White Light Chakra Sabre was destroyed during the ensuing fight, but he succeeded in killing Kakkō with Chidori; due to the Sharingan's heightened vision, Kakashi was finally able to handle its speed. He went back to where Obito and Rin were, but Iwa reinforcements soon arrived and started constricting the rubble. Obito asked Kakashi to take Rin away and keep her safe, which Kakashi did, leaving Obito behind. As the Iwa-nin started surrounding them, Kakashi attacked them for as long as he could, holding them off until Minato eventually tracked them down and finished off the rest. Minato assisted them with destroying the Kannabi Bridge and then returned with them to Konoha to mourn Obito's death. Despite many from the Uchiha clan being against Kakashi wielding a Sharingan as he had no blood-ties to them, Fugaku Uchiha, the Uchiha head, chose to honour Obito's dying actions and let Kakashi keep his gift."
    ],
    "images": [
      "https://static.wikia.nocookie.net/naruto/images/2/27/Kakashi_Hatake.png/revision/latest?",
      "https://static.wikia.nocookie.net/naruto/images/2/25/Kakashi_Part_III.png/revision/latest?"
    ]
  },
  "Hashirama Senju": {
    "info": {
      "Birthdate": "October 23",
      "Sex": "Male",
      "Status": "Deceased",
      "Height": "Part II: 185.1 cm",
      "Weight": "Part II: 74 kg",
      "Blood type": "B",
      "Kekkei Genkai": "Wood Release",
      "Classification": "Sage",
      "Occupation": "Head of the Senju clan, Hokage",
      "Affiliation": "Konohagakure,  Allied Shinobi Forces",
      "Clan": "Senju Clan"
    },
    "about": [
      "Hashirama Senju (千手柱間, Senju Hashirama) was a member of the famed Senju clan. He himself was hailed as the \"God of Shinobi\" for his unmatched ninja prowess. Hashirama sought peace for the shinobi world, and to that end founded Konohagakure with his clan, his childhood friend and rival: Madara Uchiha and the Uchiha clan. He would later become the First Hokage (初代火影, Shodai Hokage, literally meaning: First or Founding Fire Shadow) of Konohagakure. Although he was not able to achieve peace during his lifetime, his legacy and vision for the world would continue to shape the village and the entire shinobi world even after his death.",
      "Hashirama was born during the Warring States Period, the eldest of Butsuma Senju's four sons. Hashirama and his brothers grew up on the battlefield waging constant war with the Senju's rivals: the Uchiha. During his infrequent downtime, Hashirama met a boy his own age named Madara. The two quickly developed a friendly rivalry, be it skipping stones or urinating in rivers, with Hashirama typically winning their contests. Hashirama did not approve of this practice of sending children to fight and die, believing it would only increase the bitterness between the Senju and Uchiha, thus causing more deaths.",
      "After the deaths of their brothers, Kawarama and later Itama, Hashirama and his remaining brother, Tobirama, decided a new shinobi system would need to be implemented to end the cycle of child deaths, a system that would require an alliance between the Senju and Uchiha. Like Hashirama, Madara was also a shinobi who had lost brothers on the battlefield. Together they imagined a world where children like themselves wouldn't need to fight and where their brothers would be safe from harm.",
      "Over the following years Hashirama and Madara continued to meet in combat. Hashirama could never bring himself to kill someone he still considered a friend, and Madara could never defeat Hashirama's superior abilities. In time, both Madara and Hashirama became leaders of their respective clans. Under Hashirama's leadership and extraordinary ninja prowess, the Senju began to best the Uchiha Clan until at one point Hashirama had both Madara and Izuna at his mercy. However, unable to find the resolve to kill his childhood friend, Hashirama tried to convince Madara to unite their two clans to make their childhood dreams a reality. A mortally wounded Izuna convinced Madara otherwise and they retreated, prompting Hashirama to send a cease-fire request. Although some Uchiha found the offer increasingly tempting, Madara was unwilling to accept after Tobirama killed his last remaining brother, Izuna. This did not stop some Uchiha from defecting to the Senju out of self-preservation.",
      "The Senju, the Uchiha, and all their affiliated clans came together to found a village of peace, where children would never need to die in battle. Hashirama and Madara, rekindling their childhood friendship, called that village Konohagakure. The other countries would soon follow Konohagakure's example and build their own hidden villages. It was his wish that Madara become Hokage, the village's leader and protector.",
      "True to his promise, Madara eventually attacked Konohagakure on multiple occasions.",
      "In the aftermath of the battle, Tobirama hid away Madara's body and Hashirama's wife, Mito, sealed the Nine-Tails within herself in order to contain its great power to Konoha's benefit. Although he defeated Kakuzu, other wars began to break out. "
    ],
    "images": [
      "https://static.wikia.nocookie.net/naruto/images/7/7e/Hashirama_Senju.png/revision/latest?"
    ]
  },
  "Tobirama Senju": {
    "info": {
      "Birthdate": "February 19",
      "Sex": "Male",
      "Status": "Deceased",
      "Height": "Part II: 182.3 cm",
      "Weight": "Part II: 70.5 kg",
      "Blood type": "A",
      "Classification": "Sensor Type",
      "Occupation": "Hokage",
      "Affiliation": "Konohagakure,  Allied Shinobi Forces",
      "Team": "Team Tobirama, Escort Unit",
      "Clan": "Senju Clan"
    },
    "about": [
      "Tobirama Senju (千手扉間, Senju Tobirama) was a member of the renowned Senju clan, who, together with his elder brother and the Uchiha clan, founded the first shinobi village: Konohagakure. Throughout his lifetime, Tobirama would work tirelessly to achieve political stability and implement the institutions that made the village system work, thus ensuring Konoha's continuity and prosperity. After his brother's death, he would earn the title of Second Hokage (二代目火影, Nidaime Hokage, literally meaning: Second Fire Shadow).",
      "Tobirama was born during the Warring States Period, and was the second of Butsuma Senju's four sons. He and his brothers grew up on the battlefield waging constant war with their rivalling clans especially the Uchiha. After the deaths of their brothers: Kawarama and later Itama, Tobirama and his older brother, Hashirama, decided a new shinobi system would need to be implemented to end the cycle of child deaths — a system that would require an alliance between the warring clans. At some point in time, it became apparent that Hashirama got into the habit of disappearing into the forest for extended periods, and as such, Tobirama accepted his father's assignment to follow Hashirama and find out what he was doing.",
      "From tracking Hashirama, Tobirama discovered that he was meeting with a boy named Madara: a young Uchiha. After Tobirama reported this to their father, Butsuma pressured Hashirama to lead Madara into an ambush to be carried out by himself and Tobirama. Upon springing the trap, however, they were met by Madara's family — who had similar plans and while their fathers clashed — Tobirama fought Izuna Uchiha: Madara's younger brother. Hashirama and Madara were able to negotiate a temporary ceasefire, allowing all of them to walk away without bloodshed. In the years following their families would continue to clash, Hashirama against Madara and Tobirama against Izuna. On one occasion Tobirama eventually mortally wounded Izuna.",
      "Hashirama, by then the leader of the Senju, tried to use Izuna's fate to broker peace between their clans, but Madara — at Izuna's behest — refused. His refusal increasingly became the minority view, with individual Uchiha siding with the Senju in growing numbers. After Izuna succumbed to his injuries, Madara, wracked with grief, made one final stand against the Senju and was summarily defeated. Tobirama attempted to kill Madara to finally end the fighting, but Hashirama stopped him, knowing that would only renew hostilities between the Senju and Uchiha. Madara offered to surrender if Hashirama would kill himself or Tobirama. Hashirama agreed to take his own life, and as he made preparations he instructed Tobirama, despite his protests, not to seek retribution. Madara ultimately withdrew his request and agreed to peace.",
      "The Senju, the Uchiha, and all their affiliated clans came together to found Konoha, a village of peace where children would never need to die in battle.",
      "Under Hashirama's leadership, the new system of ninja villages achieved peace for a time. Eventually, Tobirama started training his own three-man team consisting of Hiruzen Sarutobi, Homura Mitokado, and Koharu Utatane.",
      "Tobirama's role as Hokage included helping Konoha's shinobi transition from valuing their clan above all else to valuing the village and everyone in it."
    ],
    "images": [
      "https://static.wikia.nocookie.net/naruto/images/b/be/Tobirama_Senju.png/revision/latest?"
    ]
  },
  "Madara Uchiha": {
    "info": {
      "Birthdate": "December 24",
      "Sex": "Male",
      "Status": "Deceased",
      "Height": "Part II: 179 cm",
      "Weight": "Part II: 71.3 kg",
      "Blood type": "O",
      "Kekkei Genkai": "Sharingan,  Eternal Mangekyō Sharingan,  Rinnegan,  Wood Release,  Storm Release",
      "Kekkei Mōra": "Rinne Sharingan",
      "Classification": "Jinchūriki, Missing-nin, Sensor Type, Sage",
      "Tailed Beast": "Ten-Tails (Forms)",
      "Occupation": "Co-founder of Konohagakure, Head of the Uchiha clan (Former)",
      "Affiliation": "Konohagakure,  Akatsuki",
      "Partner": "Obito Uchiha, Black Zetsu",
      "Clan": "Uchiha Clan"
    },
    "about": [
      "Madara Uchiha (うちはマダラ, Uchiha Madara) was the legendary leader of the Uchiha clan. He founded Konohagakure alongside his childhood friend and rival, Hashirama Senju, with the intention of beginning an era of peace. When the two couldn't agree on how to achieve that peace, they fought for control of the village, a conflict which ended in Madara's death. Madara, however, rewrote his death and went into hiding to work on his own plans. Unable to complete it in his natural life, he entrusted his knowledge and plans to Obito Uchiha shortly before his actual death. Years later, Madara would be revived, only to see his plans foiled and ultimately, and finally, realising the error of his ways and making amends with Hashirama before his final death.",
      "Madara was born during the Warring States Period, and was the eldest of Tajima Uchiha's five children.",
      "During his infrequent downtime, Madara met a boy his own age named Hashirama. The two quickly developed a friendly rivalry, be it skipping stones or urinating in rivers. Like Madara, Hashirama was also a shinobi who had lost his brothers on the battlefield. Together they imagined a world where children like themselves wouldn't need to fight.",
      "Over the following years Madara and Hashirama continued to meet in combat. Madara could never defeat Hashirama — even after acquiring a Mangekyō Sharingan — and Hashirama could never bring himself to kill someone he still considered a friend, resulting in a constant stalemate between the two that lasted decades. In time, both Madara and Hashirama became leaders of their respective clans, a position Hashirama tried to use to broker peace between them.",
      "The Senju, the Uchiha, and all their affiliated clans came together to found a village of peace, where children would never need to die in battle. Madara and Hashirama, rekindling their childhood friendship, and Madara called that village Konohagakure, seeing it through leaves.",
      "The Stone Tablet Zetsu altered",
      "News of Madara's death spread fast and his corpse was secretly hidden to keep anyone from finding it and profiting from it. But Madara had planned ahead: he had scheduled an Izanagi to activate sometime after his death, changing reality to bring him back to life in exchange for his right eye's vision. Having expected this, Black Zetsu located Madara's corpse and hid itself inside Madara's body, allowing it to later deceive Madara into thinking he created it. After being revived, he left a copy in place of his real body and went into hiding with a special trophy from his fight with Hashirama: a mouthful of Hashirama's flesh that he transplanted into his wounds. It was not until decades later, towards the end of Madara's natural life, that the cells had any effect, awakening the Rinnegan (in the process restoring his right eye). With the Rinnegan he was able to summon the Demonic Statue of the Outer Path, which he used to cultivate a mindless living clone of Hashirama from which he believed he had produced a White Zetsu Army."
    ],
    "images": [
      "https://static.wikia.nocookie.net/naruto/images/0/0c/Madara_img2.png/revision/latest?"
    ]
  },
  "Maito Gai": {
    "info": {
      "Birthdate": "January 1",
      "Sex": "Male",
      "Age": "Part I: 26–27, Part II: 30–31",
      "Height": "Part I: 184 cm",
      "Weight": "Part I: 76 kg",
      "Blood type": "B",
      "Occupation": "Academy Teacher (Anime only)",
      "Affiliation": "Konohagakure,  Allied Shinobi Forces",
      "Team": "Team Chōza, Team Guy, Third Division"
    },
    "about": [
      "Might Guy (マイト・ガイ, Maito Gai) is a jōnin of Konohagakure. A master of taijutsu, Guy leads and passes his wisdom onto the members of Team Guy.",
      "Guy is the son of Might Duy, who was known throughout Konoha as the \"Eternal Genin\". Duy was not bothered by this moniker and instead was grateful that other people cared enough to know him at all. Duy encouraged this same kind of optimism in Guy, as well as his belief that one always has youth and that they could both become taijutsu masters through diligent training. Guy did his best to embody his father's teachings, but had doubts that Duy's words were devoid of meaning. He nevertheless loved his father and fought others when they called Duy the \"Eternal Genin\" mockingly; when one of these fights landed him in the Konoha Hospital, Duy encouraged Guy not to be upset by this loss and to instead remember that victory is achieved by defending things that are important.",
      "Guy applied to enter Konoha's Ninja Academy, but did not pass the entrance exam. Kakashi Hatake was not surprised due to Guy's lack of talent in ninjutsu and genjutsu, which Guy chose to take as a supportive observation. This strength of character convinced Kakashi's father, Sakumo, that Guy was not handicapped by his shortcomings and that he might be offered a position as an alternate in the year's Academy class.",
      "Guy at some point decided that Kakashi was his lifelong rival,",
      "In the anime, Guy was aware of the losses Kakashi experienced during and after the Third Shinobi World War and tried to help him deal with them. Following the death of Obito Uchiha, Guy filled in for Obito while Team Minato was on a mission into Iwa-territory. When they were surrounded, Guy tried giving his life to allow Kakashi to escape, but they were able to fight off their enemies until reinforcements arrived.",
      "Guy at some point heard about a boy in the Academy who was unable to use ninjutsu or genjutsu. Guy approached this boy, Rock Lee, and encouraged him to use his youth to keep training. Lee was eventually added to Guy's Team Guy, along with Neji Hyūga and Tenten;",
      "Guy is perhaps most fully represented by his \"nice guy\" pose: a thumbs up, wink, and winning smile - complete with the proverbial ping. The pose captures his optimism and confidence, as by striking the pose he is promising that whatever words accompany it are either true now or will become true in time. It represents his energy, as he will, through his understood-only-to-himself-and-select-others \"Power of Youth (青春, seishun)\", enthusiastically seek to live up to his promise no matter the personal investment doing so will require of him. It plumbs his deep emotional well because he only reserves it for the most important promises to the most important people for the most important reasons, and as such tears frequently stream down the face of somebody (inevitably Guy) when the pose is struck. He is a very driven and committed man, both to his principles and his training, constantly pushing himself to go beyond his limits. In the anime, it was shown that even after gaining effective use ninjutsu and genjutsu, he makes it a personal choice to rely solely on taijutsu whenever possible, even prefers unconvincing disguises rather than the Transformation Technique. "
    ],
    "images": [
      "https://static.wikia.nocookie.net/naruto/images/3/31/Might_Guy.png/revision/latest?",
      "https://static.wikia.nocookie.net/naruto/images/b/b3/Might_Guy_Part_III.png/revision/latest?"
    ]
  },
  "Hinata Hyuga": {
    "info": {
      "Birthdate": "December 27",
      "Sex": "Female",
      "Age": "Part I: 12–13, Part II: 16",
      "Height": "Part I: 147.3 cm–148.3 cm, Part II: 160 cm, Blank Period: 163 cm",
      "Weight": "Part I: 37.9 kg–38.2 kg, Part II: 45 kg",
      "Blood type": "A",
      "Kekkei Genkai": "Byakugan",
      "Occupation": "Heiress of the Hyūga Clan (Former)",
      "Affiliation": "Konohagakure,  Allied Shinobi Forces",
      "Team": "Team 8, Konoha 11 (Anime only), Bikōchū Search Team (Anime only), Peddlers Escort Team (Anime only), Team Three (Anime only), Eight Man Squad, Second Division, Hanabi Rescue Team (Movie only)",
      "Clan": "Hyūga Clan,  Uzumaki Clan"
    },
    "about": [
      "Hinata Uzumaki (うずまきヒナタ, Uzumaki Hinata, née Hyūga (日向)) is a kunoichi of Konohagakure. Formerly the heiress of the Hyūga clan, she lost the position upon being deemed unsuited for the responsibilities of leading the clan. Nonetheless, Hinata persevered and from her observation of Naruto Uzumaki especially, Hinata found an example to follow. Through her membership with Team 8, she sought to become strong enough to change herself, if even a little at a time. A few years after the Fourth Shinobi World War, Hinata joined the Uzumaki clan after marrying Naruto.",
      "Hinata is the oldest daughter of Hiashi Hyūga. When she was still a child, Hinata was almost kidnapped by the-then Head Ninja of Kumogakure, who was visiting Konoha under the guise of signing a peace treaty between their two villages. Hiashi killed him and saved Hinata, setting in motion the events that would become known as the \"Hyūga Affair\".",
      "Because Hiashi was the head of the Hyūga clan, Hinata was raised to be its heiress and her family expected great things from her. But even at a young age, her father came to believe that Hinata was not suited for the role of heiress, as she struggled under his gruesome training regime, on top of him also believing that her timid personality prevented her from truly excelling. When Hinata's younger sister Hanabi started displaying superior talent, Hiashi began to reconsider Hinata's selection as heiress. In the anime, Hinata and Hanabi were pitted against each other to determine who would one day lead the Hyūga. Because Hinata was unwilling to harm Hanabi - a hesitation Hanabi did not share - she was defeated, disappointing her father.",
      "On the day of her enrolment in Konoha's Academy,",
      "As a child, Hinata was soft-spoken and polite, always addressing people with proper honourifics. She is kind, always thinking of others more than for herself, caring for their feelings and well-being. She doesn't like being confrontational for any reason. This led to her being meek or timid to others, as her overwhelming kindness can render her unable to respond or act for fear of offending somebody. Despite being disinherited, Hinata loves her family very much, as shown when she \"agreed\" to marry Toneri in order to rescue Hanabi even though she knew it meant breaking Naruto's heart and the possibility she and Toneri actually would get married.",
      "Hinata's outlook sees a shift after her appointment to Team 8. Whereas her father and much of the Hyūga clan had decided she was a lost cause who would never amount to anything,",
      "Hinata's primary motivation is Naruto Uzumaki, with whom she has been fascinated since meeting him. He initially gained her attention because of his kindness to her and outspoken nature, and then kept her attention because of similarities that Hinata perceived to herself: Naruto had a painful childhood without the love of parents, a fate worse than the mere difficulty she had with her own father, and he craves the attention and acknowledgement of anybody, just as Hinata wants to please her father. "
    ],
    "images": [
      "https://static.wikia.nocookie.net/naruto/images/9/97/Hinata.png/revision/latest?",
      "https://static.wikia.nocookie.net/naruto/images/7/79/Hinata_Part_II.png/revision/latest?",
      "https://static.wikia.nocookie.net/naruto/images/1/15/Hinata_Uzumaki.png/revision/latest?"
    ]
  },
  "Neji Hyuga": {
    "info": {
      "Birthdate": "July 3",
      "Sex": "Male",
      "Age": "Part I: 13–14, Part II: 17–18",
      "Status": "Deceased",
      "Height": "Part I: 159.2 cm–160.1 cm, Part II: 172.1 cm",
      "Weight": "Part I: 45.8 kg–46.8 kg, Part II: 54.2 kg",
      "Blood type": "O",
      "Kekkei Genkai": "Byakugan",
      "Affiliation": "Konohagakure,  Allied Shinobi Forces",
      "Team": "Team Guy, Sasuke Recovery Team, Konoha 11 (Anime only), Star Guard Team (Anime only), Second Division",
      "Clan": "Hyūga Clan"
    },
    "about": [
      "Neji Hyūga (日向ネジ, Hyūga Neji) was a shinobi of Konohagakure's Hyūga clan. Though a prodigy even by the Hyūga's standards, Neji was a member of the clan's branch house; no matter how skilled he became, he would always be in service to the Hyūga's main house, a fact that convinced him fate was predetermined. After experiencing Naruto Uzumaki's refusal to be limited by such an ideology, Neji realised his fate was what he chose it to be, and as a member of Team Guy he sought the strength necessary to make the future he wanted for his family and friends, and ultimately sacrificed his life to protect the very same person who taught him about the freedom of one's choice of fate, Naruto.",
      "Neji was born the son of Hizashi Hyūga, placing him in one of the Hyūga clan's branch houses. When the heiress of the main house, Hinata, turned three years old, Neji's forehead was branded with the customary cursed seal by his uncle, Hiashi.",
      "Shortly after Neji received his cursed seal, a Kumogakure Head Ninja visiting Konoha took advantage of a peace treaty and attempted to kidnap Hinata in order to gain the secrets of the Byakugan. Hiashi stopped and killed the Head Ninja.",
      "Neji became spiteful towards the members of the main house for what he believed they'd done to his father; in the anime, he missed no opportunity to try and harm Hinata. He also came to believe that the course of a person's life was determined from the moment of their birth and could be altered under no circumstances. When he graduated from the Academy at the top of his class he was added to Team Guy, where his philosophy placed him at odds with one of his teammates, Rock Lee: Lee wanted to become a great ninja despite his limitations, which Neji believed was impossible. Tenten was easily wowed by Neji, but Lee became determined to defeat Neji in a fight to prove him wrong. Their instructor, Might Guy, encouraged this, believing competition and the drive to succeed would push them to new heights.",
      "As a child, Neji was kind and prone to smiling; on Hinata's third birthday, he confided to his father that he thought she was cute. He lost these qualities after his father's death, growing serious and cold, more mature than most his age. For years he was driven by a fatalistic belief that his and everyone else's fates were determined from birth and were inescapable. He perceived his own destiny as being that of a rare talent, causing him to arrogantly place himself above those he believes are \"weaker\" than himself. He also perceived that his talents would always be handicapped by mandatory servitude to the Hyūga's main house, which he resented and it fuelled his animosity towards the main house and its members.",
      "Neji shared his philosophy about fate with those he met, gladly telling them when they are straying from the paths that have been set out for them by, for example, trying to exceed their natural limitations or trying to defeat him in combat when they lack any obvious ability to do so. When he shared his philosophy with Hinata, she concluded that his insistence upon destiny was actually a sore spot for him that caused him inner suffering: he so badly wanted to prove himself to the main house yet feels incapable of doing so. Neji attempted to kill her in anger for her words. Naruto Uzumaki also disagreed with Neji, claiming that Neji was not realising his destiny because he was in fact holding himself back. Neji initially scoffed at Naruto's suggestion, but he was forced to reevaluate when Naruto, a \"failure\", defeats him, a \"genius\", in a fight.",
      "From his experience with Naruto, Neji felt that fate is not inescapable but that, rather, one's destiny is what one makes of it; he felt indebted to Naruto for releasing him from his prior \"darkness\". The destiny Neji ended up selecting for himself was to become strong enough to never lose again, although his inevitable destiny would soon come to hold true. In pursuit of this goal he trained with his teammates, whose own dreams he became supportive of, and later with members of the main house, whom he gradually started mending relations with. Over time his desire to get stronger became as much a motivation to never lose as it is to protect his friends and family. In particular, he embraced his responsibility as a member of a branch house to keep Hinata safe, showing greater concern for her than anyone else in combat situations and, ultimately, giving his life to save hers."
    ],
    "images": [
      "https://static.wikia.nocookie.net/naruto/images/8/8e/Neji_Part_I_Screenshot.png/revision/latest?",
      "https://static.wikia.nocookie.net/naruto/images/6/63/Neji_Part_2.png/revision/latest?"
    ]
  },
  "Jiraiya": {
    "info": {
      "Birthdate": "November 11",
      "Sex": "Male",
      "Age": "Part I: 50–51, Part II: 54",
      "Status": "Deceased",
      "Height": "Part I: 191.2 cm",
      "Weight": "Part I: 87.5 kg",
      "Blood type": "B",
      "Classification": "Sage, Sannin",
      "Occupation": "Writer",
      "Affiliation": "Konohagakure,  Mount Myōboku",
      "Team": "Team Hiruzen, Ame Orphans, Team Jiraiya"
    },
    "about": [
      "Jiraiya (自来也) was one of Konohagakure's Sannin. Famed as a hermit and pervert of stupendous ninja skill, Jiraiya travelled the world in search of knowledge that would help his friends, the various novels he wrote, and, posthumously, the world in its entirety – knowledge that would be passed on to his godson and final student, Naruto Uzumaki.",
      "After he graduated from Konoha's Ninja Academy, Jiraiya was teamed with Orochimaru and Tsunade under the leadership of Hiruzen Sarutobi. Hiruzen gave them a bell test for the team's first exercise, during which Jiraiya repeatedly fell for Hiruzen's tricks, and for failing to acquire a bell, he was tied to a stump as punishment. Hiruzen encouraged Jiraiya to be more like Orochimaru, but Jiraiya countered that his Transparent Escape Technique was a fair testament to his skills, as he could spy on bathing women without getting caught: Hiruzen offered to accompany him to see if this was true.",
      "Jiraiya at some point discovered Mount Myōboku, the residence of the toads; in the anime, he was brought there when he tried to summon a toad without first having a contract with them.",
      "At some point Jiraiya was made a jōnin As such, he took Minato as his disciple and taught him many of his skills; Minato would eventually teach Jiraiya the Rasengan. Gutsy Shinobi did not sell well when it was released. Eventually, Jiraiya found his writing style when he created the adult novels called Icha Icha. The novels were based on his personal experiences in love - particularly his rejections by Tsunade - retold in a comical way. The books were wildly popular, giving his chequebook a balance that is \"filled with zeroes\".",
      "Although their team under Hiruzen's leadership had disbanded, Jiraiya, Orochimaru, and Tsunade continued fighting together during the Second Shinobi World War. During one such fight in Amegakure, they were the only three to survive an encounter with Hanzō, for which accomplishment Hanzō dubbed them Konoha's \"Legendary Sannin\".",
      "Nagato was a kind child, torn between his desire to not hurt others and his wish to protect Yahiko and Konan. Jiraiya comforted Nagato that it was enough to want to protect people one holds to be important, as the world is plagued with seemingly endless conflict. Nagato decided that it was possible to end the constant bloodshed and, though he didn't know how, that he would someday find the path to peace. Jiraiya was inspired by Nagato's words and started writing what would become The Tale of the Utterly Gutsy Shinobi. After three years of training the orphans, Jiraiya decided they were ready to forge out on their own and he returned to Konoha; he left them a finished copy of Gutsy Shinobi, dedicated to Nagato.",
      "Minato - selected as Konoha's Fourth Hokage after Jiraiya refused the position"
    ],
    "images": [
      "https://static.wikia.nocookie.net/naruto/images/2/21/Profile_Jiraiya.PNG/revision/latest?"
    ]
  },
  "Tsunade Senju": {
    "info": {
      "Birthdate": "August 2",
      "Sex": "Female",
      "Age": "Part I: 51, Part II: 54–55",
      "Height": "Part I: 163.1 cm, Part II: 163.1 cm",
      "Weight": "Part I: 48.9 kg, Part II: 48.9 kg",
      "Blood type": "B",
      "Classification": "Medical-nin, Sannin",
      "Occupation": "Hokage",
      "Affiliation": "Konohagakure,  Shikkotsu Forest,  Allied Shinobi Forces",
      "Team": "Team Hiruzen",
      "Clan": "Senju Clan"
    },
    "about": [
      "Tsunade (綱手, Tsunade) is a descendant of the Senju and Uzumaki Clan, and is one of Konohagakure's Sannin. She is famed as the world's strongest kunoichi and its greatest medical-nin. The repeated loss of her loved ones caused Tsunade to later abandon the life of a shinobi for many years. She is eventually persuaded to return to Konoha and take on the mantle of Fifth Hokage (五代目火影, Godaime Hokage, literally meaning: Fifth Fire Shadow), where her skills prove invaluable to the village.",
      "Tsunade is the granddaughter of Hashirama Senju and Mito Uzumaki. Because Hashirama was the First Hokage of Konohagakure, Tsunade is called \"Princess\" (姫, Hime). Hashirama doted on Tsunade when she was very young because she was his first grandchild, and found her deviance and her adoption of his own gambling habits highly amusing.",
      "Tsunade's younger brother, Nawaki dreamed of someday becoming Hokage so that he could protect Konoha, their grandfather's legacy. On Nawaki's twelfth birthday, Tsunade kissed his forehead and gave him Hashirama's necklace in the hopes that it would help him achieve his dream. He died the next day, a casualty of the ongoing Second Shinobi World War, thus returning the necklace to her. Tsunade began advocating for the inclusion of medical-nin on all four-man squads in order to avoid future deaths like Nawaki's. Hiruzen, the Third Hokage, agreed with her arguments, but could not dedicate resources to the necessary implementation due to the ongoing war. Dan Katō, on the other hand, shared her views, and as their relationship developed he confided with her his dreams of becoming Hokage so that he could bring change to Konoha and protect his loved one from death. Tsunade kissed his forehead and gave him Hashirama's necklace in the hopes that it would help him achieve his dream.",
      "Although their team under Hiruzen's leadership had disbanded, Tsunade, Orochimaru, and Jiraiya continued fighting together during the Second Shinobi World War. During one such fight in Amegakure, they were the only three to survive an encounter with Hanzō, for which accomplishment Hanzō dubbed them Konoha's \"Legendary Sannin\". Tsunade was unable to prevent Dan's death, and her failure to stop his severe blood loss caused her to develop haemophobia.",
      "With Dan's death, Hashirama's necklace returned to Tsunade once again, convincing some that the necklace was cursed to kill anyone who wore it other than Tsunade. Tsunade herself became convinced that achieving one's dreams was impossible and that to be Hokage was a fool's job. She therefore left Konoha, taking Dan's niece, Shizune, with her to train her as an apprentice. Due to her haemophobia, Tsunade retired from any direct involvement in medicine or combat, instead relying on Shizune whenever a need for either came up.",
      "Tsunade was very willing to believe in the attainability of dreams while Nawaki and Dan were alive, and that by supporting and encouraging those dreams she might be able to help achieve them. When both died gruesomely shortly after receiving her support, Tsunade lost faith in the idea of dreaming for anything, believing that the mere pursuit of it would be doomed from the outset. She becomes especially critical of wanting to be Hokage, as both Dan and Nawaki died trying to attain the title and the past Hokage have all died prematurely and, as Tsunade argues, pointlessly because they held the position; she concludes that to be Hokage is a fool's job.",
      "Tsunade is forced to reconsider her cynicism upon meeting Naruto Uzumaki, who demonstrates two things to her: just because a goal seems impossible does not mean it actually is, as Naruto is able to master the Rasengan unprecedentedly quickly despite seemingly lacking any natural talent; just because the dreamer dies does not mean the dream itself does, as Nawaki and Dan's desire to become Hokage lives on in Naruto. Because Naruto is so very much an exception to how she thought the world worked, Tsunade puts her faith in dreams once again, a desire so strong that she overcomes her fear of blood. She becomes Hokage herself, partly so that she can live Nawaki and Dan's dream for them, but also so that she can pave the way for Naruto inevitably holding the title. Becoming close to Naruto, he became the only person she allowed to refer to her as \"Grandma\", knowing it was out of affection. "
    ],
    "images": [
      "https://static.wikia.nocookie.net/naruto/images/e/e6/Tsunade_Infobox.png/revision/latest?"
    ]
  },
  "Orochimaru": {
    "info": {
      "Birthdate": "October 27",
      "Sex": "Various",
      "Age": "Part I: 50–51, Part II: 54",
      "Height": "Part I: 179.4 cm–172 cm, Part II: 172 cm, Gaiden: 179.5 cm",
      "Weight": "Part I: 63.9 kg–57.3 kg, Part II: 57.3 kg",
      "Blood type": "B",
      "Kekkei Genkai": "Jūgo's Clan's Kekkei Genkai,  Sakon and Ukon's Kekkei Genkai,  Shikotsumyaku,  Wood Release",
      "Classification": "Missing-nin, S-rank, Sannin",
      "Occupation": "Founder and Leader of Otogakure, Scientist",
      "Affiliation": "Konohagakure,  Root,  Akatsuki,  Otogakure,  Ryūchi Cave",
      "Team": "Team Hiruzen, Team Orochimaru, Team Dosu",
      "Partner": "Sasori, Kabuto Yakushi"
    },
    "about": [
      "Orochimaru (大蛇丸, Orochimaru) is one of Konohagakure's legendary Sannin. With a life-ambition to learn all of the world's secrets, Orochimaru seeks immortality so that he might live all of the lives necessary to accomplish his task. After being caught red-handed performing unethical experiments on his fellow citizens for the sake of this immortality, Orochimaru defected from Konoha rather than be persecuted for his ambitions, and for many years sought the village's destruction in order to take revenge and demonstrate what he had learned. After several apparent deaths in the pursuit of his goals, Orochimaru realises his approach is flawed through Kabuto Yakushi, his former associate, and begins monitoring the choices and actions of his former apprentice, Sasuke Uchiha.",
      "Orochimaru was once an orphan who became a pupil of Hiruzen Sarutobi alongside Jiraiya and Tsunade. Compared to the more laid back Jiraiya, Orochimaru stood out as a genius — his talents, knowledge, and determination were considered by Hiruzen to be that of a prodigy seen only once in a generation.",
      "During the Second Shinobi World War, Orochimaru joined Jiraiya and Tsunade in fighting Hanzō, who gave them the title of Konoha's \"Three Legendary Shinobi\" (伝説の三忍, Densetsu no Sannin) as a reward for surviving their battle with him, while the rest of their group were easily slaughtered in the process.",
      "Some time after Team Hiruzen was disbanded, Orochimaru became an Anbu member and joined Root to work directly under Danzō Shimura, while also becoming a mentor to Anko Mitarashi. It was during that time that Orochimaru met Kabuto Yakushi while accompanying Danzō in forcing the boy's guardian, Nonō, into a mission.",
      "Orochimaru performed various experiments on his prisoners, some being fellow Konoha shinobi he kidnapped. He used them as human guinea pigs to develop techniques that would grant him immortality, the end result being Living Corpse Reincarnation. Some time later, Orochimaru was at the outskirts of Kirigakure as he found Kimimaro, the sole survivor of the Kaguya clan. Soon after, thanks in part to Kimimaro, Orochimaru's research on the source of Jūgo's powers led him to find the Ryūchi Cave and master senjutsu.",
      "Orochimaru was later sent on a mission by Danzō to Iwagakure to ensure that both Kabuto and Nonō, the former having joined Root as a spy, killed each other as they had become major liabilities. Orochimaru instead brought Kabuto to his hideout, which would become part of his personal hidden village, Otogakure, and revealed Root's intent for Kabuto's life and the role he was to play in it. Though Orochimaru revealed that he was also sent to kill the one who survived this ordeal, he told Kabuto that he saw a bit of himself in the boy and decided killing him would be a waste of great talent. Therefore, Orochimaru offered Kabuto a position as his right hand man and spy with the promise of an identity.",
      "As his test subjects began to die off, Orochimaru was caught red-handed by Hiruzen. Though he knew it was his duty, Hiruzen lacked the will to kill his student, allowing him to escape."
    ],
    "images": [
      "https://static.wikia.nocookie.net/naruto/images/1/14/Orochimaru_Infobox.png/revision/latest?",
      "https://static.wikia.nocookie.net/naruto/images/b/be/Orochimaru_Part_III.png/revision/latest?"
    ]
  },
  "Nagato": {
    "info": {
      "Birthdate": "September 19",
      "Sex": "Male",
      "Age": "Part II: 35",
      "Status": "Deceased",
      "Height": "Part II: 175.5 cm",
      "Weight": "Part II: 40.1 kg",
      "Blood type": "A",
      "Kekkei Genkai": "Rinnegan",
      "Classification": "S-rank, Sensor Type",
      "Occupation": "Akatsuki Leader, Village Head",
      "Affiliation": "Amegakure,  Akatsuki",
      "Team": "Ame Orphans",
      "Partner": "Konan",
      "Clan": "Uzumaki Clan"
    },
    "about": [
      "Nagato (長門, Nagato) was a shinobi of Amegakure and descendant of the Uzumaki clan. Forming Akatsuki alongside his friends (and fellow war orphans) Yahiko and Konan, Nagato dreamed of bringing peace to the violent shinobi world. However, following Yahiko's death, Nagato adopted the alias of Pain (ペイン, Pein) and, along with Konan, began leading a new Akatsuki — one that would force the world into peace using any means necessary.",
      "Nagato lived with his parents: Fusō and Ise on the outskirts of Amegakure. When he was very young, Madara Uchiha secretly transplanted his Rinnegan into Nagato without his or his parents' knowledge.",
      "After burying his parents, Nagato, now an orphan, was forced to leave home and begin wandering in search of food and shelter. With resources scarce due to the ongoing war, no one he met would help him until Nagato, who had collapsed from hunger, was found by Konan and Yahiko, orphans like himself. They banded together, acquired food to survive through any means, and shared dreams of a future where they were in charge and could use their power to eliminate war. Yahiko was particularly passionate about this point, which inspired Nagato to adopt the same goal.",
      "Jiraiya found a place for them to live and taught them how to fish, but he would not teach them ninjutsu. While the orphans were out one day, they were found and assaulted by an Iwagakure chūnin. Fearing for his friends' lives, Nagato used his Rinnegan to kill the Iwa-nin. When Jiraiya arrived on the scene to help them, he noticed Nagato's eyes for the first time and was reminded of the legends of the Sage of the Six Paths, the original possessor of the Rinnegan. Because of this, Jiraiya changed his mind and began teaching them ninjutsu. Nagato was remorseful for killing the Iwa-nin, but Jiraiya convinced him that sometimes violence and personal pain was necessary to protect others. In time he even shared his belief that Nagato was the Sage of Six Paths' reincarnation and that, like the original Sage, Nagato would use his Rinnegan to usher in a world of peace.",
      "Jiraiya trained the orphans for three years. Because of his Rinnegan, Nagato easily mastered everything he was taught.",
      "Throughout their quest for peace, Akatsuki's ranks swelled and became known throughout Amegakure, so much so that Hanzō of the Salamander, the village's leader, began to feel Akatsuki threatened his rule. He approached Akatsuki, offering to work together with them to help negotiate with the other warring villages. The next day, at a meeting to finalise the arrangement, Yahiko and Nagato were ambushed by Hanzō and his men, with support from Konoha's Danzō Shimura. Using Konan as a hostage, Hanzō threatened to kill her if Nagato did not kill Yahiko. Unwilling to let Nagato have that on his conscience, Yahiko impaled himself on Nagato's kunai, using his dying breath to state his faith that Nagato would change the world. Afterwards, Nagato severed his ties with Amegakure by slashing the village's symbol on his forehead protector, no longer wishing to be affiliated with Hanzō's village.",
      "Yahiko's death ultimately convinced Nagato that his philosophies about achieving peace were foolish; the world would never willingly end the cycle of death and hatred it had operated on for so long. Only through direct experience of war and all the losses and agonies it brought could anyone truly desire peace. Intending to personally bring that level of despair to the world, Nagato took on the name of \"Pain\". As the damage he'd received from Hanzō's attack and the link with the Demonic Statue left him frail and immobile, Nagato created the Six Paths of Pain out of corpses that he controlled remotely. For the Deva Path he used Yahiko's body — still wanting him to lead the organisation in spirit — and for the other five he used the corpses of other miscellaneous shinobi that, without his knowing it, had met Jiraiya when they were alive. Pain began leading Akatsuki in a new direction, secretly accepting Obito's earlier offer of support. Akatsuki composed itself with S-rank missing-nin and started offering its services as a mercenary group to ninja villages, earning the money necessary to fund its long-term plans."
    ],
    "images": [
      "https://static.wikia.nocookie.net/naruto/images/4/46/Nagato.png/revision/latest?"
    ]
  },
  "Sarada Uchiha": {
    "info": {
      "Birthdate": "March 31",
      "Sex": "Female",
      "Age": "Gaiden: 11, Boruto Movie: 12",
      "Height": "Blank Period: 125 cm, Boruto Movie: 147 cm",
      "Kekkei Genkai": "Sharingan",
      "Classification": "Medical-nin",
      "Affiliation": "Konohagakure",
      "Team": "Team 7",
      "Clan": "Uchiha Clan"
    },
    "about": [
      "Sarada Uchiha (うちはサラダ, Uchiha Sarada) is a kunoichi from Konohagakure's Uchiha clan. Because she was raised only by her mother without having her father around, Sarada initially struggles to understand who she is or what she's supposed to be. After meeting him with the help of Naruto Uzumaki, Sarada comes to believe that she is defined by the connections she has with others, and as a member of Team Konohamaru, she seeks to someday become Hokage so that she can connect with as many people as possible.",
      "Sarada is the only child of Sakura and Sasuke Uchiha. She was born while Sakura was accompanying Sasuke on his travels, and was delivered with the help of Karin in one of Orochimaru's hideouts;",
      "Sakura did her best to comfort Sarada during Sasuke's absence, assuring her that her father loved her and that, when he completed his important mission, he'd come home. When this conversation went on for too long, Sakura poked Sarada's forehead and promised to continue it some other time.",
      "As a child, Sarada was portrayed to be like her father, Sasuke, after the events of the Uchiha Clan Downfall: unfriendly, unsmiling and sullen, but this changed around the time of her Academy graduation. According to Naruto, her personality takes after Sakura's, which he bases on the suspicion that Sarada is \"scary\" when she's angry; Anger aside, she displays a normal range of emotions, from laughing to crying to blushing in appropriate situations, contrasting with Sasuke's typical stoic reaction to every circumstance. In most situations, Sarada is kind-hearted and brave, polite to others and considerate of her friends and family, wishing well for them and standing up for them when they need her. She doesn't mind saying what she's thinking, whether it's a question she wants the answer to, an opinion she holds firmly, or a frustration she can't let go of. Like Sakura, Sarada is quite well-read: she feels comfortable arguing the differences between a panda and a normal bear, and she is apparently the only participant in the Chūnin Exams to have heard of the book series called Shinobi Strategist Detective Story, much less read all four volumes.",
      "Sarada is appreciative of Naruto for his help in mending her relationship with her parents, finding him to be kind and warm. She is quite interested in his Will of Fire, wherein he tries to form bonds with everyone (particularly villagers of Konoha) that he can. Because of Naruto, Sarada decides to make it her dream to become Hokage, preferring the kind of life Naruto has to the life of her father. She is so fond of Naruto that in a conversation with Kawaki, she admits she has wondered on many occasions what her life would be like if she were Naruto's daughter, envying Boruto for the wonderful father he has and recriminating him for not appreciating and reproaching his father for his difficult work as a Hokage. In the anime, she even shows great appreciation for the Hokage Rock and fantasises about having her own likeness carved into it. However, Sarada shares a complicated relationship with Naruto's son, Boruto Uzumaki, although she is also interested in him due to their similar relationships with their respective fathers. The two ninjas are often at odds with one another, with the young Uchiha valuing the Hokage post while Boruto initially showing utter disdain for it, and they usually argue and fight with each other for almost anything. Despite this, they are very close, deeply caring for one another's well-being and actually supporting their dreams greatly. In the anime, Sarada appears to be close to Himawari as well, referring to her as \"Hima-chan\".",
      "Sasuke's prolonged absences upset Sarada, and she would periodically ask Sakura about him during her childhood. Sakura would do her best to field Sarada's questions about who Sasuke was, what he was doing, and how he felt about Sarada, yet at the same time she would speak cryptically, either giving vague answers or avoiding topics entirely, not wanting to tell her daughter her father's past and the details of his mission. Although she put up with this for many years, Sarada starts to feel that Sakura is withholding something from her in the days just before her graduation from the Academy, initially extending this assumed dishonesty to all medical-nin since Sakura is one. After getting into an argument about what Sakura may be hiding from her, Sarada comes to suspect about her own lineage, a suspicion that is briefly, even though wrongly, confirmed to her at first. This initially causes her to angrily rebel against her parents. She reconsiders this after talking to Naruto, who reminds her that family is defined by how people feel for each other and not from blood. Because Sarada loves Sakura and has had countless examples that Sakura loves her too, Sarada reconciles with her mother, thereafter restoring the good relationship of trust, mutual protection, and honesty they'd otherwise had.",
      "Her temporary strain with Sakura occurs as a result of her attempt to cope with Sasuke's absence in her life; when she can no longer endure not having her father around, as her mother could tell her almost nothing about him."
    ],
    "images": [
      "https://static.wikia.nocookie.net/naruto/images/9/9a/Sarada_Infobox.png/revision/latest?"
    ]
  },
  "Mitsuki": {
    "info": {
      "Birthdate": "July 25",
      "Sex": "Male",
      "Species": "Synthetic Human",
      "Height": "Gaiden: 149 cm",
      "Kekkei Genkai": "Jūgo's Clan's Kekkei Genkai",
      "Classification": "Medical-nin, Sage, Sensor Type",
      "Affiliation": "Otogakure,  Ryūchi Cave,  Konohagakure",
      "Team": "Team 7"
    },
    "about": [
      "Mitsuki (ミツキ, Mitsuki) is a synthetic human that was created as a partial clone of Orochimaru. Immigrating to Konohagakure to confirm whether or not Boruto Uzumaki was his \"sun\", he became a shinobi and was placed on Team Konohamaru.",
      "Using cloning technology, Mitsuki was created as a clone of Orochimaru,",
      "Orochimaru, as Mitsuki's \"parent\", wanted Mitsuki to find his independence, having concocted a complex plot for Mitsuki to do so. On Orochimaru's sixth attempt of the plan, each time erasing Mitsuki's memories of the previous, Mitsuki mastered Sage Transformation and decided to rebel against his \"parent\" and \"older brother\". He left their company and set out to forge his own destiny himself, now going by the name \"Mitsuki\" (巳月, Mitsuki) by replacing the second character with \"Tsuki\" (月, literally meaning: Moon). Upon discovering the existence of Boruto via a gift from Orochimaru, Mitsuki realised the truth, that Orochimaru wanted him to find his own path in life. Mitsuki then decided to go to Konoha and befriend Boruto to truly discover who he is. The Seventh Hokage accepted Mitsuki without prejudice, and hid the child's background from the rest of the village, barring from his close friend and adviser and a few others; even the Konoha Council and the Fifth Hokage were not aware of this at the time.",
      "Mitsuki has a very calm and matter-of-fact demeanour. He is generally seen very cheerful, if not indifferent, towards the situation at hand. While not confrontational, he freely speaks his mind in any situation, and does things at his own pace. He is also shown to have a sharp wit, being well-read and observant, showing advanced knowledge in mathematics and about the history of other villages. He's quite close with Boruto, caring about his opinion above that of most others. He is also shown to work well with Boruto in coordinated attacks. Seemingly stemming from his harsh upbringing with Orochimaru, Mitsuki is very vicious in battle, showing no restraint and willing to kill his foes without hesitation. During his time at the Academy, it doesn't seem as though he had much of a friendship with Sarada Uchiha until they were assigned to Team Konohamaru.",
      "Despite not revealing much about his origins or parent to them, Mitsuki cares about his teammates, Boruto and Sarada, to the point where he never hesitates to rush to their side when they are in danger or in need of assistance. Mitsuki has a high opinion of Boruto as the son of the Seventh Hokage and the grandson of the Fourth Hokage. His attachment is such that he chose not to display his Sage Mode when its use could have helped him during the Chūnin Exams, fearing that he would not be able to stay in Konoha, and its exposure also being inconvenient for Orochimaru. His concern for his friends even exceeded his desire to stay in Konoha, as he was willing to reveal his Sage Mode to protect Boruto. His generally composed or cheerful personality aside, Mitsuki has great insecurities about the nature of his being. Wondering what it means to be human and to have one's own identity, he even has doubts about whether his choices are truly his own. Apparently wanting to better validate his existence, he greatly enjoys meeting and connecting with new people.",
      "Mitsuki seems to admire Naruto and Sasuke Uchiha due to them both being high-ranked shinobi, and tells Boruto and Sarada how his parent told him their fathers are rivals who can fight equally. Mitsuki also holds a great deal of admiration for his parent as well as confidence in his abilities, to the point of being naive, as shown when he boasted to Boruto and Sarada that Orochimaru was even more powerful than both of their fathers. Despite choosing to walk his own path rather than what Orochimaru made for him (which is what he secretly wanted), Mitsuki has adapted some of Orochimaru's personality quirks, including taking samples of everything unique around him.",
      "As noted by his fellow classmates, Mitsuki prefers spending his time Boruto's company and often agrees and goes along with his ideas without complaint; though he will rarely point out faults with Boruto's plans. Mitsuki is also a minimalist, with his home having only necessities and a few pictures. When asked by Sarada, Mitsuki explained he had no interest in the Extreme: Shinobi Picture Scrolls card game, even though Boruto liked it; making it one of the few things they disagree on. Mitsuki considers buying trading cards a waste of money. While Mitsuki has trouble understanding animals even more than people, he adopts a stray cat he names Mikazuki."
    ],
    "images": [
      "https://static.wikia.nocookie.net/naruto/images/5/5c/Mitsuki.png/revision/latest?"
    ]
  },
  "Boruto Uzumaki": {
    "info": {
      "Birthdate": "March 27",
      "Sex": "Male",
      "Age": "Blank Period: 5, Boruto Movie: 12, Boruto Manga: 16 (Future)",
      "Height": "Blank Period: 110 cm–122 cm, Boruto Movie: 145 cm, Boruto Manga: 163 cm",
      "Kekkei Genkai": "Jōgan",
      "Affiliation": "Konohagakure,  Ryūchi Cave (Anime only)",
      "Team": "Team 7, Moon Orchid Search Team (Anime only)",
      "Clan": "Uzumaki Clan,  Hyūga Clan"
    },
    "about": [
      "Boruto Uzumaki (うずまきボルト, Uzumaki Boruto) is a shinobi from Konohagakure's Uzumaki clan and a direct descendant of the Hyūga clan through his mother. While initially resentful of his father and his absence since becoming Hokage, Boruto eventually comes to respect his father and duties. Regardless, he vows to instead become a shinobi like his mentor.",
      "Boruto is the first child of Naruto and Hinata Uzumaki, receiving a younger sister Himawari two years later. As his parents continued to stay close to their childhood friends over the years, Boruto ultimately came to know the various parents' respective kids well.",
      "On the day that Naruto was to be inaugurated as the Seventh Hokage, his sister Himawari wanted to bring her panda toy to the ceremony, but Boruto, fearing that he would end up carrying it, tried to take it away from her. When the toy's head was ripped off in the ensuing tug-of-war, Himawari awakened her Byakugan and attacked Boruto in her anger, despite his vehement apologies. Naruto, sensing her killing intent, arrived and shielded Boruto, and was knocked out in the process due to the attack landing on one of his chakra points. Fearful of what an attack that could knock-out his father would do to him, Boruto tried to run from Himawari, although she easily located him hiding in a closet. From then on, he vowed never to anger her again.",
      "Boruto is loud, energetic, and stubborn not unlike his father; even possessing a verbal tic, \"dattebasa\" (だってばさ), similar to Naruto's \"dattebayo\" and his paternal grandmother's \"(da)ttebane\" ((だ)ってばね). However, compared to his father at his age, Boruto is more refined and crafty, seemingly knowing all the shortcuts, as well as more mature in knowing how the world works. Between the two, he is more sarcastic. Unlike Naruto, Boruto doesn't yell what he feels, which is the biggest difference. and nurturing parents.",
      "For these reasons, Boruto has a high opinion of himself and freely brags about his abilities. Still, his arrogance has made him put no value in teammates or teamwork, believing he can do anything on his own. He felt in achieving success as the main point of anything, even taking insincere shortcuts to do so, such as utilising a cheat program to win a video game easily, or using the Kote to create a façade of performing an advanced technique to earn his right to be Sasuke's disciple, and later swiftly resorting to the same device to defeat opponents once they seem to have an upper hand. After seeing how selfish and amoral he was acting from resorting to such a tool, he gained a newfound respect for actual hard work. At the same time, he also earned a strong dislike at anyone relying on such advanced tools, believing that one should rely solely on their natural skill. Upon meeting Ao, however, he came to appreciate that tools, no matter how advanced, are not inherently good or bad, but merely a means to a goal that depends on its user. Also, upon seeing how such inventions could be used even small animals, he came to appreciate Katasuke Tōno's work.",
      "Despite his arrogance, he does not look down on anyone else and is very loyal to his friends. Without hesitation, he had repeatedly come to the aid of Denki when he was physically harmed. He also avoids confrontation, or name-calling when someone is talking behind his back, completely ignoring the situation altogether unless his friends get hurt, which shows his maturity. He loves his mother and sister deeply — becoming indignant when either is hurt physically or emotionally. Despite loving his little sister, Boruto is terrified of her and promised himself he would never upset her again. Both Sasuke and Naruto commented that Boruto resembled each other when they were younger, and he had indeed displayed characteristics of both shinobi when they were younger, causing Naruto to state that his son is something entirely different from both of them. For example, he displayed Naruto's mischievous habits to get attention and Sasuke's desire for power even by using shortcuts. Similar to that of their parents, Boruto shares a complicated relationship with Sasuke's daughter, Sarada. The two are often at odds, with the young Uchiha valuing the Hokage post while Boruto was showing utter disdain for it. Despite that, Boruto cares for Sarada and her dream, as witnessed during the Chūnin Exams, when he voiced his desire to win to not diminish Sarada's progress to becoming Hokage. Overall, Boruto's unwavering loyalty to his friends have continually proven to be a strong influence to all around him, many even noting that he has become the foundation for his friends as he is determined to keep his friends together. Boruto is also against sacrificing other people to ensure his own survival, as when Kawaki suggested him to implant Kāma onto someone to create his own vessel, Boruto was against the idea, even when Kawaki considered using Code, a fanatical worshipper of Isshiki Ōtsutsuki and a definite enemy to Boruto.",
      "Although Boruto loves his father and is overjoyed when they spend time together, their relationship has been strained ever since Naruto became the Seventh Hokage. Because of the job's many responsibilities that prevent Naruto from being around all the time, it has led Boruto feeling neglected and becoming resentful toward the Hokage title, only seeing it as a position that takes his father away from him and declaring it (aware that Naruto grew up as an orphan) as only fit for those with no loved ones. Eventually, after Boruto is exposed to the complications of his father's life, he finally understands and forgives his father's busy schedule and stops trying to take the easy options in life."
    ],
    "images": [
      "https://static.wikia.nocookie.net/naruto/images/6/68/New_Boruto_infobox.png/revision/latest?"
    ]
  },
  "Jigen": {
    "info": {
      "Sex": "Male",
      "Status": "Deceased",
      "Occupation": "Monk, Vessel, Inner",
      "Affiliation": "Kara"
    },
    "about": [
      "Jigen (ジゲン, Jigen) was a novice monk that became the vessel for Isshiki Ōtsutsuki and eventually had his body completely taken over by Isshiki invading it.",
      "Around the time that Kaguya Ōtsutsuki and Isshiki Ōtsutsuki arrived on Earth, Jigen was a novice monk and after Kaguya left him for dead, Isshiki assaulted Jigen, during which he shrunk himself and entered the monk's ear in order to survive. Through having his nutrients absorbed from within his body, Isshiki began gaining control over Jigen’s body, and eventually Jigen lost full control of it. Afterwards, Isshiki embedded his Kāma in Jigen, but because his body wasn't powerful enough to sustain him, Isshiki opted not to revive himself in him, instead waiting until a more suitable vessel could be found. ",
      "In time, Isshiki used Jigen's body to form a clandestine organisation to help achieve his goal, dubbed Kara. Eventually, Jigen found and purchased Kawaki from his abusive father with a large sum of money, to use as a potential new vessel. After taking custody of the boy, Jigen introduced himself as his new father and reassured him. He would later attempt to transfer Kāma to Kawaki and fourteen other boys in an experiment conducted with the help of the Kara scientist Amado, with Kawaki being the only known success and thirteen dying outright. Despite promising him safety, Jigen put Kawaki through gruelling training to master the Kāma and would constantly berate him as only having value as a vessel, striking the boy whenever he questioned him. As with the rest of Kara, Jigen also had his body extensively modified by Amado's Scientific Ninja Tools. Isshiki plotted to feed Jigen, along with himself still living within the monk's body, to the Ten-Tails, in order to fulfill the requirements to have it bloom into a God Tree, despite the resultant Chakra Fruit will be of lower quality due to the sacrifice's poor health and strength.",
      "Despite his ancient origins, Jigen's appearance managed to retain a youthful physique due to the influence of Isshiki Ōtsutsuki. He was a fairly tall man of light complexion. He sported a shaved head, apart from a long mohawk of black hair tied in a long ponytail style reaching his lower-back, pronounce eye ridges void of brows, a broad nose, and large black eyes. Sometime after Isshiki took control of him, he gained a diamond-shaped Kāma mark on his chin and a Roman numeral \"Ⅳ\" tattooed below his left eye. The area where his stomach is seems to be completely black. He also wore black nail polish on his fingernails and toenails, five red earrings on the top of each ear, and an additional one at the bottom of each ear.",
      "In his first appearance, he wore the black hooded cloak with maroon lining typical of Kara members, along with dark capri pants and sandals, and a dark collar. In later appearances, he donned a flowing white robe with black vertical lines on the sleeves and coattails and his personal crest on the back, loosely fastened at the waist with a tasselled belt, worn with matching red hair tie, collar, waistband, bracers, and pants, all decorated with red pearl studs, and simple sandals.",
      "As the leader of Kara, Jigen's body is modified with Scientific Ninja Tools,",
      "As Isshiki's vessel, his body is able to channel the various abilities of the Celestial Being. He can produce black rods capable of draining chakra from the victim and can also shrink matter to microscopic levels and just as easily return it to normal so rapidly. He can also manifest various stored objects from a pocket dimension, which he can perform with the most minute of gestures such as a mere wave of his hand or even just a flick of his fingers. He utilises these abilities to launch the black rods at microscopic size into the bodies of his foes while leaving them completely unaware, before returning them to their original size to instantly inflict catastrophic injuries. He can also enlarge them whenever necessary to counter armed blows from enemies. He can also apply the ability to his own body, allowing him to disappear from sight and manoeuvre around the battlefield, as if teleporting, fast enough to catch the likes of Naruto and Sasuke off-guard. The limitations of this ability remain unknown, but Sasuke was able to track his movement even at a microscopic level thanks to the Sharingan. Once activating Kāma's full power, Jigen became able to use these abilities at an even greater level, able to spontaneously summon large black rods instantly to incapacitate Naruto and Sasuke and even form them from his neck to block Sasuke's sword attack."
    ],
    "images": [
      "https://static.wikia.nocookie.net/naruto/images/6/67/Jigen.png/revision/latest?"
    ]
  },
  "Kaguya Ōtsutsuki": {
    "info": {
      "Birthdate": "August 15",
      "Sex": "Female",
      "Species": "Celestial Being",
      "Status": "Incapacitated",
      "Kekkei Mōra": "Byakugan,  Rinne Sharingan",
      "Classification": "Sensor Type",
      "Occupation": "Princess, Head of the Ōtsutsuki Clan (Former)",
      "Affiliation": "Land of Ancestors (Anime only)",
      "Partner": "Isshiki Ōtsutsuki, Black Zetsu",
      "Clan": "Ōtsutsuki Clan"
    },
    "about": [
      "Princess Kaguya Ōtsutsuki (大筒木カグヤ, Ōtsutsuki Kaguya) is the former matriarch of the Ōtsutsuki clan, the former partner of Isshiki Ōtsutsuki and mother of Hagoromo and Hamura Ōtsutsuki. Long before the founding of the hidden villages, during an era of endless war, Kaguya consumed the fruit of the God Tree and became the first wielder of chakra on Earth, before later merging with the tree to become the Ten-Tails.",
      "A millennium ago,",
      "Losing all faith in humanity but still longing for peace, Kaguya believed that it was necessary for her to attain god-like powers in order to put an end to all of humanity's conflicts. So, despite her clan waiting to harvest that world of its God Tree,",
      "While giving birth to her twin sons Hagoromo and Hamura, she dispersed chakra to them,",
      "Assuming the Ten-Tails was an incarnation of the God Tree that attacked them to recover the chakra from its stolen fruit, Hagoromo and Hamura sealed the beast's chakra within the former's body while using its husk as the core of Six Paths — Chibaku Tensei, creating a celestial body that would become known as the Moon. Hamura later took leadership of the Ōtsutsuki clan and departed to the moon to guard the beast's remains, while Hagoromo remained on Earth in order to spread chakra to humanity and teach them the concept of ninshū.",
      "As noted by her son Hagoromo, Kaguya was once truly a good and caring person. This was expanded on in the anime where despite displaying an apathetic personality, she longed for peace and eventually fell in love with Tenji, who shared a similar dream, even though she never openly displayed her feelings for him. She also cared deeply for her hand-maiden Aino, even though she never openly displayed emotions to her either until just before Aino's death. However, she was also treacherous and ruthless towards those she did not care about, as she betrayed fellow clansman Isshiki and nearly killed him; Amado speculated it could either be personal enmity or her desire to have the chakra fruit for herself.",
      "After obtaining the ability to manipulate powerful chakra from the God Tree's fruit, Kaguya had grown despotic and developed both a god-complex and messiah-complex, believing that chakra rightfully belonged to her alone and that only she could protect and unite the world. Black Zetsu noted that Kaguya tried to love humans for the sake of peace, but her distrust in them proved far too great as she came to believe all they did was fight and destroy the world. Despite her initial desire for peace like her sons, grandsons, and in the anime, her lover, Kaguya ultimately caved into corruption from her power and lost faith in humanity's ability to do what is right. As a result of her losing faith in humanity, Kaguya opted to use her great and terrible power to submit everyone to her will. As Hagoromo noted, humanity around that time began to fear her as a demon. She uses the archaic pronoun \"warawa\" (ワラワ) when referring to herself — a sign of ancient nobility."
    ],
    "images": [
      "https://static.wikia.nocookie.net/naruto/images/6/6c/Kaguya_%C5%8Ctsutsuki.png/revision/latest?"
    ]
  },
  "Hagoromo Ōtsutsuki": {
    "info": {
      "Birthdate": "August 6",
      "Sex": "Male",
      "Species": "Celestial Being-Human hybrid",
      "Status": "Deceased",
      "Height": "Part II: 186 cm",
      "Kekkei Genkai": "Sharingan (Anime only),  Mangekyō Sharingan (Anime only)",
      "Kekkei Mōra": "Rinnegan",
      "Classification": "Jinchūriki, Sage, Sensor Type",
      "Tailed Beast": "Ten-Tails (Forms)",
      "Occupation": "Priest",
      "Affiliation": "Land of Ancestors (Anime only),  Mount Myōboku (Anime only)",
      "Clan": "Ōtsutsuki Clan"
    },
    "about": [
      "Hagoromo Ōtsutsuki (大筒木ハゴロモ, Ōtsutsuki Hagoromo), known to Earth's population at large as the Sage of Six Paths (六道仙人, Rikudō Sennin, English TV: The Sage of the Six Paths), was a legendary godlike figure who is regarded as the ancestor of shinobi, for his act of founding ninshū which led to the creation of the ninja world. He was the son of Princess Kaguya Ōtsutsuki‎‎ and alongside his fraternal twin brother, Hamura, were the first to be born with the same powerful chakra as their mother. Together, he and his brother defeated their mother, who had become the terrifying Ten-Tails, in battle and sealed the powerful beast within himself, thus making Hagoromo the first jinchūriki.",
      "Alongside Hamura, Hagoromo, the elder twin brother, was born as one of the two children to Kaguya‎‎, a princess who ate the forbidden Chakra Fruit of the God Tree that appeared once a millennium in an effort to gain divine abilities, which she used to put an end to the constant wars during that era. As a result, Hagoromo was born with the ability to manipulate the same type of powerful chakra as his mother. Angered by the fact that her chakra had been spread to others, Kaguya merged with the God Tree into the Ten-Tails, which attempted to reclaim her chakra.",
      "The Ten-Tails rampaged throughout the lands until Hagoromo and his younger twin brother managed to defeat the beast, with Hagoromo becoming its jinchūriki, causing him to be revered as a god for the virtue of his victory. Researching his mother's technique, Hagoromo was able to free the world from her Infinite Tsukuyomi. Going by the Sage of Six Paths after entering priesthood,",
      "Hagoromo's ultimate wish was to establish peace across the world, but it was a goal that would never be achieved in a single lifetime. Knowing this, he chose to entrust his dream and legacy to his two sons, and began to teach them ninshū. The older son, Indra, was acknowledged by Hagoromo as a true prodigy, who quickly began to revel in his natural prowess and became very solitary. The younger son, Asura, proved to be the exact opposite, having shown no special abilities or natural talent, but he pushed on through his limitations, growing stronger and more mature because of his struggles and making friends with others along the way. Hagoromo acknowledged Asura's chosen path, agreeing that love and cooperation were the true keys to peace.",
      "Inspired by his younger son, Hagoromo separated the Ten-Tails' chakra within his body and used his Creation of All Things Technique to divide it into nine separated bodies, creating the tailed beasts and giving each a name.",
      "Suspecting that Indra or one of his reincarnations would eventually attempt to take Asura's power for themselves, Hagoromo left behind a tablet detailing his history in an attempt to make them reconsider. Even though Hagoromo died and his body was destroyed, his chakra and consciousness remained and traversed the world throughout the centuries.",
      "In the anime's telling of events, well into their adolescence, Hagoromo and his brother lived in ignorance of their mother's true amoral nature. While their homeland continued to prosper, people would periodically disappear for a sacred Ritual of the God Tree. One day, the brothers were approached by Gamamaru, who revealed to them that beyond the peak of the nearby mountains lied the truth of the ritual. While initially ignoring the toad's words, Hagoromo grew distressed when a local girl he cared for named Haori became part of the ritual. When the brothers confronted their mother about ending the rituals, Kaguya dismissed their concern, simply saying it was necessary for \"the others' arrival\". Finally deciding to investigate, the two brothers were horrified to learn that the missing citizens were sacrificed to the God Tree. This especially hurt Hagoromo, and he awakened the Sharingan in his grief. Wishing to learn more, the brothers sought out Gamamaru. He revealed to them their mother's history of coming to Earth and using the God Tree's fruit to gain great power and enslave much of the land using Infinite Tsukuyomi, including their father. Deciding that they needed more power to confront Kaguya should she turn hostile, Hagoromo began training under Gamamaru in senjutsu. While Hagoromo quickly improved in this art, Kaguya soon caught on to her sons' scheme."
    ],
    "images": [
      "https://static.wikia.nocookie.net/naruto/images/6/6e/Hagoromo_%C5%8Ctsutsuki_2.png/revision/latest?"
    ]
  },
  "Hamura Ōtsutsuki": {
    "info": {
      "Birthdate": "August 6",
      "Sex": "Male",
      "Species": "Celestial Being-Human hybrid",
      "Status": "Deceased",
      "Height": "Part II: 185 cm",
      "Kekkei Genkai": "Byakugan,  Tenseigan",
      "Classification": "Sage",
      "Occupation": "Head of the Ōtsutsuki Clan",
      "Affiliation": "Land of Ancestors (Anime only),  Mount Myōboku (Anime only), Moon",
      "Clan": "Ōtsutsuki Clan"
    },
    "about": [
      "Hamura Ōtsutsuki (大筒木ハムラ, Ōtsutsuki Hamura) was the son of Princess Kaguya Ōtsutsuki‎‎, the fraternal twin brother of Hagoromo Ōtsutsuki; both of whom were the first people born with the ability to wield chakra. Hamura was the ancestor of the Hyūga clan and the founder of the shinobi of the Moon.",
      "Hamura was born as the younger of Kaguya Ōtsutsuki's twin sons, Decades later and having grown elderly, Hamura passed away in bed surrounded by his clan members.",
      "In the anime's telling of events, well into their adolescence, Hamura and his brother lived in ignorance of their mother's true amoral nature. While their homeland continued to prosper, people would periodically disappear for a sacred Ritual of the God Tree. One day, the brothers were approached by Gamamaru, who revealed to them that beyond the peak of the nearby mountains lied the truth of the ritual. While initially ignoring the toad's words, Hagoromo grew distressed when a local girl he cared for named Haori, became part of the ritual. When the brothers confronted their mother about ending the rituals, Kaguya dismissed their concern, simply saying it was necessary for \"the others' arrival\". Finally, after deciding to investigate, the two brothers were horrified to learn that the missing citizens were sacrificed to the God Tree. Wishing to learn more, the brothers sought out Gamamaru. He revealed to them their mother's history of coming to Earth and using the God Tree's fruit to gain great power and enslave much of the land using Infinite Tsukuyomi, including their father. Deciding that they needed more power to confront Kaguya should she turn hostile, Hagoromo began training under Gamamaru in senjutsu. While Hagoromo quickly improved in this art, Kaguya soon caught on to her sons' scheme of rebelling against her using their inherited chakra.",
      "Once Hagoromo returned to confront Kaguya, the mother unleashed Hamura to fight Hagoromo, having brainwashed him earlier. In a risky plan, Hagoromo chose to strike down his brother, freeing him from Kaguya's control before healing Hamura with a special seal tag given by Gamamaru. This also allowed Hagoromo to manifest his Mangekyō Sharingan and Rinnegan respectively. Realising both Hamura and Hagoromo chose to use their inherited chakra to rebel against her, Kaguya — morphing the God Tree into the Ten-Tails — tried to forcibly reclaim her chakra out of rage and spite. Eventually, Hagoromo and Hamura succeeded in defeating and sealing her. Subsequently, Hagoromo created the tailed beasts from the Ten-Tails' chakra and decided to stay and watch over the world, while Hamura decided to go on the moon and watch over their mother.",
      "Hamura was a man who believed in peace and freedom opting to seal away his own mother, ending her reign of terror. Also, he was very dutiful, as he remained on the moon to guard Kaguya's sealed body. In the anime, despite rebelling against his mother, Hamura still loved Kaguya, understanding that all the amoral things Kaguya did was to protect in her own way all that loved and cared for. As such, Hamura chose to stay close to Kaguya's seal.",
      "Hamura was a tall and pale-skinned man with hairless brow ridges and white hair, which was short in his adolescence but later grew to waist-length. His bangs were short hung to left side of his face with a chin-length lock which hung from the right side of his face. He also had small, horn-like protrusions on his forehead and inherited the renowned Byakugan in both of his eyes from his mother. He wore a light, full-length kimono with a pattern of six black magatama around a high collar and dark pants. He had his sword in its sheath strapped to his left hip. He also had a dark crescent-moon representing Yin mark in his left palm.",
      "In his old age, his appearance was very frail, his ribcage was slightly visible, his brows became more prominent, and he had deep wrinkles in his face and his once white hair had turned grey. He wore a white kimono with a black wide collar ceremonial kimono, with a light green sash tied over his right shoulder."
    ],
    "images": [
      "https://static.wikia.nocookie.net/naruto/images/e/e8/Hamura.png/revision/latest?"
    ]
  },
  "Momoshiki Ōtsutsuki": {
    "info": {
      "Sex": "Male",
      "Species": "Celestial Being",
      "Status": "Deceased",
      "Height": "Boruto Movie: 176 cm",
      "Kekkei Genkai": "Byakugan,  Rinnegan,  Wood Release (Novel only)",
      "Partner": "Kinshiki Ōtsutsuki",
      "Clan": "Ōtsutsuki Clan"
    },
    "about": [
      "Momoshiki Ōtsutsuki (大筒木モモシキ, Ōtsutsuki Momoshiki) was a member of the Ōtsutsuki clan's main family, sent to investigate the whereabouts of Kaguya and her God Tree and then attempting to cultivate a new one out of the chakra of the Seventh Hokage. In the process of being killed by Boruto Uzumaki, Momoshiki placed a Kāma on him, allowing his spirit to remain intact through the mark.",
      "Momoshiki is typically calm, collected, and calculating. However, he has been prone to demonstrate sadistic tendencies, which was shown during his and Kinshiki's attack on Konohagakure, where he laughed after seeing distressed citizens while firing his elemental attacks. Momoshiki also has a severe superiority complex and thought very lowly of people other than himself, calling humans \"lowly beings\". Likewise, he is also even unsociable amongst his fellow clansmen such as Isshiki, Urashiki, and even his own foster father Kinshiki. Despite his callous attitude, he is staunchly committed to the Ōtsutsuki Will and his clan's goal of attaining godhood; while he laments Naruto's inability to pass along his massive chakra to his son in his future, he absorbs Kinshiki's without a second thought as per his wish. As with Isshiki, Momoshiki is determined to harvest a chakra fruit at all cost, as he decided to use Kawaki as a sacrifice for the Ten-Tails to bloom into a God Tree, even though this would result in the fruit's decreased quality, to the point that he would absorb chakra to prevent Kawaki from committing suicide even if risking Boruto regaining control of his body.",
      "Momoshiki is also uninterested in hard-work, preferring to absorb and use the techniques of others instead of relying on his own personal strength. Due to this, he has very limited skill in taijutsu, becoming one of his main crippling weaknesses. Any effort on his part disgusted Momoshiki, and grows visibly annoyed at anything not going smoothly for him, as he was angered by his clothes being ripped by Boruto. As such, he is very arrogant and reckless in battle, never implementing any attempts with strategy or attempting to conserve chakra, but simply flaunting his self-perceived superior power in the vain belief that his powers alone secure him victories. He always convinced himself he can simply replenish his chakra with what he gains from his Chakra Fruit and pills, or by whatever samples he obtained by absorbing others' attacks.",
      "Fitting of his lazy personality, he is also rather cowardly when faced with an actual challenge, as he became visibly nervous when his opponent proved powerful enough to threaten him and even more exploit his weakness. Sasuke Uchiha and Naruto Uzumaki both agreed Momoshiki's personality is a mirror image of Sasuke's when he was bent on killing Itachi Uchiha.",
      "Although believing himself to be superior to everybody, Momoshiki is not completely unable to accept defeat, as after death, his spirit lingered enough to leave Boruto a foreshadow of his future, showing no outward anger nor hatred otherwise. Additionally, when controlling Boruto for the first time, Momoshiki only targeted Boro, but did not kill Boruto's friends even though he could easily have done it and only absorbed the necessary chakra to keep fighting from Naruto rather than just absorbing all of it, noting that Boruto still had a long way to go before he lost everything, showing his lack of grudge towards Boruto for defeating him.",
      "Momoshiki had pale skin, and pale-blue hair which he kept in a long ponytail. His hair was parted down the middle in a zig-zag pattern, and his head was adorned with a pair of flat, curved horns which resembled bulls horns. He had delicate facial features and his eyebrows were cut very short as a symbol of nobility. He dressed in traditional nobleman's attire consisting of a white kariginu hunting robe, baggy pants, a pair of tengu-geta, and a single black glove on his left hand, with a hole cut into the palm for his Rinnegan, which was red in colour (purple in some depictions). He also wore a transparent hagoromo veil over his head.",
      "Originally in the movie, after absorbing Kinshiki, Momoshiki's appearance took a drastic change including; black sclerae, white irides, dark-red skin, a pointy chin, fangs, claws on his hands and feet which were exposed, white hair, ponytail enlarged and became much spikier, larger, sharpened bull horns, white markings under his eyes and a massive increase in size. His Rinnegan on his palms turned purple and he awakened a third one on his forehead. In the novelisation he doesn't awaken a third eye, but upon devouring the last of the pills he created from Kinshiki his skin turns from red to black, giving him the appearance of a black demon."
    ],
    "images": [
      "https://static.wikia.nocookie.net/naruto/images/d/d1/Momoshiki.png/revision/latest?"
    ]
  },
  "Itachi Uchiha": {
    "info": {
      "Birthdate": "June 9",
      "Sex": "Male",
      "Age": "Part I: 17–18, Part II: 21",
      "Status": "Deceased",
      "Height": "Part I: 175.2 cm, Part II: 178 cm",
      "Weight": "Part I: 57.1 kg, Part II: 58 kg",
      "Blood type": "AB",
      "Kekkei Genkai": "Sharingan,  Mangekyō Sharingan",
      "Classification": "S-rank, Missing-nin",
      "Occupation": "Anbu Captain (Former)",
      "Affiliation": "Konohagakure,  Akatsuki",
      "Team": "Team 2 (Anime and Novel only), Team Ro (Anime only)",
      "Partner": "Jūzō Biwa (Anime only), Kisame Hoshigaki",
      "Clan": "Uchiha Clan"
    },
    "about": [
      "Itachi Uchiha (うちはイタチ, Uchiha Itachi) was a shinobi of Konohagakure's Uchiha clan who served as an Anbu Captain. He later became an international criminal after murdering his entire clan, sparing only his younger brother, Sasuke. He afterwards joined the international criminal organisation known as Akatsuki, whose activity brought him into frequent conflict with Konoha and its ninja — including Sasuke who sought to avenge their clan by killing Itachi. Following his death, Itachi's motives were revealed to be more complicated than they seemed and that his actions were only ever in the interest of his brother and village, making him remain a loyal shinobi of Konohagakure to the very end.",
      "Itachi was the first child born to Mikoto and Fugaku Uchiha. His early childhood was marked with violence: when he was four years old, the Third Shinobi World War waged and he witnessed first-hand many of the war's casualties. The death and destruction he experienced at such a young age traumatised Itachi and made him a pacifist, The Nine-Tails' attack had soured relations between Konoha's leadership and the Uchiha, the former believing the latter to be responsible. The Uchiha were relocated to the edge of the village, isolating them from the rest of the village and making it easier to monitor them.",
      "At age six, Itachi enrolled into the Academy, where he consistently scored the highest in each subject and quickly learned any skill taught to him, resulting in him being praised as the best of his generation.",
      "Joining Team 2, Itachi went on to honing his skills to chūnin level, leading to him drawing the attention of Konoha's leaders. Meeting the criteria, Fugaku allowed him to sit in on clan meetings in the Naka Shrine basement.",
      "At age 11, he entered the Anbu.",
      "Itachi shared the burden of betraying his clan with Shisui. But as time went on it became increasingly clear that peace could not be achieved. Shisui intended to use his Kotoamatsukami on the Uchiha's leaders to compel them to negotiate, but his right eye was stolen by Danzō before he had a chance. His own options exhausted, Shisui entrusted his remaining eye to Itachi and begged him to protect the village and their family name before drowning himself in the Naka River.",
      "Although the Third Hokage still wished to negotiate with the Uchiha, Danzō Shimura recognised that there was no longer an outcome that could see the Uchiha clan's survival. He explained this to Itachi and left him a choice: support the Uchiha's coup and have the whole clan, including Sasuke, killed in the ensuing conflict, or accept the assignment to wipe out the clan before the coup started and be allowed to spare Sasuke. Itachi chose his brother."
    ],
    "images": [
      "https://static.wikia.nocookie.net/naruto/images/b/bb/Itachi.png/revision/latest?"
    ]
  },
  "Shikamaru Nara": {
    "info": {
      "Birthdate": "September 22",
      "Sex": "Male",
      "Age": "Part I: 12–13, Part II: 15–17, Blank Period: 19",
      "Height": "Part I: 150.8 cm–152.1 cm, Part II: 170 cm, Blank Period: 176 cm",
      "Weight": "Part I: 42 kg–42.9 kg, Part II: 53.4 kg",
      "Blood type": "AB",
      "Occupation": "Hokage's Chief Aide, Planner for the Shinobi Union, Proxy Commander of Fourth Division of the Allied Shinobi Forces, Chūnin Exam Proctor (Anime only), Head of the Nara Clan",
      "Affiliation": "Konohagakure,  Allied Shinobi Forces",
      "Team": "Team 10, Sasuke Recovery Team, Konoha 11 (Anime only), Twenty Platoons, Fourth Division, Hanabi Rescue Team (Movie only)",
      "Clan": "Nara Clan"
    },
    "about": [
      "Shikamaru Nara (奈良シカマル, Nara Shikamaru) is a shinobi of Konohagakure's Nara clan. Though lazy by nature, Shikamaru has a rare intellect that consistently allows him to prevail in combat. The responsibilities that these successes leave him with cause him frequent annoyance, but he gladly accepts them so that he may be of service to his fellow members of Team Asuma, and to prove himself to generations of the past and future.",
      "Shikamaru is the only child of Yoshino and Shikaku Nara. When he was young, he once played \"ninja\" with other children his age. Chōji Akimichi wanted to play with them, but the other children refused to allow him to do so, claiming he was too stupid to participate. When Shikamaru couldn't convince the others to let Chōji join, he left the game and went to his favourite spot to watch clouds. Chōji happened to be sitting in the same spot when he got there, so Shikamaru introduced himself, and invited Chōji to watch the clouds with him. Chōji asked Shikamaru if he wanted some snacks.",
      "Shikamaru is naturally a lazy person and his inclination is to do as little work as possible. As an Academy student and even during his early career as a genin, Shikamaru is able to get away with this, spending his days sleeping, watching the clouds, or playing games of shōgi and Go. His goal is to live unremarkably, free of anything of noticeably good or bad, and then to die just as unremarkably as he lived.",
      "Although Shikamaru describes himself as \"the number one coward\", Such selflessness, once displayed during the Konoha Crush, exacerbates his \"troublesome\" situations: he is given the responsibility of leading his friends into battle, for which reason he does everything that he can to keep them safe, for which reason he is given even more responsibility over even more of his friends, and so on. He still clings to his lazy origins as much as he can; even if he can't spend his entire day being idle, he at least avoids having long-term goals or confessing any particular pleasure in the duties he's assigned.",
      "Shikamaru undergoes a rapid maturity after the death of his teacher, Asuma Sarutobi, whose loss forces Shikamaru to recognise that the world is not safe that he cannot be kept protected from it forever. After avenging Asuma, Shikamaru takes it upon himself to do all that he can to make things better for future Konoha generations, especially Asuma's then-unborn daughter, Mirai; such is the Will of Fire. He may still balk at the prospect of the work he must do, but he no longer runs from it, even going so far as to argue in favour of difficult choices if it will guarantee his friends' and village's survival. In Shikamaru Hiden, he describes his new goal in life as, rather than living unremarkably himself and watching the clouds all the time, to instead make a world where his children or grandchildren can live that way if they choose to.",
      "One of the more \"troublesome\" things that runs throughout Shikamaru's life is the subject of women thanks to his experiences with the women he knows: his mother, Yoshino, his teammate, Ino Yamanaka, and his frequent companion, Temari. He describes each of them as aggressive, demanding, and sometimes even scary. Shikamaru tries to treat women delicately, being non-confrontational or at least polite to them and never asking anything of them that he believes he can do himself. During Part I, he generally believes he can do anything himself, and as such is mortified if and when a woman needs to assist him in any way; his frustrations are similar when he repeatedly finds himself facing female opponents. As with most things, Shikamaru resists entanglements with women as much as he can; his Infinite Tsukuyomi dream world sees him successfully avoiding marriage entirely. However, upon realising in Shikamaru Hiden that Temari is one of the most important things in the world to him, he ultimately marries her and even has a son with her, Shikadai. Ironically, his relationship with Temari became very similar to his parents, where he once mocked Shikaku for being \"whipped\", which he himself became.",
      "Overtime, having come to recognise Naruto's great contributions to the village despite his own hardships, Shikamaru came to sympathise for him, deciding to be there to support him much like the Second Hokage did for his older brother. His newfound goal became to aid Naruto in his goal of becoming Hokage and act as his personal adviser. Ultimately, as an adult, Shikamaru succeeds in this goal, often handling many duties to lighten the workload for Naruto as Hokage. At the same time, he still holds much of his original carefree nature from youth. He is not very strict with his son, viewing his acting out and/or punishments at school as a learning curve for him, trusting that Shikadai will find his way. In adulthood, he also picked up Asuma's interest in smoking."
    ],
    "images": [
      "https://static.wikia.nocookie.net/naruto/images/4/44/Shikamaru_Part_I.png/revision/latest?",
      "https://static.wikia.nocookie.net/naruto/images/9/9a/Shikamaru_Nara.png/revision/latest?",
      "https://static.wikia.nocookie.net/naruto/images/5/55/Shikamaru_Part_III.png/revision/latest?"
    ]
  },
  "Ino Yamanaka": {
    "info": {
      "Birthdate": "September 23",
      "Sex": "Female",
      "Age": "Part I: 12–13, Part II: 16–17",
      "Height": "Part I: 149.3 cm–151.2 cm, Part II: 162.2 cm, Blank Period: 165 cm",
      "Weight": "Part I: 38.2 kg–38.5 kg, Part II: 46 kg",
      "Blood type": "B",
      "Classification": "Sensor Type, Medical-nin",
      "Occupation": "Botanist, Leader of the Konoha Barrier Team",
      "Affiliation": "Konohagakure,  Allied Shinobi Forces",
      "Team": "Team 10, Konoha 11 (Anime only), Kaima Capture Team (Anime only), Twenty Platoons, Team Three (Anime only), Fifth Division, Ino–Saku–Sai (Novel only),  Konoha Barrier Team, Analysis Team",
      "Clan": "Yamanaka Clan"
    },
    "about": [
      "Ino Yamanaka (山中いの, Yamanaka Ino) is a kunoichi of Konohagakure's Yamanaka clan. She and her fellow members of Team Asuma are their generation's Ino–Shika–Chō trio.",
      "Ino is the only child of Inoichi Yamanaka and was a popular student during her time in the Academy. There, she met Sakura Haruno, who was teased by other kids for her large forehead. Ino defended Sakura from the bullies and encouraged her to embrace her forehead rather than hide it, becoming good friends with her. Over the following years, Ino's guidance and friendship helped Sakura become more confident and develop into her own person. However, when Sakura found out that they had a crush on the same boy, Sasuke Uchiha, Sakura approached Ino, telling her of her liking towards Sasuke. Sakura then took it to end their friendship, starting their dislike towards each other in the beginning of the series.",
      "From a young age, Ino has been confident, bold, and outspoken girl who had a mild-temper and occasionally lashed out at others if their personal habits bothered her.",
      "Despite her assertiveness and uppity demeanour, Ino is a compassionate and kind person at heart, having been raised to embody the meaning of the bush clover: a blunt, candid love who treasures the bonds with her friends. By the time of his death, Inoichi believed that Ino had truly blossomed into the bush clover of the Yamanaka Clan, and is proud of her bonds with her friends.",
      "Ino had the same infatuation on Sasuke that most other girls in their Academy class had, due to his good looks and cool personality. Even after Sasuke's defection from Konoha, Ino largely retained her feelings for him in Part II: she cried when he was declared an international criminal,",
      "Ino has fair skin, light blue eyes (sometimes seen as green in the manga), and long platinum blonde hair worn in a ponytail, with bangs framing the right side of her face. Her hair is seen in different lengths: in Part I, her ponytail extends to her waist, but it is later cut and grows to shoulder-length; in Part II, the bangs grow to cover half of her face, her ponytail becomes waist-length, and she sports a red clip on the left; in the The Last: Naruto the Movie, her hair is hung loosely and extends to her calves; as an adult, her hairstyle returns to its shape in Part II, but her ponytail reaches her upper-back and sports a black clip. By Part II, she developed a very shapely figure. Sai mentions that Ino is very beautiful.",
      "Ino regularly wears a purple outfit consisting of a high-collared blouse and matching apron skirt. In Part I, she sports this attire with bandages on her abdomen and legs, small hoop-earrings, her forehead protector worn as a belt, and for a time, white arm warmers. In Part II, Ino's outfit is slightly more revealing as she discards her forehead protector and bandages while exposing her midriff and wears mesh armour on her thighs, elbows and knees. She also replaces her hoop earrings with studs, a gift from Asuma. During the Fourth Shinobi World War, Ino dons the standard Konoha infantry flak jacket and assorted clothing. In The Last: Naruto the Movie, she wears a longer skirt that reaches her ankles, high-heeled sandals and pink lipstick."
    ],
    "images": [
      "https://static.wikia.nocookie.net/naruto/images/d/dd/Ino.png/revision/latest?",
      "https://static.wikia.nocookie.net/naruto/images/8/89/Ino2.png/revision/latest?",
      "https://static.wikia.nocookie.net/naruto/images/0/0c/Ino_Part_III.png/revision/latest?"
    ]
  },
  "Chōji Akimichi": {
    "info": {
      "Birthdate": "May 1",
      "Sex": "Male",
      "Age": "Part I: 12–13, Part II: 16–17",
      "Height": "Part I: 150.6 cm–156.3 cm, Part II: 172.3 cm, Blank Period: 178 cm",
      "Weight": "Part I: 62 kg–69.3 kg, Part II: 87.5 kg",
      "Blood type": "B",
      "Affiliation": "Konohagakure,  Allied Shinobi Forces",
      "Team": "Team 10, Sasuke Recovery Team, Konoha 11 (Anime only), Peddlers Escort Team (Anime only), Twenty Platoons, Fourth Division",
      "Clan": "Akimichi Clan"
    },
    "about": [
      "Chōji Akimichi (秋道チョウジ, Akimichi Chōji) is a member of Konohagakure's Akimichi Clan. Though sensitive about his weight, Chōji is nevertheless dedicated to his friends, especially in Team Asuma.",
      "Chōji was born into the Akimichi clan, and is slated to become the Sixteenth Head of the Akimichi (秋道16代目当主, Akimichi Jūrokudaime Tōshu) after his father, Chōza. When Chōji was younger, he was often put down for not being good at a child's game called \"Ninja\", which appears to be a cross between tag and hide and seek, often employing the use of shuriken made out of cardboard and sticks. His peers would always berate him, telling him that any team that he was on was bound to lose. One day, they simply refused to let him play at all. However, Shikamaru Nara stuck up for him, saying that the teams would be uneven if Chōji didn't join them. This gave Chōji a little hope, although, in the end, they still refused to let him play.",
      "Chōji and his father were later seen talking on the roof of a building while Chōji was still upset over the way he was treated by the other children, saying the Akimichi were all fat and stupid. Comforting him, his father told him that few people have a heart as kind and caring as his, and one day he would meet someone who would see that in him and respect him for it, and that eventually they would be the best of friends. His father proved to be correct as soon after, Shikamaru arrived. Chōji recognised him as the one who had defended him earlier, and asked Shikamaru why he wasn't playing the game, to which Shikamaru responded that it was too troublesome. He then told Chōji that he liked to come up there to watch the clouds and that Chōji happened to be sitting in his spot. Chōji moved over to give him space. Shikamaru proceeded to lie down before telling Chōji that he should watch the clouds with him. This delighted Chōji, and he eagerly asked Shikamaru if he wanted to eat some snacks that he had brought. Shikamaru took him up on the offer, causing Chōji to be overjoyed, and then Shikamaru said \"This is the best, watching clouds and eating chips\". From that day on, the two became best friends.",
      "During Chōji's time at the Academy, he was often caught eating in class otherwise getting into trouble along with fellow deviants Shikamaru, Kiba Inuzuka, and Naruto Uzumaki. Together, these four would cut class or otherwise be testing the patience of Iruka Umino, their Academy teacher. During the Search for Tsunade, when Naruto was struggling to learn the second step of training for the Rasengan, he recalled how once, during his days in the Academy, he, along with Shikamaru, Kiba, and Naruto were held back in class, and lectured about their all around lack in concentration — in Chōji's case, he was thinking more about food than about doing his school work. During the arc involving the trap master Gennō from the long-gone Kagerō Village, it was mentioned how Shikamaru, Chōji, Kiba, and Naruto would skip class together and hang out at the kunai practice course, which was situated under the Academy, to hide from Iruka.",
      "Chōji is a very kind, polite, and caring person. These characteristics are said to be his greatest strength by both his father Chōza and his former teacher Asuma Sarutobi while his greatest weakness was his lack of self-confidence. Chōji also tends to eat a lot when he's angry. Since Part II of the series, however, his eating habits are more controlled and no longer interfere with his duties as a shinobi.",
      "Chōji has a long-standing friendship with Shikamaru. The two have complete trust in each other, with Shikamaru being one of the few people to look past Chōji's lack of athleticism, and see that he had a kind heart; recognising Chōji's true strength. Because of this, Chōji has unwavering faith and loyalty to Shikamaru and, if necessary, would give his life for him, which nearly happened during his battle with Jirōbō. Chōji also cares deeply for his mentor, Asuma, and had a difficult time in fighting him during the Fourth Shinobi World War, due to not wanting to hurt his own teacher,",
      "As stated by his father and teacher, Chōji greatly lacked confidence in himself and his abilities which often times hindered his actions or even progression in some aspects."
    ],
    "images": [
      "https://static.wikia.nocookie.net/naruto/images/7/7d/Ch%C5%8Dji_Akimichi.png/revision/latest?",
      "https://static.wikia.nocookie.net/naruto/images/e/ec/Ch%C5%8Dji_Part_II.png/revision/latest?",
      "https://static.wikia.nocookie.net/naruto/images/b/b7/Ch%C5%8Dji_part_III.png/revision/latest?"
    ]
  },
  "Rock Lee": {
    "info": {
      "Birthdate": "November 27",
      "Sex": "Male",
      "Age": "Part I: 13–14, Part II: 17",
      "Height": "Part I: 158.5 cm–162.1 cm, Part II: 172 cm, Blank Period: 177 cm",
      "Weight": "Part I: 46.6 kg–47.5 kg, Part II: 54.7 kg",
      "Blood type": "A",
      "Occupation": "Chūnin Exams Proctor",
      "Affiliation": "Konohagakure,  Allied Shinobi Forces",
      "Team": "Team Guy, Konoha 11 (Anime only), Star Guard Team (Anime only), Team Two (Anime only), Third Division, Suicide Corps (Movie only)",
      "Clan": "Lee Clan (Novel only)"
    },
    "about": [
      "Rock Lee (ロック・リー, Rokku Rī) is a shinobi of Konohagakure's Lee clan and a member of Team Guy. Unlike most shinobi, he lacked the skills necessary to use ninjutsu or genjutsu. However, he overcomes those shortcomings by undergoing special training from Might Guy that would make him a taijutsu master while still a genin.",
      "During his time in the Academy, Lee proved to have no talent for ninjutsu and genjutsu. When he was mocked by his peers because of this, Lee persevered, focusing on taijutsu.",
      "Under Guy's leadership, Lee has acquired a number of his sensei's personality traits: he is energetic, optimistic, and hot-blooded, and shows the epitome of a \"nice guy\". He believes that one cannot dislike food and shows strong dedication to his promises; when this promise is broken, just barely, he assigns himself arduous training to prevent it from happening again. Lee speaks respectfully to others, never using contractions or swear words and always addressing people with appropriate honourifics (except his teammates, since Lee feels they are close enough to be spoken to informally). He also carries a small book and pencil to recall advice that Guy gives him over time.",
      "Despite his passionate nature, Lee has also shown strong instincts, staying focused at the task at hand and rarely losing his composure. He has a keen sense of honour and respects his opponents, refusing to hold grudges against those who have defeated him, and returning favours to those that have helped him. This was shown by his befriending of Gaara, forgiving him for crushing his arm and leg — injuries that nearly ended his career as a shinobi. Lee feels others should show the same respect towards their opponents, and is disgusted whenever someone is unnecessarily cruel to their enemies.",
      "One of Lee's recurring themes throughout the series is his drive to succeed, believing with enough hard work and perseverance, he can surpass a natural genius. He can be prone to depression when faced with setbacks. Neji, Lee's more talented teammate and rival, found Lee's efforts to be in vain, believing a \"failure\" could never defeat a \"genius\". As such, Lee became determined to defeat Neji in order to prove him wrong, though was met with defeat every time. When Neji himself was defeated by Naruto Uzumaki, another so-called \"failure\", he rejects his belief in fate and now holds great respect for Lee, believing that he will surpass the gifted with enough work.",
      "During Part I, Lee revealed he had feelings for Sakura Haruno. Although she did not reciprocate his feelings and even considered him weird, she later become more appreciative and friendly towards him after he helped saved her from the Otogakure genin during the Chūnin Exams. After the exams, Lee's interest in Sakura went largely unaddressed in the manga, though it is sometimes referenced in the anime; while having a match with Lee, Naruto transformed into Sakura, distracting Lee long enough for Naruto to attack him. However, Lee's Infinite Tsukuyomi dream was of winning Sakura's affections, implying he still had romantic feelings for her. These feelings apparently have changed by adulthood, as Lee ended up marrying someone else and had a son named Metal Lee.",
      "Lee has shiny black hair, round eyes with prominent lower eyelashes, and very thick eyebrows; as a result, Naruto calls him \"Centipede Brows\" (ゲジマユ, Gejimayu, English TV: Bushy Brows). As a child, his hair was quite long and fastened in a braid, though he cuts it short by the time he joins Team Guy, letting it curve out and upward. Lee originally wore a white, short-sleeved kimono-shirt with a martial arts belt and dark pants, giving him a more traditional Chinese appearance. He also sported a forehead protector and shinobi sandals."
    ],
    "images": [
      "https://static.wikia.nocookie.net/naruto/images/9/97/Rock_Lee_Part_I.png/revision/latest?",
      "https://static.wikia.nocookie.net/naruto/images/7/7d/Lee_timeskip.png/revision/latest?",
      "https://static.wikia.nocookie.net/naruto/images/d/d4/Lee_Part_III.png/revision/latest?"
    ]
  },
  "Kiba Inuzuka": {
    "info": {
      "Birthdate": "July 7",
      "Sex": "Male",
      "Age": "Part I: 12–13, Part II: 16–17",
      "Height": "Part I: 151.2 cm–152.5 cm, Part II: 169.1 cm, Blank Period: 173 cm",
      "Weight": "Part I: 43.3 kg–44.7 kg, Part II: 52.5 kg",
      "Blood type": "B",
      "Occupation": "Dog Breeder (Anime Only), Police Officer (Anime Only)",
      "Affiliation": "Konohagakure,  Allied Shinobi Forces",
      "Team": "Team 8, Sasuke Recovery Team, Konoha 11 (Anime only), Bikōchū Search Team (Anime only), Team Two (Anime only), Eight Man Squad, Fifth Division,  Konoha Military Police Force (Anime Only)",
      "Partner": "Akamaru",
      "Clan": "Inuzuka Clan"
    },
    "about": [
      "Kiba Inuzuka (犬塚キバ, Inuzuka Kiba) is a member of Konohagakure's Inuzuka clan and a member of Team Kurenai. Despite his headstrong, and at times egotistic attitude, Kiba is loyal to his comrades and will do anything to protect them with his trusted canine companion, Akamaru, by his side.",
      "At a very young age, Akamaru was given to Kiba by his mother, Tsume, and the two became very close soon afterwards. Before entering the Academy, Kiba and Akamaru played together a great deal, resulting in Tsume getting angry because they weren't training enough. During Kiba's time at the Academy, he often cut class with Akamaru, stating that he wasn't suited to sit still at a desk, or otherwise getting into trouble, along with Chōji Akimichi, Shikamaru Nara, and Naruto Uzumaki. Together, these four would skip class and go to the practice hall (not to practice). They thought that it was fun to also test the patience of Iruka Umino, their Academy instructor. One day, Kiba fell asleep during class and, upon waking, saw Naruto attempting to use the Transformation Technique to turn into the Third Hokage for the first time, and failing twice. This caused Kiba to find Naruto incompetent, and he became among those who ridiculed him.",
      "At some time in the past, Kiba knew his father; but because of his mother's attitude, Tsume scared him away, leaving him just with her and his sister Hana Inuzuka. Despite this, Kiba stays in a close relationship with his sister and mother, although he seems to agree that Tsume is rather frightening.",
      "Kiba is often short-tempered and impulsive (in stark contrast to his teammates Shino and Hinata), and can be prone to making mistakes when he becomes agitated in battle. He also enjoys combat even when facing particularly strong opponents. He cares deeply for Akamaru, and is willing to do whatever is necessary to protect him. And, despite his rather gruff attitude, many of Kiba's actions reveal that he is very close to his older sister, Hana, and remains fiercely loyal to his clan and has great pride in it.",
      "Back at his academy days, Shino always considered Kiba a \"problem child\", and wanted to be assigned to a team with anyone but him because of how different their personalities were to each other. Despite Shino's own stoic personality, he has shown a rather humorous side of his around Kiba, especially when he occasionally teases Kiba whenever he's boasting about how he's a suitable candidate for Hokage.",
      "Kiba has became extremely close to his other teammate, Hinata, and acts rather brotherly toward her, but tends to worry about her, urging her to be strong before the second phase of the exam,",
      "Kiba is also quite close to his sensei and her daughter. Although he gets a little annoyed by Mirai's habit of mixing up his and Akamaru's names, calling him and Akamaru \"Akakiba\" and \"Kibamaru\" respectively, which is rather weird considering Kiba and Akamaru frequently came to play with Mirai during their walks. Kurenai also seems to act rather playful with Kiba, teasing him about his newly grown goatee and pinching his cheeks."
    ],
    "images": [
      "https://static.wikia.nocookie.net/naruto/images/0/03/Kiba.png/revision/latest?",
      "https://static.wikia.nocookie.net/naruto/images/c/cb/Kiba_Part_2.png/revision/latest?",
      "https://static.wikia.nocookie.net/naruto/images/7/78/Kiba_Adult_New_Era.png/revision/latest?"
    ]
  },
  "Asuma Sarutobi": {
    "info": {
      "Birthdate": "October 18",
      "Sex": "Male",
      "Age": "Part I: 27–28, Part II: 31",
      "Status": "Deceased",
      "Height": "Part I: 190.8 cm",
      "Weight": "Part I: 81.6 kg",
      "Blood type": "O",
      "Affiliation": "Konohagakure",
      "Team": "Twelve Guardian Ninja, Team 10, Twenty Platoons",
      "Clan": "Sarutobi Clan"
    },
    "about": [
      "Asuma Sarutobi (猿飛アスマ, Sarutobi Asuma) was a jōnin of Konohagakure's Sarutobi clan and a former member of the Twelve Guardian Ninja. He was also the leader of Team 10 which consists of Shikamaru Nara, Ino Yamanaka, and Chōji Akimichi.",
      "Asuma was born to Biwako and Hiruzen Sarutobi, the Third Hokage. During his Academy entrance ceremony, Asuma became friends with Kurenai Yūhi. In the anime, during the Chūnin Exams, Asuma was placed on a team with Kurenai and Raidō Namiashi.",
      "During the Nine-Tailed Demon Fox's Attack, Asuma along with the other young ninja were barred from participating in the defence of the village by Shinku Yūhi and the other senior shinobi. A few years after the event, Asuma would become an uncle to Konohamaru. He later became a jōnin.",
      "About seven years before the start of the series, he had a disagreement with his father and left Konoha to pursue his personal interests. During his absence, he became one of the Twelve Guardian Ninja, a group that protected the Land of Fire's daimyō, indicated by the sash on his waist.",
      "Asuma was typically a laid-back individual, and did not get himself involved in things unless absolutely necessary, as seen when he decided not to help save Hinata Hyūga during her fight in the Chūnin Exams. He was a heavy smoker, but, despite this, he would abruptly break the habit under certain circumstances, such as when his father died",
      "Despite Asuma's very blunt personality, often calling his students what they were unreservedly, a \"glutton\" (Chōji), a \"loud mouth\" (Ino), and a \"slacker\" (Shikamaru), he had a very good relationship with all three. He often took them to Yakiniku Q for lunch and dinner where more often than not Chōji would eat too much and Asuma had to pay more and apologise emphatically to the owner. To help them overcome their underachieving natures, he attempted to use bribery and outright trickery to manipulate them into doing what he wanted. This was seen most with Chōji, who Asuma was frequently able to entice into action with the promise of food and even Shikamaru whom he had to use games like shōgi on to assess his skill level. Out of his students, Asuma spent the most time with and was closest to Shikamaru. Asuma and Shikamaru often played shōgi or Go in their free time, though Asuma was never able to beat Shikamaru.",
      "Throughout the series it had been heavily hinted that Asuma was romantically involved with fellow jōnin Kurenai Yūhi, having been close to her since childhood. The two appeared together in most of their scenes, and the other characters made it a point to note this fact on several occasions. When Kakashi Hatake found the two together at a dumpling shop, Kakashi asked if they were on a date, to which Asuma responded by quickly changing the subject. During Asuma's battle with Hidan and Kakuzu, Kurenai was often shown wondering about his progress, appearing anxious. When she heard of his death, she fell to her knees grief stricken. She later laid flowers on his grave during his funeral. The truth of their relationship was then made clear when Kurenai revealed that she was pregnant with Asuma's child."
    ],
    "images": [
      "https://static.wikia.nocookie.net/naruto/images/7/7c/Asuma.png/revision/latest?"
    ]
  },
  "Shisui Uchiha": {
    "info": {
      "Birthdate": "October 19",
      "Sex": "Male",
      "Status": "Deceased",
      "Height": "Part II: 180 cm",
      "Weight": "Part II: 68.9 kg",
      "Blood type": "A",
      "Kekkei Genkai": "Sharingan,  Mangekyō Sharingan",
      "Affiliation": "Konohagakure",
      "Team": "Team Shisui (Anime only)",
      "Clan": "Uchiha Clan"
    },
    "about": [
      "Shisui Uchiha (うちはシスイ, Uchiha Shisui), renowned as \"Shisui of the Body Flicker\" (瞬身のシスイ, Shunshin no Shisui, English TV: Shisui the Teleporter), was an Anbu from Konohagakure's Uchiha clan.",
      "Graduating from the Academy during the Third Shinobi World War, Shisui was placed on a genin team alongside his best friend. Immediately after the war ended a year later, Shisui witnessed his friend die on a mission, consequently awakening the Mangekyō Sharingan as he felt responsible.",
      "In the anime, Team Shisui was assigned a long mission, which they were tasked with chasing away Kirigakure forces being lead by Ao. The team completed their mission after Ao realised they were facing Shisui and had his team retreat. Unbeknownst to the clan, Shisui in reality sympathised with Itachi, not wanting the Uchiha to go to war with the village. As the Uchiha continued to grow angrier and more violent from the distrust of the village due to the suspicion of their involvement in the Nine-Tailed Demon Fox's Attack, Shisui approached Hiruzen Sarutobi revealing the truth to the Third Hokage. Trusting Shisui, seeing as he is Kagami Uchiha's descendant, Hiruzen allowed the Uchiha to spy on his clan for the village. Shisui was perplexed that the clan would not deter from the coup d'état that they were planning and soon became greatly concerned with the consequences that would follow their actions. Ultimately, it was decided that Shisui would use his Kotoamatsukami on Fugaku Uchiha to subtly end the coup d'état plan.",
      "Later, as Shisui prepared to make his move, Danzō Shimura, believing that simply manipulating the Uchiha's leader wouldn't end the conflict and that he would eventually try to manipulate him as well, chose to take Shisui's eyes for himself in the desire to protect the village in his own way. While Shisui effortlessly subdued Danzō at first, the ruthless elder caught Shisui off guard by using the forbidden Izanagi with another Sharingan already in his possession to break free and steal Shisui's right eye. As Danzō and his men surrounded Shisui to take the left eye, Shisui managed to escape.",
      "Fearing that Danzō was right in Shisui's inability to stop the Uchiha's revolt and that the elder would continue to pursue his left eye as well, Shisui entrusted it to Itachi, telling him to protect both the village and the Uchiha name. In the anime, Shisui was also hoping to use his death to awaken Itachi's Mangekyō Sharingan, succeeding in the goal.",
      "Shisui was a very humble and down-to-earth individual. He was never arrogant about his own talent or accomplishments, yet was not above telling others when they made mistakes. At the same time, he was open-minded, never stubbornly believing in one ideal solely and strove to see that unique nature of current situation before him. Shisui was also a deeply compassionate man, even to enemies, showing sympathy and kindness to a dying Mukai Kohinata despite having been ordered to assassinate him as a traitor. He was also shown to be very perceptive and intuitive even from a young age, able to see through the emotional nature of others and likewise able to notice the smallest details around him.",
      "Although Shisui was devoted to his clan, he was equally devoted to the well-being of his village, a trait his own clan is apparently ignorant of. His devotion to his village was so strong that he never fell victim to the Curse of Hatred. However, Shisui had a darker side he was deeply ashamed of; out of envy to a friend who he believed had surpassed him in ability, Shisui withheld aid at a critical moment, leading to the other shinobi's death. The guilt of what he had done led Shisui to consider himself a murderer, causing him to awaken his Mangekyō Sharingan, which he used as a constant reminder of his remorse and vow to never succumb to such feelings ever again."
    ],
    "images": [
      "https://static.wikia.nocookie.net/naruto/images/4/4c/Shisui_Uchiha.png/revision/latest?"
    ]
  },
  "Kurama": {
    "info": {
      "Species": "Kitsune",
      "Status": "Deceased",
      "Classification": "Tailed Beast, Sensor Type, Sage",
      "Jinchūriki": "Mito Uzumaki, Kushina Uzumaki, Minato Namikaze (Yin half), Naruto Uzumaki, Black Zetsu (Yin half), Obito Uchiha (Yin half)",
      "Affiliation": "Konohagakure,  Allied Shinobi Forces"
    },
    "about": [
      "Kurama (九喇嘛, Kurama), more commonly known as the Nine-Tails (九尾, Kyūbi), was one of the nine tailed beasts. Centuries of being regarded as a mindless monster and sought after as a tool for war caused Kurama to hate humans. After being sealed into Naruto Uzumaki, Kurama attempts to maintain its cynical perspective about the world, but with Naruto's insistence on treating it with respect, the fox overturns its hatred and willingly strives to use its power for the world's salvation.",
      "Kurama and the tailed beasts first came into being in the waning days of Hagoromo Ōtsutsuki, who used his Creation of All Things Technique to divide the Ten-Tails' chakra into nine separate bodies and giving each a name. Some time after being created, the Sage explained to the young tailed beasts that a link existed between them despite their separation. He also foretold of a day when they would be brought together again - though not as they were - and that at that time someone would emerge to show them what true power is.",
      "During the time of the founding of the shinobi villages, the Gold and Silver Brothers of Kumogakure were assigned to capture Kurama, but were both swallowed whole by the fox. However, the two brothers survived and gained some of its power by eating the flesh of its stomach for two weeks, forcing Kurama to regurgitate them.",
      "After Madara Uchiha's defection from Konohagakure, he found Kurama and used his Sharingan to control it, forcing the fox to help him fight against Hashirama Senju, the First Hokage. The epic battle left a colossal scar in the earth that would come to be called the Valley of the End.",
      "Over the period of time which included the first two Shinobi World Wars, Mito kept Kurama at bay except when the seal nearly broke when she was going through childbirth. Towards the final years of her life, Mito passed on this status and responsibility to another member of her clan, Kushina Uzumaki, who later became the wife of Minato Namikaze, the Fourth Hokage. Although Kushina was terrified with the responsibility of containing Kurama, Mito assured her successor that the fox's hatred was powerless against her love.",
      "Soon after the end of the Third Shinobi World War, the Third Hokage made special arrangements for Minato to ensure that Kurama would remain sealed inside Kushina while she gave birth to Naruto on the night of October 10. However, despite keeping the childbirth a secret, a masked man called Tobi tracked down their location, killed their escorts, and held Naruto hostage, forcing Minato to quickly rescue him and teleport him to safety. Right after Tobi captured Kushina, he extracted and seized control of Kurama, and tried to have the fox kill its barely surviving jinchūriki, but Minato made it in time to save her. Soon afterwards, the masked man summoned Kurama into Konoha and ordered it to destroy the village.",
      "While Kurama was rampaging in the village, Minato fought against Tobi and soon managed to place a Contract Seal on him, which freed the fox from his control. Despite that, Kurama still harboured resentment against Konoha for sealing it away and continued decimating the shinobi forces that tried to repel it. As it prepared a Tailed Beast Ball, Minato summoned Gamabunta on top of the fox, and quickly teleported it to Kushina and Naruto's location, letting its Tailed Beast Ball detonate away from the village. Already dying from the extraction, Kushina used her remaining strength to restrain Kurama, planning to seal the fox back inside her so it would die with her. However, knowing that Kurama would revive without a host and how great a threat Tobi was, Minato instead came up with a plan to give his son the means to combat the masked man in the future."
    ],
    "images": [
      "https://static.wikia.nocookie.net/naruto/images/7/7b/Kurama2.png/revision/latest?"
    ]
  },
  "Kurenai Yūhi": {
    "info": {
      "Birthdate": "June 11",
      "Sex": "Female",
      "Age": "Part I: 27–28, Part II: 31–32",
      "Height": "Part I: 169.1 cm",
      "Weight": "Part I: 54.4 kg",
      "Blood type": "AB",
      "Classification": "Sensor Type",
      "Affiliation": "Konohagakure",
      "Team": "Team 8",
      "Clan": "Sarutobi Clan"
    },
    "about": [
      "Kurenai Sarutobi (猿飛紅, Sarutobi Kurenai, née Yūhi (夕日)) is a member of Konohagakure's Sarutobi clan. During her time as an active duty kunoichi, she served as the jōnin-leader of Team 8.",
      "As a child, Kurenai met Asuma Sarutobi during the Academy entrance ceremony where the two quickly became friends. She graduated at age 9. In the anime, during the Chūnin Exams, Kurenai was placed in a team with Asuma and Raidō Namiashi.",
      "During the Nine-Tailed Demon Fox's Attack, Kurenai, Kakashi, Asuma and Guy were amongst the young ninja that wanted to help in repelling the beast, but the group was barred from participating by the older shinobi, one of whom was her own father. Though she protested greatly about this, her father told her that this wasn't war but an internal village issue and as they were shinobi, their lives were brief and that she should live long enough to ensure that the next generation would come about that would inherit the Will of Fire.",
      "In the anime, because of Kurenai's natural talent for genjutsu, the Third Hokage tasked Kurenai with helping to train Yakumo Kurama, another talented genjutsu user who longed to be a ninja.",
      "At some point in time, Kurenai visited the Hyūga estate and took on Hinata on as her charge. She asked Hiashi whether he was certain about his decision to have his daughter join the regular forces, he promptly dismissed her stating that the Hyūga clan had no place for the weak.",
      "Kurenai is a caring and brave woman. She shows great concern towards her students and takes a vested interest in their growth, especially in regards to Hinata Hyūga due to knowing full well how Hinata was viewed by her father. When Hinata tried to offer Naruto some medicine after his fight with Kiba, Kurenai convinced Naruto Uzumaki to take it because she knew of her student's infatuation with him.",
      "Throughout the series, it has been heavily hinted that Kurenai was romantically involved with fellow jōnin Asuma. The two appeared together in most of their scenes, and the other characters made it a point to note this fact on several occasions. When Kakashi Hatake found the two together at a dumpling shop, he asked if they were on a date, which made Kurenai blush and made an excuse that she was running an errand only. The truth of their relationship was made clear in Part II when Kurenai revealed that she is pregnant with Asuma's daughter, Mirai Sarutobi. Since becoming a single mother, Kurenai proved very capable, raising Mirai to be very cheerful and responsible."
    ],
    "images": [
      "https://static.wikia.nocookie.net/naruto/images/6/67/Kurenai_Part_I.png/revision/latest?",
      "https://static.wikia.nocookie.net/naruto/images/d/da/Kurenai_p3.png/revision/latest?"
    ]
  },
  "Shino Aburame": {
    "info": {
      "Birthdate": "January 23",
      "Sex": "Male",
      "Age": "Part I: 12–13, Part II: 16–17",
      "Height": "Part I: 156.2 cm–161.1 cm, Part II: 175.1 cm, Blank Period: 182 cm, Gaiden: 186.5 cm",
      "Weight": "Part I: 45.8 kg–48.5 kg, Part II: 56.6 kg",
      "Blood type": "AB",
      "Occupation": "Academy Teacher, Chūnin Exams Proctor, Genin Exams Proctor (Anime only)",
      "Affiliation": "Konohagakure,  Allied Shinobi Forces",
      "Team": "Team 8, Konoha 11 (Anime only), Bikōchū Search Team (Anime only), Kaima Capture Team (Anime only), Eight Man Squad, Team One (Anime only), Fifth Division",
      "Clan": "Aburame Clan"
    },
    "about": [
      "Shino Aburame (油女シノ, Aburame Shino) is a shinobi of Konohagakure's Aburame clan. Quiet, and at times off-putting to some, Shino puts his clan's insect-based techniques to use on Team Kurenai.",
      "Shino at one time grew up alongside Torune Aburame as his family took him in under guardianship after Torune's father, Shikuro Aburame, passed away. Despite their different views about friendship, Shino grew close to Torune, viewing him as an older brother. Torune even revealed to Shino his unique breed of microscopic insects. One day, Danzō Shimura approached the two young Aburame with the desire to recruit another young member of a secret technique-using clan for Root. While Danzō had the authority to do so and expressed interest in Shino, not wanting Shino to live a life of loneliness, Torune offered himself, appealing to Danzō by revealing who his father was. Knowing that he would probably never see Torune again but wanting to remain close to his brother-figure in some way, Shino harvested some of Torune's insects and spent years refining his bug breeding technique to produce new beetles that inherited traces of Torune's insects.",
      "After enrolling into the Academy and being placed in Iruka Umino's class, he met Kiba Inuzuka, whom he numerously became irritated at due to the pair having polar opposite personalities. During breaks in between classes, he would let his bugs walk on his desk. During a class training session, he watched on alongside Kiba as Shikamaru Nara and Chōji Akimichi refused to fight each other even during training. When Kiba commented that Shikamaru, who had found the process to be too troublesome, would be a genin for the rest of his life, Shino noted that that may not be so as Shikamaru could go on to live a long life and many things could happen, but before he could finish his statement Kiba cut him off.",
      "Since his early childhood, Shino has been a calm, collected, and solitary person, who is quite mysterious. Shino is portrayed as being somewhere between merely stoic and matter-of-fact, rarely ever smiling or showing emotion at all; rather than thank his teammates for congratulating him on his victory in the preliminaries, he told them that he expected them to do the same. He also has a tendency of holding grudges and being rather intimidating, such as seen when Naruto failed to recognise him at the start of Part II (which is fair as the only visible part of his face were his sunglasses), but easily recognised Kiba and Hinata regardless. He still holds that grudge to this day. ",
      "Shino seems to be aware of these odd personality traits; in the anime, when he ate food poisoned with a chemical that forced him to laugh, he menacingly told Naruto to forget it had ever happened. His interest in insects only helps him strengthen this viewpoint; by spending most of his spare time watching them, and often making analogies to insects when talking, people have come to identify Shino as \"creepy\", and tend to dislike being in his company for prolonged periods of time. In his Infinite Tsukuyomi dream, Shino dreamt that he found a new giant-sized species of bugs and tamed it as his own.",
      "Despite occasionally arguing with Kiba due to their personality differences, Shino has a very strong sense of connection with his teammates and allies. This was first seen when he promised Sasuke Uchiha to help him fight Gaara after dealing with Kankurō, but regretted not being able to uphold that promise after being poisoned.",
      "Shino is also very brave as he and his teammates were terrified after seeing Gaara's powers during the second stage of the Chūnin Exams, but he still resolved to help Sasuke in any way he could with Gaara. He also regretted being unavailable and therefore unable to help with retrieving Sasuke. From that point onwards, he resolved to work on his teamwork skills with Kiba and Hinata. He even helped Hinata to improve her abilities, and is one of the few people, besides Naruto, who openly professes confidence in her. The fruits of his efforts are seen in the anime, where Shino was able to carry out a mission successfully while also keeping others safe. He also proves to be able to understand his teammates' inner workings, sensing when the slightest of things is wrong with either of them. During the Fourth Shinobi World War, he also went out of his way to keep his teammate's chakra flow active through the use of his insects."
    ],
    "images": [
      "https://static.wikia.nocookie.net/naruto/images/9/9c/Shino.png/revision/latest?",
      "https://static.wikia.nocookie.net/naruto/images/e/e1/Shino_Aburame_P2.png/revision/latest?",
      "https://static.wikia.nocookie.net/naruto/images/3/3b/Shino_part_III.png/revision/latest?"
    ]
  },
  "Obito Uchiha": {
    "info": {
      "Birthdate": "February 10",
      "Sex": "Male",
      "Age": "Part I: 13 (Kakashi Gaiden), Part II: 31",
      "Status": "Deceased",
      "Height": "Part I: 154.2 cm, Part II: 175 cm–182 cm",
      "Weight": "Part I: 44.5 kg, Part II: 55.9 kg–70.3 kg",
      "Blood type": "O",
      "Kekkei Genkai": "Sharingan,  Mangekyō Sharingan,  Rinnegan,  Wood Release",
      "Classification": "Jinchūriki, Pseudo-Jinchūriki, Missing-nin, S-rank, Sensor Type",
      "Tailed Beast": "Ten-Tails, Shukaku, Gyūki, Kurama (Yin half) (Forms)",
      "Occupation": "Leader of Akatsuki, Secret Leader of Kirigakure",
      "Affiliation": "Konohagakure,  Akatsuki,  Kirigakure",
      "Team": "Team Minato",
      "Partner": "Madara Uchiha, Deidara, Zetsu",
      "Clan": "Uchiha Clan"
    },
    "about": [
      "Obito Uchiha (うちはオビト, Uchiha Obito) was a member of Konohagakure's Uchiha clan. He was believed to have died during the Third Shinobi World War, his only surviving legacy being the Sharingan he gave to his teammate, Kakashi Hatake. In truth, Obito was saved from death and trained by Madara Uchiha, but the events of the war left Obito disillusioned with reality, and he inherited Madara's plan to create an ideal world. Resurfacing under the names of Tobi (トビ, Tobi) and Madara Uchiha himself, Obito subtly took control of the Akatsuki, using them as a means to advance his machinations, eventually going public and starting the Fourth Shinobi World War. However, towards the war's conclusion, Obito had a change of heart and, as atonement, sacrificed his life to save the same world he sought to replace.",
      "Obito grew up not knowing who his parents were; in the anime, he was left in the care of his grandmother.",
      "In the anime, as a final qualifying test, Minato gave the team a bell test to test their cooperation skills. Obito could not accomplish this on his own but, by joining forces with Rin and Kakashi, they succeeded in taking the bells, teaching Obito the value of teamwork.",
      "During the Third Shinobi World War, Kakashi was placed in charge of the team for a mission to destroy the Kannabi Bridge, which would hinder Iwagakure from using Kusagakure as a relief point. Before beginning the mission, Minato and Rin gave gifts to Kakashi to celebrate his promotion to jōnin, though Obito had \"forgotten\", straining their already poor relationship. Minato was soon called to the front lines, leaving the team to complete the mission alone under Kakashi's command. The three were discovered by Iwa-nin along the way and Rin was captured. Kakashi elected to abandon Rin, believing it was more important to finish the mission before concerning themselves with her safety. Obito became enraged at the idea and insisted that they focus on her rescue. When Kakashi refused, Obito left on his own, remarking that Kakashi was worse than trash for abandoning his friends.",
      "Obito located the cave the Iwa-nin were using as a hideout, but was found by a camouflaged Taiseki before he could launch a rescue. Kakashi, moved by Obito's earlier words, arrived in time to save him from Taiseki's attack, but lost his left eye in the process. From his desire to help Kakashi, Obito awakened his Sharingan, allowing him to see through Taiseki's camouflage and kill him. Obito and Kakashi infiltrated the cave and released Rin from her restraints. Her captor, Kakkō, caused the cave to collapse around them. As the team ran for the exit, Kakashi was struck in his blind spot and fell. When Obito noticed that Kakashi was about to be hit by a falling boulder, Obito pushed him out of the way and became trapped in his place.",
      "With the right side of his body crushed and no way to free himself, Obito accepted his fate and made an offering: to give Kakashi his left Sharingan as an apology for not getting him a present earlier.",
      "In actuality, Obito was rescued by White Zetsu under orders from an elderly Madara. He brought Obito to Mountains' Graveyard and tended to his injuries, removing those body parts too damaged to be healed and replacing them with limbs cultivated from the cells of Hashirama Senju. Despite his injuries, Obito's right Sharingan had survived intact. Although frightened by Madara, Obito felt indebted to him for saving his life and was willing to render any assistance he could, an offer Madara made clear he would collect upon. Obito began a long rehabilitation process, eager to recover enough for him to return to Konoha and help his friends and the village with the still-ongoing war. With the help of White Zetsu and another spiral-faced Zetsu he nicknamed Guruguru, Obito became accustomed to his replacement limbs and the abilities they granted him. All the while, Madara would tell Obito about the harsh realities of the world and his plan to save it, which the young Uchiha disregarded."
    ],
    "images": [
      "https://static.wikia.nocookie.net/naruto/images/4/4a/Obito_Uchiha.png/revision/latest?",
      "https://static.wikia.nocookie.net/naruto/images/0/0d/Tobi.PNG/revision/latest?"
    ]
  },
  "Deidara": {
    "info": {
      "Birthdate": "May 5",
      "Sex": "Male",
      "Age": "Part II: 19",
      "Status": "Deceased",
      "Height": "Part II: 166 cm",
      "Weight": "Part II: 50.8 kg",
      "Blood type": "AB",
      "Kekkei Genkai": "Explosion Release",
      "Classification": "S-rank, Missing-nin, Mercenary Ninja",
      "Occupation": "Terrorist Bomber",
      "Affiliation": "Iwagakure,  Akatsuki",
      "Team": "Explosion Corps, Surprise Attack and Diversion Platoon",
      "Partner": "Sasori, Tobi"
    },
    "about": [
      "Deidara (デイダラ, Deidara) was an S-rank missing-nin from Iwagakure. During his time in the village, he was a member of the Explosion Corps. After defecting from the village, he was forced into Akatsuki and was its youngest member. There, Deidara was partnered with Sasori until the latter's death, and later with Tobi before his own death.",
      "During his time as an Iwagakure shinobi, Deidara came to be a pupil under Ōnoki the Third Tsuchikage, and became familiarised with his fighting style.",
      "Deidara's exploits eventually caught the attention of Akatsuki, and Itachi Uchiha, Kisame Hoshigaki, and Sasori were sent to recruit him. Deidara refused at first until he accepts a challenge from Itachi on the condition that Akatsuki let him be if he won. However, Deidara was easily defeated by Itachi's Sharingan and begrudgingly joined the organisation where he was partnered with Sasori. In the anime, Sasori and Deidara were immediately tasked with eliminating Orochimaru for betraying the organisation. Upon arriving in the Land of Wind and witnessing the Summoning: Impure World Reincarnation by Orochimaru, the Sannin retreated after his technique proved incomplete. After Deidara attempted to kill him by blowing up his base, Deidara and Sasori searched the ruins but were unable to confirm his death as they didn't find his corpse.",
      "With his ego crushed from his defeat at the hands of Itachi's dōjutsu, Deidara carried a murderous loathing for Itachi and his Sharingan for the rest of his life.",
      "During his partnership with Sasori, Deidara usually showed a cool, and relaxed attitude, never losing his smirk even while fighting an intense battle or when being blamed by his partner. However, his personality seemed to change to some extent after being partnered with Tobi, as he would easily get mad at his partner’s childish and sometimes disrespectful behaviour. He also had something of a sadistic arsonist nature, rather he was not above enjoying a good fight, and he often blew up his opponents in a very brutal fashion. Deidara's most distinctive trait, however, was his love of art. He would respect any form of it, even if it disagreed with his own. Deidara also had a habit of ending his sentences with nasal-like grunts (…うん, …un), roughly translated as \"yeah\" or \"hm\". The latter of which is used in the VIZ version. Deidara also seemed to respect the ideals of others as he allowed Gaara to move the sand he used to protect his village into the desert before kidnapping him, even going so far as to admiringly call him noble.",
      "Deidara referred to his explosive ninjutsu as art, usually quoting \"Art is an Explosion!\" (芸術は爆発だ, Geijutsu wa Bakuhatsu da) and seeing each bomb he made to be a significant accomplishment. He referred to his style as superflat (referring to certain types of art), and claimed pop (another art style) is dead. He would often boast about his works of art, even towards his opponents in battle. Deidara's pride as an artist makes him simply unwilling to accept that anything could defeat it, leading to his abandonment of strategy during his battle with Sasuke Uchiha, in favour of tactics that let him show off his art. He was able to recognise stronger opponents like Itachi, although he felt that the Sharingan was inartistic, and despised the fact that he had been enthralled by its genjutsu.",
      "Deidara referred to his partner Sasori as Master Sasori (サソリの旦那, Sasori no Danna, English TV: Sasori, my man), out of respect for him as a fellow artist. He also admitted, at least outwardly, that Sasori was more powerful than he was."
    ],
    "images": [
      "https://static.wikia.nocookie.net/naruto/images/d/d3/Deidara_mugshot.png/revision/latest?"
    ]
  },
  "Sasori": {
    "info": {
      "Birthdate": "November 8",
      "Sex": "Male",
      "Age": "Part II: 35",
      "Status": "Deceased",
      "Height": "Part II: 164.1 cm",
      "Weight": "Part II: 47.3 kg",
      "Blood type": "AB",
      "Classification": "S-rank, Missing-nin",
      "Affiliation": "Sunagakure,  Akatsuki",
      "Team": "Puppet Brigade, Surprise Attack and Diversion Platoon",
      "Partner": "Orochimaru, Deidara"
    },
    "about": [
      "Sasori (サソリ, Sasori), renowned as Sasori of the Red Sand (赤砂のサソリ, Akasuna no Sasori), was an S-rank missing-nin from Sunagakure's Puppet Brigade and a member of Akatsuki, where he was partnered with Orochimaru and later Deidara.",
      "When Sasori was young, his father and mother were killed by Sakumo Hatake in battle, leaving him in the care of his grandmother, Chiyo. When Chiyo attempted to cheer him up by teaching him puppetry, Sasori's innate aptitude for the art became apparent, and he even began to devise masterful ways of eliminating a puppet master's weaknesses in battle. His skills even allowed him to create two puppets in the image of his parents in an attempt to discard the terrible loneliness he felt. However, as the puppets were unable to give him the real parental love that he desired, Sasori lost interest in them, and they later fell into Chiyo's possession. Sasori created many other ingenious puppets, including Kuroari, Karasu, and Sanshōuo.",
      "During the Third Shinobi World War, the effectiveness of his puppets in spilling his enemies' blood on the sand gave rise to Sasori's moniker \"Sasori of the Red Sand\". However, motivated by his desire to make works that last forever, Sasori began experimenting to create puppets out of people. In the anime, his only friend, Komushi, lost his right arm during his border control duty, so Sasori gave him a new puppet arm as a prosthetic limb. After Komushi perished, having accidentally ingested some of Sasori's poison, Sasori proceeded to turn him into one of his first human puppets.",
      "Sometime after becoming a missing-nin, Sasori was confronted by Konan and recruited into Akatsuki.",
      "After joining the Akatsuki, he utilised his skills to create numerous spies like Yūra and Mukade from Suna as sleeper agents. Sasori was paired with Orochimaru, who shared his desire of an everlasting existence.",
      "Sasori grew up in a sad and lonely environment due to the absence of parental love. When introduced to the art of puppetry by his grandmother, Chiyo, he grew a little happier. He eventually created puppets in the likeness of his parents, but when he realised that the puppets could not give him the actual love that he desired, he became cold, aloof and led to his general disregard for human life. Sasori even went so far as to state that he would feel nothing if Chiyo died, as he claimed that his heart had become like his puppet body: without any emotions. Neither did Sasori have any loyalty for his village, as he defected to pursue personal interests and even kidnapped the Third Kazekage, which caused severe damage for Sunagakure, and then attack the village again twenty years after leaving. Despite his cruel and nihilistic nature, Sasori was also known to possess a very down-to-earth outlook on life, rarely getting worked up over obstacles that impeded his way. He rarely gave way to any strong emotions, and such instances that happened were often short-lived.",
      "Sasori was also known for his impatience, as he repeatedly noted that he did not wish to wait or keep others waiting. Despite this, he took his time in battling Kankurō when they first met due to his interest in fighting his old creations, which were handed down to a puppet master of the next generation."
    ],
    "images": [
      "https://static.wikia.nocookie.net/naruto/images/f/f7/Sasori.png/revision/latest?"
    ]
  },
  "Gaara": {
    "info": {
      "Birthdate": "January 19",
      "Sex": "Male",
      "Age": "Part I: 12–13, Part II: 15–17",
      "Height": "Part I: 146.1 cm–148.1 cm, Part II: 166.1 cm, Blank Period: 172.5 cm",
      "Weight": "Part I: 39 kg–40.2 kg, Part II: 50.9 kg",
      "Blood type": "AB",
      "Kekkei Genkai": "Magnet Release (Novel only)",
      "Classification": "Jinchūriki, Sensor Type",
      "Tailed Beast": "Shukaku (Forms)",
      "Occupation": "Kazekage, Regimental Commander of the Allied Shinobi Forces, Commander of the Fourth Division",
      "Affiliation": "Sunagakure,  Allied Shinobi Forces",
      "Team": "Three Sand Siblings, Fourth Division",
      "Clan": "Kazekage Clan (Novel only)"
    },
    "about": [
      "Gaara (我愛羅, Gaara) is a shinobi of Sunagakure. He was made the jinchūriki of the One-Tailed Shukaku before he was born, causing the villagers of Suna to fear him as a monster. With nobody to connect to, Gaara grew up hating the world and looking out only for himself, giving his life meaning by killing anyone he came across. After being defeated by Naruto Uzumaki — a jinchūriki like himself who found strength in his friendships — Gaara starts emulating him. He becomes Suna's Fifth Kazekage (五代目風影, Godaime Kazekage, literally meaning: Fifth Wind Shadow) so that he can protect the village and all those who live there, dispelling the fears he cast on the villagers.",
      "Because of heavy cuts to Sunagakure's budget, the Fourth Kazekage wanted to make one of his children the jinchūriki of the One-Tailed Shukaku to serve as a weapon for the village.",
      "Gaara was raised in isolation during his early life, taught ninjutsu by his father and cared for by his maternal uncle, Yashamaru. When he was allowed to roam around the village, Gaara would try to connect with the villagers, being kind to them and offering them any assistance he could. However, being a jinchūriki made the villagers frightened of Gaara; adults avoided him and, when they couldn't, treated him delicately while children would run from him on sight. Gaara would try to assure them he meant no harm, but in the process would inadvertently injure or even kill them with his sand. Gaara did not understand this pain he caused others because his sand protected him from all injury. When he was six years old, Gaara asked Yashamaru to explain pain to him. From Yashamaru's explanation, Gaara believed he did know pain: the unbearable agony in his heart.",
      "From this, Yashamaru elaborated that physical pain, what causes one to bleed, could be cured with medicine and time, whereas pain of the heart, like Gaara experienced, could only be cured with love. Gaara, said Yashamaru, received love everyday, from both his mother - whose spirit controlled the sand that protected him - and from Yashamaru himself. Gaara was pleased by this and went out into the village to show some love to those he'd harmed, but his efforts were met only with more fear and hate. Gaara was dismayed and went off to try and understand why he was treated as such a monster. While doing so, he was attacked by one of Suna's Anbu, whom he fatally wounded with his sand. When he unmasked the Anbu, Gaara discovered it was Yashamaru.",
      "Gaara was devastated that Yashamaru, the only living person to love him, would try to kill him and asked for an explanation. Yashamaru replied that it was a mission given to him by Rasa, Gaara's father, it having been decided by the Suna Council that Gaara was a failed experiment that, if allowed to live, would only continue to do harm to the village and its people. Gaara tried to find solace in the fact that Yashamaru had been ordered to kill him, but Yashamaru insisted, lying to Gaara, that he volunteered and that he'd always hated Gaara for causing Karura's death. Karura had not loved Gaara either, and named him after the phrase \"a self-loving carnage\" (我を愛する修羅, Ware o aisuru shura) so that he would be a curse upon Suna for what it had done to her. With his explanation done, Yashamaru asked Gaara to \"please die\" before blowing himself up with explosive tags.",
      "Gaara's sand - a product of Shukaku rather than Karura if Yashamaru's words were to be believed - shielded Gaara from the blast. Having lost everything he cared for, Gaara decided that he would from that point forward live up to his namesake by loving only himself; to that end, he used his sand to etch the kanji for \"love\" (愛, ai) onto the left side of his forehead. Due to his singular focus on himself, Gaara eventually learned to reign in his powers and became the lethal weapon of destruction Suna wanted him to be, prompting Rasa to stop trying to kill him and instead find a use for him.",
      "Gaara was consistently warm to others during his early life. Although most of Suna's villagers feared and despised him, he was able to persevere due to the love that he felt from Yashamaru and his mother. His father, Rasa, believed these niceties were impeding Gaara's development as a jinchūriki and as such had both taken from him: he ordered Yashamaru to try and kill Gaara and, if he were to fail, to tell Gaara that neither he nor Gaara's mother had ever loved him. Rasa's plan succeeded, as following Yashamaru's death Gaara stopped trying to connect with people. Rather, Gaara focused on himself, driven solely by his own desires and his own survival."
    ],
    "images": [
      "https://static.wikia.nocookie.net/naruto/images/4/4a/Gaara_p1.png/revision/latest?",
      "https://static.wikia.nocookie.net/naruto/images/0/0f/Gaara_Part_II.png/revision/latest?",
      "https://static.wikia.nocookie.net/naruto/images/1/1b/Gaara_Part_III.png/revision/latest?"
    ]
  }
}
