{
  "Naruto Uzumaki": {
    "about": [
      "Naruto Uzumaki (うずまきナルト, Uzumaki Naruto) é um shinobi de Konohagakure, também sendo a reencarnação atual de Asura e o protagonista homônimo da franquia Naruto. Ele se tornou o jinchūriki de Kurama no dia de seu nascimento, um destino que o levou a ser condenado ao ostracismo e ser negligenciado por toda a aldeia durante toda a sua infância. Depois de entrar para o Time Kakashi, Naruto trabalhou duro para ganhar o respeito e o reconhecimento da aldeia, com o sonho de se tornar Hokage. Nos anos seguintes, Naruto torna-se um ninja capaz, que é eventualmente considerado como um herói, tanto por parte dos moradores como pelo mundo shinobi em geral. O objetivo de Naruto em se tornar Hokage foi deixado de lado, devido a ele querer salvar o seu melhor amigo e companheiro de equipe, Sasuke Uchiha, que sucumbiu ao ódio e à escuridão, eventualmente, Naruto consegue cumprir esse objetivo após derrotá-lo em sua batalha final. Anos depois da Quarta Guerra Mundial Shinobi, Naruto realiza seu sonho e se torna o Sétimo Hokage (七代目火影, Nanadaime Hokage; Literalmente significa \"Sétima Sombra do Fogo\"), enquanto também se casa com Hinata Hyūga e tem dois filhos com ela, Boruto e Himawari Uzumaki.",
      "Crescendo sem nenhuma figura paterna, Naruto é exuberante, ousado, desatento, descuidado e indiferente para a formalidade ou posições sociais. Ele costuma terminar frases com \"Dattebayo!\" (だってばよ!, TV Brasileira: Tô Certo!) quando animado ou frustrado. Ele tem uma série de características infantis, como ser um comedor muito exigente (ele come quase exclusivamente lámen), ter medo de fantasmas, além de carregar uma carteira gordinha de um sapo verde que ele chama de \"Gama-chan\".",
      "Devido aos anos de isolamento e desprezo que ele recebeu da aldeia, Naruto passou a desejar ser reconhecido. Ele costumava fazer brincadeiras ao redor da aldeia apenas para obter atenção e desejava se tornar Hokage, na esperança de ser reconhecido por todos como uma pessoa importante. Durante o treinamento de Naruto na Cachoeira da Verdade, foi revelado que uma parte dele odiava a aldeia por tratá-lo como um pária, apenas se importando com ele depois que ele a salvou durante a invasão de Pain. Esse ódio permitia que Kurama manipulasse Naruto quando ele ficava furioso, levando-o a ficar selvagem várias vezes até que Naruto enfrentou o problema e aprendeu a deixá-lo ir. Como Naruto cresceu em sua carreira como um ninja, seu desejo de ser reconhecido com um Hokage mudou para o desejo de ajudar e proteger as pessoas próximas a ele, o qual Tobi atribuiu à Vontade do Fogo. Naruto desenvolveu seu nindō em nunca voltar para atrás em sua palavra, colocando-se através de todos os comprimentos necessários para cumprir a sua promessa, como mostra em sua promessa à Sakura de trazer Sasuke de volta depois de sua deserção, apesar de Sakura (após algum tempo) ver isso como impossível, devido à Sasuke se tornar um criminoso internacional perigoso mais tarde.",
      "De acordo com Kakashi, Naruto aprende através de seu corpo, como ele é relativamente ingênuo, simples e lento para entender princípios ou situações, muitas vezes exigindo uma analogia simplista, a fim de entender o que está sendo explicado para ele, algo que ele tornou-se mais dispostos a admitir.",
      "A morte de seu mestre Jiraiya e a invasão de Pain causaram uma grande mudança no ponto de vista com relação ao mundo de Naruto. Durante seu luto por Jiraiya, Naruto jurou vingança sobre Pain e deixou a aldeia para aprender senjutsu. Apesar deste desejo fazer ele ficar em oposição direta ao de Sasuke, Naruto continua por este caminho, determinado em acabar com ambos a Quarta Guerra Mundial Ninja e o ciclo de ódio.",
      "Na idade adulta, Naruto se tornou muito mais calmo e mais sábio em sua abordagem, mas ainda mantém alguns traços infantis. Depois de perceber o seu amor por Hinata, Naruto se tornou não só protetor com ela, mas também tímido e nervoso em sua presença até o ponto onde ele acidentalmente lhe disse como se sentia. Quando Hinata o \"rejeitou\" em favor de Toneri Ōtsutsuki, Naruto ficou bastante deprimido e chegou perto de desistir de tudo, até que Sakura ajudou Naruto a perceber que Hinata nunca faria isso com ele e apenas fingiu rejeitá-lo a fim de conseguir uma melhor chance para salvar Hanabi e parar Toneri. Isso fez com que Naruto ficasse mais determinado do que nunca para salvar não só as irmãs Hyūga e parar Toneri, como também o seu desejo de estar com ela para o resto de sua vida. Depois de se casar e ter dois filhos com Hinata, Boruto e Himawari, ele costumava interromper sua própria formação para brincar com ela.",
      "Depois de se tornar Hokage, Naruto tem crescido mais sério e rigoroso com as suas funções, recebendo enormes responsabilidades e se tornando oprimido, levando-o a criar clones das sombras para ficar com sua família, que vem abalando seu relacionamento com seu filho, que ocasionalmente faz brincadeiras tais como desfigurar o Monumento Hokage para buscar sua atenção."
    ],
    "info": {
      "Sexo": "Masculino",
      "Aniversário": "10 de outubro",
      "Idade": "Parte I: 12-13 anos",
      "Altura": "Parte I: 145.3 cm - 147.5 cm",
      "Peso": "Parte I: 40.1 - 40.6 kg",
      "Tipo Sanguíneo": "B",
      "Clã": "Clã Uzumaki",
      "Kekkei Genkai": "Liberação de Fervura",
      "Bijū": "Shukaku, Matatabi, Isobu, Son Gokū, Kokuō, Saiken, Chōmei, Gyūki, Kurama (Transformações)",
      "Classificação": "Jinchūriki",
      "Ocupação": "Hokage",
      "Afiliação": "Konohagakure",
      "Times": "Time Kakashi",
      "Patente Ninja": "Fase I:  Genin",
      "Registro Ninja": "012607",
      "Graduação (Genin)": "12"
    },
    "images": [
      "https://static.wikia.nocookie.net/naruto/images/3/33/Naruto_Uzumaki_%28Parte_I_-_HD%29.png/revision/latest?cb=20160316113315&path-prefix=pt-br",
      "https://static.wikia.nocookie.net/naruto/images/b/b1/Naruto_Uzumaki_%28Infobox_Parte_II_B%29.png/revision/latest?cb=20210210161020&path-prefix=pt-br",
      "https://static.wikia.nocookie.net/naruto/images/c/ce/Naruto_Uzumaki_-_Fase_Boruto.png/revision/latest?cb=20180303220658&path-prefix=pt-br"
    ]
  },
  "Minato Namikaze": {
    "about": [
      "Minato Namikaze (波風ミナト, Namikaze Minato), conhecido como Relâmpago Amarelo de Konoha (木ノ葉の黄色い閃光, Konoha no Kiiroi Senkō; Português \"Flash Amarelo da Folha\"), foi um shinobi lendário que se tornou o Quarto Hokage (四代目火影, Yondaime Hokage; Literalmente significa \"Quarta Sombra do Fogo\") de Konohagakure. Morreu sacrificando sua vida durante o Ataque do Nove-Caudas em Konoha para selar metade do demônio em seu filho, morrendo heroicamente no processo.",
      "Jiraiya e Tsunade apontaram que embora Naruto tenha fisicamente uma grande semelhança com Minato, sua personalidade é quase idêntica à de sua mãe. Ele parecia ser bem ciente de sua reputação, que inspirava terror em seus inimigos, mas apesar disso mostrou ser respeitoso com aqueles que viviam ao seu lado. Ele também não gostava de falar livremente sobre o passado dos outros, e foi dito ser uma pessoa muito descontraída e agradável. Quando questionou Orochimaru sobre como ele foi capaz de reencarná-lo junto aos Hokages antecessores, Minato se referiu dizendo \"Orochimaru-san \", uma maneira educada de se dirigir a alguém. Ele tinha profundos cuidados com sua amada esposa e seu filho, tornando-se muito nervoso e cuidadoso com os mesmos. Ele demonstrou isso no parto de Kushina, quando ficou bastante preocupado e nervoso por sua esposa sentir dores de parto, fora o fato de também ter chorado quando viu Naruto pela primeira vez. Minato também se importava profundamente com a aldeia e seus habitantes, dizendo que todos eles eram uma grande família. Ele também gostava de ler bastante, e teve um gosto especial em particular pelos trabalhos de Jiraiya.",
      "Apesar de não terem se conhecido previamente, a dinâmica entre Minato e o Segundo Hokage Tobirama Senju é única. Ambos os homens parecem ter um grande nível de respeito um pelo outro, especialmente por operarem em agir similarmente no campo de batalha em termos de pensamento. O fato de ambos serem usuários da Técnica do Deus Voador do Trovão também pareceu contribuir para isso, cada um elogiava o outro em termos de velocidade e pensamentos ágeis.",
      "Jiraiya comentou que Minato era uma pessoa sagaz, e não era um homem que fazia algo sem pensar ou sem razão.",
      "Após ser reencarnado por Orochimaru, responder Sasuke sobre o Massacre do Clã Uchiha e comentar sobre o significado de ser um shinobi, Minato confessou estar desapontado por não atender às expectativas do Terceiro sobre ele, pelo fato de seu reinado como Hokage ter sido curto por conta de seu sacrifício durante o ataque do Nove-Caudas. Ele também acreditava que a situação do clã Uchiha seria diferente caso estivesse vivo.",
      "Depois de se tornar Hokage, Minato começou a ter mais orgulho de si mesmo, referindo-se como \"ore\", que é uma forma arrogante de dizer \"eu\" ou \"mim\", em vez de usar \"watashi\", uma maneira mais formal de se referir a si mesmo. Ainda assim, isto não o tornou arrogante, ele ainda se referia aos outros com os honoríficos apropriados.",
      "Minato era um homem bastante alto, de pele clara, que em mais de uma ocasião foi comparado com Naruto em termos de aparência física; ambos têm, olhos azuis brilhantes e cabelos loiros espetados. Minato tinha suas mandíbulas cobertas por franjas de comprimento médio, emoldurando cada lado de seu rosto. De acordo com Jiraiya, Minato foi considerado muito bonito."
    ],
    "info": {
      "Estado": "Morto",
      "Sexo": "Masculino",
      "Aniversário": "25 de janeiro",
      "Idade": "Parte II: 24 anos",
      "Altura": "Parte I: 179.2 cm",
      "Peso": "Parte I: 66.1 kg",
      "Tipo Sanguíneo": "B",
      "Bijū": "Kurama (Parte Yin) (Transformações)",
      "Classificação": "Jinchūriki",
      "Ocupação": "Hokage",
      "Afiliação": "Konohagakure",
      "Times": "Time Jiraiya",
      "Patente Ninja": "Fase I: Kage",
      "Graduação (Genin)": "10"
    },
    "images": [
      "https://static.wikia.nocookie.net/naruto/images/6/63/Minato_Namikaze_%28Infobox_-_Parte_I%29.PNG/revision/latest?cb=20141127124321&path-prefix=pt-br",
      "https://static.wikia.nocookie.net/naruto/images/b/b4/Minato_Namikaze_%28Edo%29.png/revision/latest?cb=20140903043546&path-prefix=pt-br"
    ]
  },
  "Sasuke Uchiha": {
    "about": [
      "Sasuke Uchiha (うちはサスケ, Uchiha Sasuke) é um dos últimos membros sobreviventes do clã Uchiha de Konohagakure, além de ser a reencarnação atual de Indra. Ele se tornou um shinobi para que pudesse algum dia ficar forte o suficiente para se vingar contra o seu irmão mais velho, Itachi, que tinha massacrado todo o seu clã. Inicialmente, um membro do Time Kakashi de Konoha, Sasuke desertou da aldeia para obter poder com Orochimaru, e mais tarde também se juntou a Akatsuki, tornando-se um criminoso internacional no processo. Mais tarde, ele se torna uma peça fundamental para acabar com a Quarta Guerra Mundial Ninja, até ser finalmente redimido por seu rival, e também melhor amigo, Naruto Uzumaki. Sasuke decide voltar para Konoha, dedicando a sua vida para ajudar a proteger a vila e seus habitantes.",
      "Quando criança, Sasuke era muito gentil e amável com sua família e respeitoso com seu clã e professores. Ele tinha muito orgulho de ser filho de Fugaku e irmão de Itachi, tendo um forte desejo de imitá-los, desejando ter a aprovação e reconhecimento de seu pai.",
      "Durante seu tempo na Academia, Sasuke era um solitário, gastando mais tempo sozinho aperfeiçoando suas habilidades do que se socializando com os outros alunos, ignorando as várias garotas que eram atraídas por ele em favor da solidão. Quando introduzido pela primeira vez para o Time Kakashi, Sasuke mostrou grande indiferença para com os outros, sentindo que suas habilidades eram superiores com relação aos seus companheiros de equipe, vendo-os como nada mais do que um obstáculo para ele e seu próprio avanço. Apesar disso, tendo trabalhado com o Time Kakashi, Sasuke passou a se importar mais com a sua equipe e começou a vê-los como uma espécie de família, ficando disposto a arriscar sua vida para salvar as pessoas próximas a ele em várias ocasiões. Sasuke também tinha uma veia competitiva, por vezes, aceitando os desafios de Naruto apenas para mostrar que ele era o superior entre os dois. De acordo com Kakashi, Sasuke tem tanto um complexo de superioridade como um de inferioridade, como ele não está disposto a reconhecer quando alguém é mais forte do que ele, mas fica obcecado quando ele acredita que eles são. Sasuke deixou de lado sua rivalidade em relação a Naruto quando ele ficou certo de que ele era o melhor, porém, isso mudou após ele notar o rápido crescimento de Naruto após o último derrotar Gaara. Depois de uma curta batalha com Itachi, a quem derrotou Sasuke sem muito esforço, ele concluiu que o seu tempo em Konoha, cercado por seus amigos o fez ficar fraco e que Orochimaru e seu Selo Amaldiçoado do Céu lhe dariam o poder para conseguir sua vingança. Independentemente disso, Sasuke não chegou a descer ao nível que Itachi acreditava que ele iria, optando por não matar Naruto, seu melhor amigo, para ganhar o Mangekyō Sharingan, escolhendo conseguir poder através de seu próprio caminho.",
      "Após seu treinamento sob a tutela de Orochimaru em Otogakure por dois anos e meio, Sasuke se tornou uma pessoa fria e calculista, completamente dedicado em seu único desejo de matar Itachi, considerando que sua própria vida não importava para ele. Ao romper os laços que ele acreditava que o prendiam, Sasuke estava aparentemente disposto a matar Naruto apenas para provar um ponto com o quanto ele tinha mudado. Devido a suas novas habilidades, ele manteve seu hábito de subestimar os seus adversários, correndo para o combate sem uma compreensão clara das suas capacidades e sofrendo por isso, embora ele reconheça seus erros de vez em quando. Sasuke também tinha desenvolvido um forte senso de orgulho com relação ao seu clã; como seu evidente desdém por não-Uchiha possuírem o Sharingan. Apesar disso, Sasuke não deixou de formar laços com aqueles ao seu redor, formando uma nova equipe, a qual ele passou a vê-la de forma semelhante ao Time Kakashi e fazendo todo o possível para protegê-los.",
      "De acordo com Obito, Sasuke assumiu todo o ódio do clã Uchiha — um ideal que tem sido passado de geração em geração dentro do clã. Depois de descobrir a verdade sobre as ações de Itachi e o massacre do clã Uchiha, apesar do fato de que as ações dos Uchiha resultariam em um desastre para o mundo inteiro, incluindo o próprio clã, Sasuke jurou vingança contra toda a vila de Konoha por dar tal ordem para Itachi, desejando acabar com a aldeia e purificar o nome Uchiha. Inicialmente, Sasuke era, pelo menos disposto a não matar aqueles não relacionados com sua vingança, mas ao longo do tempo como o seu ódio aumentou, tais convicções foram deixadas de lado, tornando-se cruel e implacável. Após seu encontro com Naruto uma última vez antes da Quarta Guerra Mundial Shinobi, Sasuke jurou que iria matar Naruto em sua busca por vingança, levando-o a transplantar os olhos de Itachi para despertar o Mangekyō Sharingan Eterno.",
      "Durante a guerra, Sasuke se encontrou com um Itachi reencarnado e os dois trabalharam juntos para derrotar Kabuto Yakushi para libertar a Reencarnação do Mundo Impuro. Durante suas conversas, Sasuke confronta Itachi sobre suas decisões. Sasuke foi um dos poucos shinobi que não perderam a sua determinação na luta contra o Dez-Caudas, até mesmo repreendendo Naruto para fazê-lo. Independentemente disso, a devoção característica de Sasuke para a sua causa manteve-se inalterada, como ele ficou mais do que disposto a abandonar Kakashi e Sakura durante a ativação do Tsukuyomi Infinito, apenas salvando-os com o seu Susanoo porque ambos estavam com Naruto no momento. No entanto, ele não deixou de agradecer os outros por ajudá-lo, como ele agradeceu a Sakura e Obito quando ambos o resgataram de uma das dimensões de Kaguya.",
      "Depois da derrota de Kaguya, as desconfianças de Sakura e Sai com relação a Sasuke são confirmadas, como a cooperação de Sasuke com as Forças Aliadas foi apenas um meio para um fim; a remoção de tantas pessoas quanto possível que poderiam ficar no caminho de seus próprios planos de liderar o mundo através de uma revolução para acabar com os sistemas shinobi atuais, inclusive planejando matar todos os Kage atuais e os Bijū. Tendo chegado a um acordo e aceitando os esforços de Itachi para proteger a aldeia, enquanto a marca como um vilão, Sasuke passou a acreditar que, para unificar o mundo, deve-se voluntariamente suportar o ódio de todos ao seu redor e ficar separado do resto do mundo, vendo isso como a definição correta de ser \"Hokage\". Para isso, ele pretende inflamar as chamas do ódio de todas as aldeias e direcioná-las sobre ele, tornando-se o vilão ao qual todos desprezam. Além disso, acreditando firmemente em começar de novo em todos os aspectos, Sasuke deseja romper todos os laços de seu passado e presente, até mesmo matar Naruto, a quem Sasuke reconheceu como o amigo mais próximo que ele já teve. Crescendo tão orgulhoso de seu poder adquirido, Sasuke passou a acreditar que ele poderia ser o ser vivo mais forte e estava convencido de que seu poder acabaria lhe concedendo a imortalidade para continuar a sua meta por toda a eternidade."
    ],
    "info": {
      "Sexo": "Masculino",
      "Aniversário": "23 de julho",
      "Idade": "Parte I: 12-13 anos",
      "Altura": "Parte I: 150.8 cm - 153.2 cm",
      "Peso": "Parte I: 42.2 kg - 43.5 kg",
      "Tipo Sanguíneo": "AB",
      "Clã": "Clã Uchiha",
      "Kekkei Genkai": "Sharingan",
      "Classificação": "Nukenin (anterior)",
      "Ocupação": "Líder do Clã Uchiha",
      "Afiliação": "Konohagakure",
      "Times": "Time Kakashi",
      "Patente Ninja": "Fase I:  Genin",
      "Registro Ninja": "012606",
      "Graduação (Genin)": "12"
    },
    "images": [
      "https://static.wikia.nocookie.net/naruto/images/e/e7/Sasuke_epi_319.png/revision/latest?cb=20130629210647&path-prefix=pt-br",
      "https://static.wikia.nocookie.net/naruto/images/f/ff/Sasuke.png/revision/latest?cb=20160521001059&path-prefix=pt-br",
      "https://static.wikia.nocookie.net/naruto/images/2/2c/Uchiha_Sasuke_%28Parte_IV%29.png/revision/latest?cb=20160731233945&path-prefix=pt-br"
    ]
  },
  "Sakura Haruno": {
    "about": [
      "Sakura Uchiha (うちはサクラ, Uchiha Sakura; batizada Haruno (春野) inicialmente) é uma kunoichi de nível jōnin do clã Uchiha, após se casar, de Konohagakure. Ela é designada como um membro do Time Kakashi, mas rapidamente encontra-se mal preparada para os deveres de um ninja e as complicações das vidas de seus companheiros de equipe. Treinando sob a tutela de sua mestra, Tsunade, ela se torna uma kunoichi mais forte e uma excelente ninja médica, sendo capaz de enfrentar os desafios de uma vida como um ninja, bem como ajudar e proteger seus amigos e entes queridos quando eles precisarem dela. Anos após a Quarta Guerra Shinobi, ela forma sua própria família com Sasuke Uchiha.",
      "Quando criança, Sakura era insegura e altamente auto-consciente sobre sua testa grande; cobrindo-a com sua franja. Isso aconteceu até o momento em que ela conheceu Ino, a quem a defendeu dos valentões e se tornaram amigas, fazendo ela se tornar mais auto-confiante. No entanto, apesar de Sakura ser considerada uma estudante exemplar por sua inteligência escolástica na Academia, ela se tornou narcisista, como ela se interessava mais com sua aparência e Sasuke ao invés de praticar suas habilidades ninja. Por causa disso, ela passou a ver os avanços de Naruto Uzumaki em tentar ganhar a sua atenção como cansativas, chamando-o de infantil e tolo, citando a falta de uma família como sendo a razão pela qual ele era considerado um incômodo para todos na aldeia, não percebendo que Naruto tinha sentimentos por ela também. Sasuke apontou que isso é porque Sakura nunca experimentou a perda em sua vida e, portanto, não poderia entender a si mesmo ou Naruto, Sakura então passou a olhar as coisas do ponto de vista de Naruto em um esforço para entender seus companheiros de equipe. Ao longo do tempo, Sakura desenvolveu uma amizade mútua com seus companheiros de equipe ao longo da série.",
      "Na Parte II, Sakura amadureceu e se tornou muito menos egocêntrica, embora ela ainda mantenha alguns hábitos, especialmente com Naruto. Depois de descobrir as dificuldades as quais Naruto possuí, com o Bijū Kurama, a Akatsuki e sua promessa para ela em trazer Sasuke de volta para a aldeia, Sakura se tornou protetora de Naruto, na esperança de ajudar ele a superar esses obstáculos. Devido ao tempo que passaram juntos como Time 7, eles desenvolveram uma amizade profunda que espelha aos seus mestres Sannin, embora os sentimentos de Naruto para Sakura ainda não sejam correspondidos devido a ela ainda estar apaixonada por Sasuke.",
      "Em seu núcleo, Sakura é compassiva, determinada e corajosa, sendo disposta a se sacrificar e combater aqueles que ela sabe que são superiores a ela para defender seu time.",
      "Desde o início, Sakura tinha uma paixão profunda por Sasuke, enraizada na sua boa aparência, astúcia, atitude legal e talentos prodigiosos. Como se observa, no início de sua carreira, ela estava mais focada em um relacionamento com Sasuke do que melhorar as suas habilidades. Quando Sasuke desertou Sakura fez tudo que podia para impedi-lo de sair, revelando seu amor por ele e até mesmo se oferecendo para se juntar a ele. Apesar de lhe agradecer e soar como grato, Sasuke deixa Sakura inconsciente e parte da aldeia. No final, ela se viu incapaz de matar Sasuke. Ao ver a determinação de Naruto em trazer Sasuke de volta, não importando o custo, Sakura decidiu que ela iria colocar sua fé em ambos.",
      "Durante a guerra, quando Sasuke voltou para lutar ao lado da Aliança, Sakura não acreditou que Sasuke poderia ser confiável, o que foi confirmado quando ele revelou sua intenção de começar uma revolução. Em última análise, Sakura tentou apelar para Sasuke, proclamando seu amor por ele, mais uma vez, apenas para ser silenciada por um genjutsu. Quando Sasuke rejeita seu desejo de romance, Kakashi o repreende, dizendo que Sakura o ama tanto que ela quer salvar Sasuke do seu caminho escuro. Finalmente, depois do confronto final entre Naruto e Sasuke, o último tendo sido redimido, pede desculpas a Sakura por tudo que ele tinha feito ela passar. Apesar de sua ligeira hesitação, ela o perdoa, entre lágrimas. Sakura perdoou todas as coisas que Sasuke fez, inclusive a sua tentativa de matá-la, indicando sua maturidade e provando o seu amor incondicional por ele. Sakura tem sido mostrada ser bastante inflexível; por exemplo, depois de se casar com Sasuke e saber que ela estava grávida, ela se recusou a deixar seu lado enquanto ele estava viajando. Apesar de ficar separada de seu marido por anos, ela fica contente com seu casamento e família, como ela sabe que Sasuke ama Sarada e ela, e que ele vai voltar para casa uma vez que sua missão estiver concluída.",
      "Depois de se tornar uma mãe, Sakura mostra ser muito amorosa e carinhosa com sua filha, Sarada, a qual não tem nenhum problema em compartilhar seus sentimentos sobre Boruto e seu pai. Isso não significa que ela não fica com raiva de sua filha, como quando Sarada questiona a validade de seu casamento ela desfere um soco no chão. Depois de ver que sua filha reagiu com tristeza em vez de raiva, ela pede desculpas e lhe assegura que seu pai voltará para casa em breve. Sakura também parece ser muito protetora com sua família, como visto quando depois que ela acordou, ela foi imediatamente atrás de Sarada e como ela ficou furiosa quando Shin Uchiha tentou matar seu marido e sua filha. Durante o tempo em que Sasuke estava longe, Sakura adotou o hábito de Itachi, cutucando Sarada na testa e dizendo \"talvez na próxima vez\", como Itachi sempre fazia com Sasuke. Ela também tem profundo orgulho por sua filha e não hesitou em aplaudir ruidosamente Sarada a partir do público durante os Exames Chūnin, mesmo que ela tenha envergonhado Sarada. Ela também demonstra lealdade para com Sasuke. Isto foi demonstrado quando ela fingiu ser uma refém impotente para enganar Shin a revelar informações sobre seus planos em nome de Sasuke antes de tomar a decisão de acabar com ele. Sakura, bem como Naruto, mantém alguns dos seus traços infantis, como visto quando Sasuke ignorou a iniciativa para um beijo e ela ficou deprimida assim como ela fazia quando genin."
    ],
    "info": {
      "Sexo": "Feminino",
      "Aniversário": "28 de março",
      "Idade": "Parte I: 12-13 anos",
      "Altura": "Parte I: 148.5 cm - 150.1 cm",
      "Peso": "Parte I: 35.4 kg - 35.9 kg",
      "Tipo Sanguíneo": "O",
      "Clã": "Clã Uchiha",
      "Classificação": "Ninja Médico",
      "Ocupação": "Fundadora e Diretora da Clínica Infantil de Assistência Médica Mental do Hospital de Konoha[11]",
      "Afiliação": "Konohagakure",
      "Times": "Time Kakashi",
      "Patente Ninja": "Fase I:  Genin",
      "Registro Ninja": "012601",
      "Graduação (Genin)": "12",
      "Graduação (Chūnin)": "14"
    },
    "images": [
      "https://static.wikia.nocookie.net/naruto/images/c/cf/Sakura_%28Naruto_Cl%C3%A1ssico%29.png/revision/latest?cb=20180211141243&path-prefix=pt-br",
      "https://static.wikia.nocookie.net/naruto/images/5/5c/Sakura_na_Parte_II.png/revision/latest?cb=20140609170219&path-prefix=pt-br",
      "https://static.wikia.nocookie.net/naruto/images/4/4e/Sakura_Uchiha.png/revision/latest?cb=20180508173625&path-prefix=pt-br"
    ]
  },
  "Kakashi Hatake": {
    "about": [
      "Kakashi Hatake (はたけカカシ, Hatake Kakashi) é um shinobi de Konohagakure. Ele recebeu um Sharingan de seu ex-companheiro de equipe, Obito Uchiha, quando era mais jovem, fazendo-o ser conhecido como Kakashi o Ninja Copiador (コピー忍者のカカシ, Kopī Ninja no Kakashi) e Kakashi do Sharingan (写輪眼のカカシ, Sharingan no Kakashi). Seu prodigioso talento, habilidades e destreza com o Sharingan fizeram dele um dos mais capazes ninjas da aldeia, sendo reconhecido em todo o mundo ninja. Ele acaba sendo nomeado como líder do Time Kakashi, onde ele usa seus anos de experiência para treinar seus alunos para se tornarem ninjas habilidosos de suas próprias maneiras. Logo um tempo após a Quarta Guerra Mundial Shinobi, Kakashi ocupa o cargo público como o Sexto Hokage (六代目火影, Rokudaime Hokage; Literalmente significa \"Sexta Sombra do Fogo\") antes de eventualmente se aposentar e passá-lo ao seu pupilo Naruto Uzumaki.",
      "Desde sua infância, Kakashi era muito independente e autoconfiante, às vezes até parecendo ser arrogante e condescendente; Apesar disso, Kakashi era muito perceptivo e intuitivo, percebendo rapidamente a situação em que se encontrava. Devido a isso, ele era bem ciente de seus limites e era disposto a trabalhar com os outros para realizar suas tarefas. Kakashi se tornou mais severo e sério, após a morte de seu pai, seguindo todas as regras ao pé da letra e repreendendo qualquer um que desobedecesse elas, como seu companheiro de equipe, Obito Uchiha. Ele também era muito indiferente e apático para com os outros, especialmente com seu companheiro de equipe Obito, que estava sempre atrasado para as suas missões e inventava grandes desculpas. Isto fazia Obito se sentir ressentido por Kakashi; a dinâmica entre os dois mudaria logo após Obito ser mortalmente ferido durante a Terceira Guerra Mundial Shinobi, com Kakashi e Obito se tornando amigos mais próximos depois que Rin foi sequestrada.",
      "A suposta morte de Obito teve um enorme impacto sobre a personalidade de Kakashi, adotando muitos dos maneirismos alegres de seu amigo, como ter maior preocupação com seus companheiros de equipe e alunos sobre a conclusão com êxito de uma missão, bem como acreditar que o trabalho em equipe é essencial para o sucesso geral como uma equipe. Ele também desenvolveu uma personalidade um pouco despreocupada e se atrasa regularmente para os compromissos, dando desculpas óbvias assim como seu companheiro Obito fazia. No entanto, Kakashi ainda é tão apático como ele era durante a sua juventude, muitas vezes falando abertamente sobre temas sensíveis.",
      "No anime, após a morte de Rin por suas próprias mãos, Kakashi desenvolveu TEPT, tendo inúmeros pesadelos da morte de Rin e acordando para lavar a mão que a matou. Kakashi também, ocasionalmente, ignorava seus colegas de classe, especialmente Guy, sempre que passava por eles. Pensando que iria aliviar sua dor, Minato pede para Kakashi se juntar a Anbu. Durante seu tempo na ANBU, no entanto, Kakashi ganhou uma reputação de sangue frio, sem mostrar piedade ao matar um shinobi de Iwa em vez de poupar sua vida para interrogá-lo. Sua amargura por ter perdido Rin também fez Kakashi ser mais fácil para Danzō manipulá-lo, fazendo ele trair o Terceiro Hokage, alegando que ele foi o responsável pela morte de sua equipe.",
      "Apesar de que a sua infância foi repleta de numerosos desastres, com seus entes queridos ficando longe dele, sendo um deles a morte de Rin por suas próprias mãos, Kakashi encontrou consolo em seus amigos de infância: Guy, Asuma e Kurenai, seus alunos e, geralmente, com todos em Konoha, em menor grau. Sua devoção a seus amigos e ao resto de Konoha foram a motivação para ele aperfeiçoar o Chidori, criando sua versão mais forte o Corte Relâmpago. Após começar a treinar o Time 7, Kakashi começa a tomar um interesse especial no desenvolvimento de seus alunos, especialmente no caso de Naruto e Sasuke, cuja rivalidade o lembra de sua relação com Obito. Como Hiruzen, Kakashi ama todos os seus alunos profundamente, ao ponto onde ele adia uma missão a fim de impedir que Naruto e Sasuke se matassem. Apesar de Sasuke se aliar com Orochimaru, Kakashi compartilha a esperança de que Naruto pode salvá-lo. No entanto, Kakashi ficou perturbado por ter de matar Sasuke depois que ele se tornou um inimigo de Konoha, especialmente porque ele sentiu que eram seus defeitos como o professor que fizeram isso recair sobre Sasuke, Naruto e temporariamente Sakura, mas depois ele descarta furiosamente sua hesitação, após Sasuke tentar matar Sakura sem hesitar. No entanto, após Naruto finalmente conseguir fazer com que Sasuke se libertasse de sua ira e escuridão, Kakashi não deixou de sorrir enquanto observava seus alunos se reunirem novamente depois de tantos anos de testes e tribulações. Ele até usou sua influência como o novo Sexto Hokage para perdoar Sasuke de seus crimes por seu envolvimento em acabar com a guerra.",
      "Kakashi tem uma atitude solitária. Sua atitude calma e isolada tem sido chamada de \"legal e da moda\" muitas vezes por Might Guy. Apesar de sua reputação e talento ninja crescer cada vez mais, Kakashi não tem mostrado sinais de arrogância, e é bastante modesto sobre suas habilidades, como mostrado quando ele prontamente elogia os outros pelo avanço em suas habilidades de combate e afirmando em mais de uma ocasião que Naruto havia ultrapassado seu poder. Quando ele foi sugerido por muitos para se tornar Hokage, Kakashi admitiu abertamente que era indigno, mas aceitou o cargo por causa do bem-estar da aldeia. Sua atitude calma naturalmente é usada para sua vantagem na batalha, tornando mais fácil para ele manter a compostura e manter o foco sobre a situação em que se encontra, além de observar tudo ao seu redor. Como resultado, ele pode se ajustar rapidamente a qualquer situação para tomar decisões perspicazes e pensadas, permitindo que ele fique passos à frente de seus adversários.",
      "Apesar de seu comportamento calmo, Kakashi tem um lado emocional, como ele comentou durante a Quarta Guerra Mundial Shinobi, dizendo que é muito difícil tirá-lo do sério, mas quando ele fica, ele ataca os inimigos com uma fúria implacável."
    ],
    "info": {
      "Sexo": "Masculino",
      "Aniversário": "15 de setembro",
      "Idade": "Parte I: 26-27 anos",
      "Altura": "Parte I: 181 cm",
      "Peso": "Parte I: 67.5 kg",
      "Tipo Sanguíneo": "O",
      "Clã": "Clã Hatake",
      "Kekkei Genkai": "Sharingan (anterior)",
      "Ocupação": "Capitão da Anbu (Anterior)",
      "Afiliação": "Konohagakure",
      "Times": "Time Minato",
      "Patente Ninja": "Fase I:  Jōnin",
      "Registro Ninja": "009720",
      "Graduação (Genin)": "5",
      "Graduação (Chūnin)": "6"
    },
    "images": [
      "https://static.wikia.nocookie.net/naruto/images/b/b1/Kakashi_Hatake%2C_o_Hokage.PNG/revision/latest?cb=20140902154722&path-prefix=pt-br",
      "https://static.wikia.nocookie.net/naruto/images/e/ef/Kakashi_%28Boruto%29.png/revision/latest?cb=20181122180026&path-prefix=pt-br"
    ]
  },
  "Hashirama Senju": {
    "about": [
      "Hashirama Senju (千手柱間, Senju Hashirama) foi o Primeiro Hokage de Konohagakure (初代火影, Shodai Hokage, Literalmente significa \"Primeira Sombra do Fogo\"). Ele era famoso durante sua vida como o Deus Shinobi (忍の神, Shinobi no Kami) por seu incomparável talento ninja. Apesar disso, Hashirama só queria a paz, e para esse fim ele fundou Konoha com seu amigo de infância e rival Madara Uchiha. Embora ele não tenha sido capaz de alcançar a paz durante a sua vida, seu legado continuou a viver, moldando a aldeia há décadas após sua morte.",
      "Hashirama era uma pessoa gentil e atenciosa com um profundo senso de lealdade, grande carisma e habilidade em negociação. Ele via o povo de Konoha como parte de sua própria família, e seu legado teve uma raiz firme na aldeia. Ele também mostrou ser um homem muito sábio e perspicaz, enquanto passava grandes ensinamentos para Hiruzen. Foi ele quem primeiro acreditou que todos os shinobi de Konoha devem mostrar a verdadeira lealdade entre si, e que um Kage deve estar disposto a colocar sua vida em risco para proteger sua aldeia para servir de exemplo para todos os outros. Essa sua crença é conhecida como \"Vontade do Fogo\". Hashirama também parecia ter um senso de honra em relação a seus adversários e, apesar de sua rivalidade, possuía um grande respeito por Madara Uchiha, e considerou-o um amigo, até mesmo um irmão.",
      "Hashirama era um idealista por natureza, e sempre olhou para a perspectiva de paz e de um tempo em que as crianças não seriam enviadas para a guerra por causa disso.",
      "Contrastando um pouco com as expectativas que as pessoas têm construído para o homem conhecido como um dos shinobi mais poderosos que já viveram,",
      "Hashirama também é propenso ao mau humor, sempre que alguém grita, aborda ou não concorda com alguma coisa com ele. No entanto, ele não fica de mau humor por muito tempo, voltando em um instante ao seu carácter regular de alto astral.",
      "Na batalha, Hashirama é calmo e sereno, mostrando grandes instintos e habilidades de liderança como ex-Hokage e líder do clã Senju, proporcionando assistência a toda a Aliança Shinobi com seus clones de madeira, bem como motivar todos para enfrentarem o Jūbi sem medo, apesar de seu poder esmagador.",
      "Hashirama era um homem alto, de pele bronzeada, olhos escuros e cabelos pretos que desciam até sua cintura com uma franja que se separava no centro que emoldurava seu rosto, embora às vezes ele usa-se penteados para trás com dois laços simples que davam enquadramento ao seu rosto. Na maioria dos casos, seu traje tomava a forma do vestido shinobi padrão de sua época, que consistia em uma armadura vermelha escura tradicional — semelhante ao dos samurai — usado sobre um terno preto simples. Esta armadura foi construída a partir de numerosas placas de metal, formando várias proteções ao longo de seu corpo, em especial: o peito, ombros, coxas e antebraços. Cada gola de seus guardas ombro trazia o símbolo Senju estampado nelas."
    ],
    "info": {
      "Estado": "Morto",
      "Sexo": "Masculino",
      "Aniversário": "23 de Outubro",
      "Altura": "Parte I: 185.1 cm",
      "Peso": "Parte I: 74 kg",
      "Clã": "Clã Senju",
      "Kekkei Genkai": "Liberação de Madeira",
      "Classificação": "Sennin",
      "Ocupação": "Líder do clã Senju",
      "Afiliação": "Konohagakure"
    },
    "images": [
      "https://static.wikia.nocookie.net/naruto/images/7/7d/Hashirama_Cl%C3%A1ssico.png/revision/latest?cb=20130731180103&path-prefix=pt-br",
      "https://static.wikia.nocookie.net/naruto/images/1/1f/Hashirama_Senju_%28Guerra%29.png/revision/latest?cb=20140612194047&path-prefix=pt-br",
      "https://static.wikia.nocookie.net/naruto/images/b/b0/Shodai_Tsuchi_-_Sugest%C3%A3o_do_Rafael_-_II.jpg/revision/latest?cb=20141106201823&path-prefix=pt-br"
    ]
  },
  "Tobirama Senju": {
    "about": [
      "Tobirama Senju (千手扉間, Senju Tobirama) foi o Segundo Hokage (二代目火影, Nidaime Hokage; Literalmente significa \"Segunda Sombra do Fogo\") de Konohagakure. Ele vem do clã Senju, que, junto com o clã Uchiha, fundaram a primeira vila shinobi. Tobirama também viria a ser o líder do seu próprio time. Antes de herdar a posição de Hokage, ele serviu como conselheiro de seu irmão ajudando-o com medidas políticas e sociais.",
      "Desde criança, Tobirama era um indivíduo estoico e composto com uma abordagem lógica e pragmática para a vida. Ele era muito obediente ao seu pai, bem como leal para com seu clã, mas não o suficiente para concordar com todas as suas decisões, como ele foi capaz de imaginar uma maneira racional para os clãs shinobi alcançarem a paz.",
      "Mais certinho do que seu exuberante e idealista irmão mais velho, Tobirama é um realista por natureza, isto é exibido durante a Primeira Guerra Mundial Shinobi, quando ele e seu pequeno batalhão são cercados pela Força Kinkaku, Tobirama escolheu a única saída para seus subordinados e agiu em conformidade.",
      "Entre ele e seu irmão, Tobirama tinha a personalidade mais firme, diretiva e autoritária, e que muitas vezes o lavava a levar muito tempo para conversar com seu irmão mais velho por causa de suas personalidades diferentes, fazendo ele ficar de mau humor e obrigar seu irmão a obedecer as suas ordens.",
      "Apesar de não se conhecerem há muito tempo, a dinâmica entre Tobirama e o Quarto Hokage Minato Namikaze é única. Ambos os homens parecem ter um grande nível de respeito um pelo outro, especialmente pelo fato de que ambos parecem operar da mesma forma no campo de batalha em termos de pensamento. O fato de que ambos são usuários da Técnica do Deus Voador do Trovão também parece contribuir para isso, já que cada um elogiou a velocidade um do outro e o seu rápido pensamento.",
      "Tobirama era um homem alto, de pele clara, com cabelo branco desgrenhado e olhos de cor escura — descritos como vermelhos no anime — e três marcas vermelhas no rosto — duas sob os olhos e uma no queixo. Na maioria dos casos, ele usava o traje de guerra da família durante sua vida: armadura estampada com o símbolo Senju usada sobre um traje preto simples, com gola de pele distintiva. Esta armadura foi construída a partir de numerosas placas de metal, formadas em várias proteções ao longo de seu corpo, em especial: peito, cintura, ombros e braços. Esta roupa foi acompanhada por sandálias e um happuri com o símbolo de Konoha gravado, no lugar do mais tradicional protetor de testa. Como uma criança, seu protetor de testa tinha o emblema do clã Senju. Sob sua armadura de ombro ele usava duas faixas em cada braço. Quando reencarnado pela segunda vez, ele apresentou o mesmo traje, porém com algumas ranhuras, tanto no traje como em sua pele, além de esclera preta.",
      "Fora deste equipamento, Tobirama usava um quimono simples, de manga curta, camisa azul com armadura de malha por baixo e mantinha fechado por uma faixa amarela pálida, assim como calças azuis e uma pulseira da sorte em sua mão esquerda. Em sua juventude, ele usava um par de calças listradas e uma camisa que deixavam seu braços expostos. Ele também não tinha as marcas em seu rosto."
    ],
    "info": {
      "Estado": "Morto",
      "Sexo": "Masculino",
      "Aniversário": "19 de fevereiro",
      "Altura": "Parte II: 182.3 cm",
      "Peso": "Parte II: 70.5 kg",
      "Clã": "Clã Senju",
      "Classificação": "Tipo Sensor",
      "Ocupação": "Hokage",
      "Afiliação": "Konohagakure",
      "Times": "Time Tobirama",
      "Patente Ninja": "Fase I: Kage"
    },
    "images": [
      "https://static.wikia.nocookie.net/naruto/images/9/97/Tobirama_Senju.jpg/revision/latest?cb=20140928164515&path-prefix=pt-br",
      "https://static.wikia.nocookie.net/naruto/images/1/11/Tobirama-Edo.png/revision/latest?cb=20140625013945&path-prefix=pt-br",
      "https://static.wikia.nocookie.net/naruto/images/c/c0/Tobirama_Senju_%28HD%29.png/revision/latest?cb=20160220124906&path-prefix=pt-br"
    ]
  },
  "Madara Uchiha": {
    "about": [
      "Madara Uchiha (うちはマダラ, Uchiha Madara) foi um lendário líder do clã Uchiha. Ele fundou Konohagakure ao lado de seu rival, Hashirama Senju, com a intenção de iniciar uma era de paz. Quando os dois não conseguiram concordar em como conseguir a paz, eles lutaram pelo controle da aldeia, um conflito que terminou na morte de Madara. Ele reescreveu sua morte e se escondeu para trabalhar em seus planos para acabar com os conflitos mundiais. Incapaz de conclui-los em sua fase de vida natural, ele confiou o seu conhecimento e planos para Obito Uchiha, pouco antes de sua morte real. Anos mais tarde, Madara foi revivido, e viu seus planos serem frustrados antes de morrer uma última vez.",
      "A infância de Madara foi um produto dos tempos em que viveu: um período de lutas constantes, que o tornaram um perfeccionista, seguro de si mesmo, confiante e orgulhoso de suas habilidades e talentos. Devido a ter passado muito tempo em sua infância interagindo com uma pessoa de fora, Madara não tinha sido vítima da Maldição de Ódio, tanto que ele até mesmo chegou a considerar aceitar a trégua de Hashirama, porém, desistiu devido a Izuna.",
      "Madara mudou após a morte de Izuna. Ele se tornou amargo com os Senju, principalmente com relação a Hashirama, que ainda tinha um irmão. Ele abraçou a Maldição de Ódio de seu clã, optando por morrer por vingança, em vez de compromisso ou perdão. Embora ele brevemente tentou deixar de lado sua dor e tentar substituir Izuna com a família coletiva de Konoha, ele nunca conseguiu se livrar da sensação de que ele estava traindo a memória de Izuna. O isolamento cada vez maior de si mesmo e dos outros Uchiha com relação a política da aldeia em última análise, o convenceu a isso, levando-o a quebrar plenamente quaisquer outros laços.",
      "Durante seu tempo como um shinobi de Konoha, Madara fez o que achava que era o melhor para os interesses da aldeia. Ao contrário da influência mais compassivo de Hashirama, Madara usava um método mais impiedoso e cruel, muito parecido com o qual Sasuke Uchiha fez depois de descobrir a verdade sobre Itachi. Isto foi demonstrado quando os shinobi de Iwagakure só tinham um propósito, desde que eles juraram lealdade inabalável para Konoha e mesmo que eles aceitassem o tratado, Madara exigiu que eles deveriam obedecer a vila de Konoha, em primeiro lugar.",
      "Madara ama a luta acima de tudo: das vistas, os sons e até mesmo o gosto de seu próprio sangue.",
      "A única exceção de Madara é Hashirama. Seus anos de rivalidade fizeram Madara ter sentimentos de respeito e ressentimento para com Hashirama. Ele odeia ouvir o nome de Hashirama e ao mesmo tempo fica animado com a perspectiva de lutar com ele.",
      "Em seus últimos anos, depois que ele desenvolveu seu Plano Olho da Lua, Madara se tornou uma pessoa pessimista sobre a natureza humana, acreditando que o ciclo de batalha é inevitável. Para o atual, a realidade \"sem valor\", acredita ele, foi construída sobre a ideia de ganhar e perder. Por esta razão, ele estava profundamente comprometido com seu plano, tanto que ele iria terminar prematuramente uma luta que ele estava gostando ou matar qualquer ameaça, até mesmo os seus próprios companheiros de clã, para garantir seu sucesso. O último fracasso de seu plano deixou Madara profundamente deprimido, mas o levou a ver os seus erros: se libertando de sua Maldição de Ódio, lamentando os erros que ele tinha feito e admitindo a superioridade dos métodos de Hashirama para a paz. Ele e Hashirama foram, assim, capazes de conciliar-se momentos antes de sua morte."
    ],
    "info": {
      "Estado": "Morto",
      "Sexo": "Masculino",
      "Aniversário": "24 de Dezembro",
      "Altura": "Parte II: 179 cm",
      "Peso": "Parte II: 71.3 kg",
      "Tipo Sanguíneo": "O",
      "Clã": "Clã Uchiha",
      "Kekkei Mōra": "Rinne Sharingan",
      "Kekkei Genkai": "Sharingan",
      "Bijū": "Dez-Caudas (Transformações)",
      "Classificação": "Jinchūriki",
      "Ocupação": "Co-fundador de Konohagakure",
      "Afiliação": "Konohagakure",
      "Parceiro": "Obito Uchiha"
    },
    "images": [
      "https://static.wikia.nocookie.net/naruto/images/6/69/Madara_Uchiha_Edo.png/revision/latest?cb=20130725191155&path-prefix=pt-br",
      "https://static.wikia.nocookie.net/naruto/images/c/c3/Madara_Uchiha_%28Passado%29.png/revision/latest?cb=20150707135022&path-prefix=pt-br"
    ]
  },
  "Maito Gai": {
    "about": [
      "Might Guy (マイト・ガイ, Maito Gai) é um jōnin de Konohagakure. Um mestre no taijutsu, ele leva e passa sua sabedoria para os membros do Time Guy.",
      "Conhecido por suas sobrancelhas grossas, macacão verde e corte de cabelo tigela brilhante, Guy, muitas vezes refere-se a si mesmo como \"Fera Sublime Verde de Konoha\" (木ノ葉の気高き碧い 猛獣, Konoha no Kedakaki Aoi Moju). Ele tem muitas manias exclusivas dele na série que se destinam a ser visto como cafona e antiquado, uma referência comum de clichês de \"juventude\" (青春, seishun). Guy também é conhecido por falar sobre \"Chamas da Juventude\".",
      "Guy tem problemas para se lembrar dos rostos das pessoas que ele não interage com frequência, isso é melhor visto em suas lutas com Kisame Hoshigaki, sua luta com os Três Irmãos Ryūdōin e até mesmo enquanto ele luta com Madara Uchiha. Obito mencionou que isso é um traço de Guy. Foi explicado que isto pode ser devido ao fato de que Guy sempre olha para o futuro, em vez de insistir no passado.",
      "Guy é mais conhecido por sua \"nice guy pose\", que consiste em levantar um polegar para cima, piscando e sorrindo com os dentes tão brancos que dão o proverbial \"ping\". Esta ação é frequentemente utilizada por Guy e Lee, respectivamente, para indicar o compromisso com uma declaração que tinham acabado de fazer, a sua forma mais elevada de uma promessa. Sugere-se que Guy teve a ideia para a pose \"nice guy\" de sua batalha com Obito Uchiha durante o Exame Chūnin. Apesar dessas manias estranhas, Guy tem mostrado ser capaz de ser sério, implacável e decisivo com o sucesso de uma missão, se necessário, como visto durante a invasão de Konoha e suas batalhas com Kisame Hoshigaki. Apesar de sua natureza aparentemente alheia ao tempo, Guy pode ser muito atento para a situação em que se encontra. Durante uma missão de diplomacia, Guy foi capaz de deduzir o seu verdadeiro propósito como um teste de lealdade, um feito que surpreendeu o jovem Itachi Uchiha. Ele é conhecido a ser bastante assustador se mudando para o \"feroz\", mas muito confiável.",
      "Guy está em bons termos com todos os seus alunos, mas tem especial interesse em Rock Lee, que lembra Guy de si mesmo quando era mais jovem, em que ambos eram considerados como perdedores e tiveram tudo para ganhar através do trabalho duro. Como tal, Guy coloca muito mais interesse na formação de Lee do que Tenten ou Neji, continuando a treinar Lee muito tempo depois que os outros têm acabado. Devido a isso, e devido ao desejo irresistível de Lee para dominar a arte do taijutsu, os dois desenvolveram uma relação de pai e filho que levou Guy a ensinar à Lee uma série de técnicas perigosas e proibidas, dando a condição de que Lee só pode usá-los em circunstâncias específicas. Embora Guy saiba dos perigos que o ensino das técnicas de Lee implica, os desejos de Guy para Lee ser capaz de provar a si mesmo para ser um ninja esplêndido, e, como tal, faz vista grossa para as repercussões. No entanto, globalmente, Guy é um professor muito atencioso e dedicado, que faz tudo ao seu alcance para se certificar de que todos os três de seus alunos recebam a instrução adequada em seus próprios campos específicos.",
      "Guy, e, por extensão Lee, vive a sua vida por sua filosofia de \"Minhas Regras\", que envolve a definição de metas mais rígidas para falha assim que algo de bom vem dela. Por exemplo, ele prometeu andar 500 voltas em torno de Konoha com suas mãos, se ele perdesse um simples jogo de pedra, papel e tesoura com Kakashi, e passou a fazê-lo depois de perder, mesmo que as pessoas parassem de prestar atenção eventualmente. A vontade de Lee para treinar da mesma maneira como Guy parece ter o levado a superar a resistência de seu mestre, como até o final da Parte I, Guy tem dificuldade em manter-se com Lee, lamentando que ele não é tão jovem quanto ele já foi. Durante sua infância, a personalidade de Guy era completamente o oposto; ele sofria muita insegurança com relação a sua falta de talento natural e ficava muito preocupado com a opinião dos outros.",
      "A relação de Guy de professor-aluno com Lee também traz atributos distintos, como quando Guy dá um soco em Lee por ele cometer uma leve infração de uma regra. Depois de Guy atribuir a Lee uma tarefa árdua de treinamento como punição, destinado a recuperar o foco e a disciplina de Lee, os dois começam, então, a chorar e se abraçam carinhosamente, logo após se arrependendo por dar o golpe forte em Lee. Guy muitas vezes tenta agir de uma maneira similar para com seus outros dois estudantes, embora Tenten evite ela é mais disposta a tomar parte em suas tarefas do que Neji que é mais reservado."
    ],
    "info": {
      "Sexo": "Masculino",
      "Aniversário": "1 de Janeiro",
      "Idade": "Parte I: 26-27",
      "Altura": "Parte I: 184",
      "Peso": "Parte I: 76",
      "Tipo Sanguíneo": "B",
      "Afiliação": "Konohagakure",
      "Times": "Time Chōza",
      "Patente Ninja": "Fase I:  Jōnin",
      "Registro Ninja": "010252",
      "Graduação (Genin)": "7 anos",
      "Graduação (Chūnin)": "11 anos"
    },
    "images": [
      "https://static.wikia.nocookie.net/naruto/images/3/31/Might_Guy.png/revision/latest?cb=20200228191727&path-prefix=pt-br",
      "https://static.wikia.nocookie.net/naruto/images/a/a5/Might_Guy_%28Boruto%29.png/revision/latest?cb=20181104222718&path-prefix=pt-br"
    ]
  },
  "Hinata Hyuga": {
    "about": [
      "Hinata Uzumaki (うずまきヒナタ, Uzumaki Hinata, batizada Hyūga (日向)) é a maior personagem de assistência da série. Ela é um membro dos clãs Hyūga e Uzumaki de Konohagakure. Tendo um temperamento humilde, a falta de auto-confiança de Hinata era refletida em suas habilidades — traços que fizeram seu pai considerar que ela não era adequada para a sua posição como herdeira do clã. A partir de suas observações com relação a Naruto Uzumaki, Hinata encontra tanto um exemplo a seguir para ser mais assertiva, como uma pessoa para amar. Em sua filiação com o Time Kurenai, ela procura mudar e se tornar forte, mesmo sendo um pouco de cada vez. Eventualmente, ela e Naruto se casam e ela dá à luz a dois filhos, Boruto Uzumaki e Himawari Uzumaki.",
      "Hinata é caracterizada como sendo tímida, pensativa, serena, gentil e muito educada, como ela sempre aborda as pessoas com honoríficos adequados. Ela também é muito gentil, um traço que Neji e seu pai costumavam considerar uma falha, além de também não gostar de competir e lutar. Ela se mostra incrivelmente compreensiva, e, por causa de sua criação, é um dos primeiros personagens que se identificou com a infância dolorosa e o desejo de ser reconhecido de Naruto.",
      "Devido a sua infância, pelo fato das expectativas de seu clã como sua herdeira e o treinamento exaustivo de seu pai que a julgava como um fracasso, Hinata se tornou muito tímida e tinha pouca auto-confiança. A forte confiança e bravura de Hinata foi exibida após Neji morrer, onde, apesar de derramar lágrimas pela morte de seu primo, ela foi capaz de se recompor e até mesmo impedir que Obito Uchiha quebrasse o espírito de Naruto.",
      "A crescente auto-confiança de Hinata vem principalmente de sua admiração de longa data por Naruto, como ela é inspirada por seu entusiasmo e sua firme determinação de nunca desistir, não importando as probabilidades. No início, Hinata era muito tímida com relação a Naruto, ficando constantemente corada e gaguejando ao falar com ele, mas como a série progrediu, ela se tornou mais confortável em se relacionar com Naruto e sua admiração para com ele se transformou em afeição e, eventualmente, ela se apaixonou por ele, apesar de suas peculiaridades, como as constantes criticas que ele recebe dos outros. Hinata também tem uma fé inabalável em Naruto, acreditando que ele um dia vai alcançar seu objetivo de se tornar Hokage. Durante o ataque de Pain em Konoha, Hinata finalmente confessou seus sentimentos para Naruto e também estava disposta a arriscar sua vida para protegê-lo. Seus sentimentos por Naruto finalmente se tornaram seu maior desejo, desejando simplesmente estar junto com Naruto, como mostrado através do Tsukuyomi Infinito. Este desejo finalmente se tornou uma realidade anos após a guerra, quando Hinata e Naruto se casaram e começaram uma família própria, com duas crianças que ela, assim como seu marido, ama muito. Em The Last: Naruto o Filme, Hinata foi brevemente sortuna porque ela pensou que tinha perdido a chance de estar com Naruto. Ironicamente, quando Naruto começou a perceber seu amor por ela, ela estava alheio a ele como ele era para ela, levando-o a se confessar acidentalmente a ela, apenas para perceber isso.",
      "Até o final da Parte I, Hinata foi capaz de promover melhores relações com Neji e seu pai e começou a treinar com eles, bem como crescendo mais fortes e juntos como uma família. Ela é especialmente carinhosa com sua irmã mais nova, Hanabi, até o ponto onde ela estava hesitante em machucá-la, mesmo durante a sua luta para determinar o herdeiro de seu clã. Dois anos após a Quarta Guerra Mundial Shinobi, quando Hanabi foi capturada por Toneri Ōtsutsuki, ela fez um grande esforço para salvá-la como \"concordar\" em se casar com Toneri, e, eventualmente, recuperar seus olhos roubados.",
      "Hinata também é a mais próxima de sua sensei Kurenai, que não só está interessada no crescimento de Hinata como um ninja, mas também como pessoa. Ela têm conhecimento das lutas pessoais de Hinata e ao contrário de seu pai exigente, Kurenai tenta o seu melhor para treinar Hinata em formas que ela sabe que sua aluna vai responder melhor. Depois de Hinata ser derrubada pela última vez por Neji nos exames Chūnin, Kurenai felicitou silenciosamente a determinação e perseverança de sua aluna. Kurenai é consciente de sua afeição para Naruto e a incentiva a se expressar a ele. Hinata se dá bem com seus companheiros de equipe. Kiba se tornou um de seus amigos mais próximos, e suas ações em direção a ela muitas vezes são motivadas por sua preocupação com ela, como quando ele pediu para ela desistir, se ela fosse colocada para lutar contra Neji ou Gaara durante os Exames Chūnin. Kiba também está ciente de seus sentimentos por Naruto, como ele tende a provocá-la muito sobre isso, fazendo ela ficar envergonhada, dizendo-lhe que Naruto está perto quando ele não está ou comentando quando ela cora quando pensa em Naruto. Shino possui uma serena confiança em Hinata, ao ponto de garantir aos outros quando eles duvidam ou se preocupam com ela.",
      "Dois anos depois da guerra, Naruto finalmente reconhece o amor que Hinata sempre teve por ele; Percebendo que só ela sempre teve fé no mesmo e que sempre esteve presente para ele, ele retribui seus sentimentos, para sua extrema felicidade, a ponto de permitir que ela ria abertamente no anime."
    ],
    "info": {
      "Sexo": "Feminino",
      "Aniversário": "27 de Dezembro",
      "Idade": "Parte I: 12-13 anos",
      "Altura": "Parte I: 147.3 cm-148.3 cm",
      "Peso": "Parte I: 37.9 kg-38.2 kg",
      "Tipo Sanguíneo": "A",
      "Clã": "Clã Hyūga",
      "Kekkei Genkai": "Byakugan",
      "Ocupação": "Herdeira do clã Hyūga (Anteriormente)",
      "Afiliação": "Konohagakure",
      "Times": "Time Kurenai",
      "Patente Ninja": "Fase I:  Genin",
      "Registro Ninja": "012612",
      "Graduação (Genin)": "12 Anos",
      "Graduação (Chūnin)": "14 anos"
    },
    "images": [
      "https://static.wikia.nocookie.net/naruto/images/b/b1/Hinata-Genin.png/revision/latest?cb=20140328224439&path-prefix=pt-br",
      "https://static.wikia.nocookie.net/naruto/images/a/a4/Hinata_Hy%C5%ABga_%28Infobox_-_Parte_II%29.PNG/revision/latest?cb=20140408001739&path-prefix=pt-br",
      "https://static.wikia.nocookie.net/naruto/images/a/ad/Apar%C3%AAncia_de_Hinata_%28Filme_de_Boruto%29.png/revision/latest?cb=20150624043046&path-prefix=pt-br"
    ]
  },
  "Neji Hyuga": {
    "about": [
      "Neji Hyūga (日向ネジ, Hyūga Neji) foi um membro do clã Hyūga e um shinobi de Konohagakure. Embora tenha sido um prodígio mesmo pelos padrões dos Hyūga, Neji era um membro da casa secundária; por isso, não importa quão habilidoso tornou-se, ele estaria sempre a serviço da casa principal Hyūga, um fato que convenceu-o de que o destino era predeterminado. Depois de ver a recusa de Naruto Uzumaki de ser limitado por uma ideologia como esta, Neji percebeu seu destino foi o que ele escolheu para si mesmo, e como um membro do Time Guy, ele buscou a força necessária para fazer o futuro que ele queria para sua família e amigos.",
      "Neji era extremamente sério e maduro para a sua idade, e tinha um grande controle sobre suas emoções. Antes e durante os Exames Chūnin e sua luta com Naruto, ele era frio, e um pouco arrogante. Em seus anos mais jovens, Neji era uma criança amável, mais otimista que sorria com mais frequência. Ele ainda disse para seu pai que ele achou Hinata \"bonita\", quando os dois ramos do clã Hyūga se reuniram para o seu terceiro aniversário.",
      "Enquanto sob a crença de que seu pai havia morrido porque ele era um membro da casa secundária, Neji concluiu que o destino é algo decidido no momento do nascimento e que não importa o que se faça, as pessoas não podem escapar do seu destino. Neji aplicou isso muitas vezes para as pessoas que ele considerava serem mais fracas do que ele, como sua prima, Hinata. Durante a sua luta nas preliminares dos Exames Chūnin, Neji disse a Hinata que ela era imprópria para ser um ninja, devido a ser muito gentil e não ter confiança o suficiente. Quando ela foi finalmente capaz de transformar sua filosofia contra ele, lhe dizendo que ela acreditava que ele estava sofrendo ao tentar se tornar digno da casa principal, apesar de ele ter nascido na família secundária, Neji ficou enfurecido, e tentou atacar Hinata. Ele foi parado pelos jōnin presentes, mas Hinata, no entanto, foi deixada em um estado crítico, devido aos seus ataques anteriores.",
      "Neji exibiu esforços semelhantes de expressar sua filosofia durante sua luta com Naruto Uzumaki que, apesar de ser golpeado repetidamente por ele, continuou a tentar e lutar com ele. Embora Neji tenha tentado mostrar para Naruto que o destino não pode ser combatido, e que alguém que é fraco permanecerá sempre fraco, Naruto não ficou disposto a aceitar essa mentalidade, argumentando que Neji, por toda a sua crença no destino, não aceita o seu próprio destino. Após Naruto derrotar Neji, ele sugeriu que, se um \"fracasso\" como ele pôde mudar seu destino, ele pensa que um \"gênio\" como Neji poderia fazer o mesmo. A partir desta experiência, Neji passou a ver a capacidade de Naruto para salvar as pessoas da \"escuridão\" e acreditava que ele pode salvar qualquer um, desde Naruto o salvou de sua \"escuridão\".",
      "Com este exemplo de superação do \"destino\", bem como descobrir a verdade sobre a morte de seu pai logo depois, Neji abandonou o conceito de destino inescapável. Não mais limitado pela ideia de que ele estava preso em seu estado atual, Neji resolveu se tornar forte o suficiente para não perder nunca mais em uma batalha. Para fazer isso, ele começou a colocar mais ênfase em trabalhar bem com sua equipe e começou a valorizar a conclusão bem sucedida de uma missão e da segurança dos seus companheiros de equipe na sua própria melhoria, até mesmo incentivando Lee para continuar a perseguir o seu próprio sonho. Seu abandono do conceito de destino inescapável foi mais proeminente durante sua luta com Kidōmaru, onde, apesar de o ninja de Oto ter conhecimento do ponto fraco do Byakugan e Neji ser gravemente ferido, ele ainda foi capaz de lutar e, eventualmente, derrotar Kidōmaru, porque ele se lembrou do que Naruto tinha dito a ele.",
      "Além disso, Neji começou a tentar remediar as suas relações distantes entre si e os membros da família principal, mais particularmente passando a ser gentil com Hinata e seu tio Hiashi. Foi também demonstrado que, desde então, ele tem treinado com Hinata, desafiando um ao outro, a fim de aprimorarem suas habilidades. Durante a Quarta Guerra Mundial Shinobi, os dois primos protegeram as costas um do outro, bem como Neji demonstrar uma grande preocupação pela segurança de Hinata no campo de batalha. O montante mais forte de cuidado para com Hinata foi mostrado quando ele, sem hesitação, se sacrificou para salvar ela e Naruto de serem mortos pelo Dez-Caudas. Assim como sua prima, Neji demonstrou uma grande confiança na capacidade de Naruto para mudar os outros, como ele declarou que este último poderia resgatar Sasuke e trazê-lo de volta para Konoha. No entanto, parece que ele perdeu a esperança em Sasuke, e desistiu de seus pensamentos de que até mesmo Naruto poderia trazê-lo de volta, como Sasuke se tornou um criminoso internacional que poderia arrastar Konoha para uma guerra internacional devastadora.",
      "Na batalha, ele foi capaz de permanecer relativamente calmo na maioria das situações e observar atentamente a situação em que se encontrava. Ele se mostrou ser um pouco teimoso, como visto durante a Quarta Guerra Mundial Shinobi, quando Kiba lhe disse para ir para o corpo médico, ele se recusou, insistindo que ele estava bem, apesar do fato de que ele estava tremendo de mal estar."
    ],
    "info": {
      "Estado": "Morto",
      "Sexo": "Masculino",
      "Aniversário": "3 de julho",
      "Idade": "Parte I: 13-14 anos",
      "Altura": "Parte I: 159.2 cm - 160.1 cm",
      "Peso": "Parte I: 45.8 kg - 46.8 kg",
      "Tipo Sanguíneo": "O",
      "Clã": "Clã Hyūga",
      "Kekkei Genkai": "Byakugan",
      "Afiliação": "Konohagakure",
      "Times": "Time Guy",
      "Patente Ninja": "Fase I:  Genin",
      "Registro Ninja": "012587",
      "Graduação (Genin)": "12",
      "Graduação (Chūnin)": "15"
    },
    "images": [
      "https://static.wikia.nocookie.net/naruto/images/e/ee/Neji_%28Parte_I%29.png/revision/latest?cb=20200309134740&path-prefix=pt-br",
      "https://static.wikia.nocookie.net/naruto/images/0/0d/Neji_%28Shippuden%29.png/revision/latest?cb=20140811195548&path-prefix=pt-br"
    ]
  },
  "Jiraiya": {
    "about": [
      "Jiraiya (自来也, Jiraiya) foi um dos Sannin Lendários, junto com Tsunade e Orochimaru, treinados por Hiruzen Sarutobi. Ele era um auto-proclamado super-pervertido, e o escritor da popular série de livros de ficção para adultos, chamado Icha Icha. Ele também era conhecido como o Sábio dos Sapos (虾蟇仙人, Gama Sennin), por causa da sua assinatura de invocação de sapos, e por seu status como sábio.",
      "Embora tenha deixado Konoha por muitos anos, Jiraiya manteve a fidelidade por sua aldeia natal. Durante a invasão de Orochimaru em Konoha, ele ajudou a afastar as forças invasoras para proteger a vila. Quando Konoha se viu na necessidade de ser um novo Hokage após a morte do Terceiro Hokage, Jiraiya ofereceu-se para buscar Tsunade para que ela assumisse o cargo de Hokage, depois de recusar a posição de si mesmo. A sua razão para recusar a posição era, entre outras coisas, que ele sentia indigno de assumir o papel, já que ele não tinha conseguido salvar um dos Hokage anteriores de morrer, assim como ele, teria de realizar mais \"pesquisas\". Depois de encontrar Tsunade, ele começou a suspeitar de que ela poderia estar auxiliando Orochimaru, então ele deixa claro que iria matá-la se ela tivesse traindo a vila. No entanto, quando ficou claro que Tsunade ainda era leal a Konoha, e mais tarde aceitou o título de Hokage, Jiraiya serviu como seu conselheiro mais confiável, leal, confidente e espião pessoal da Akatsuki e dos inimigos de Konohagakure.",
      "Jiraiya era um auto-proclamado pervertido super-sem igual, indo tão longe a ponto de criar a técnica da fuga transparente, para permitir que ele pudesse espionar mulheres nuas sem ser apanhado (fazendo \"pesquisa\" como ele a chamava, assim como uma criança). Ele nunca escondeu sua perversão, na verdade, e até parecia orgulhoso disso, como pode ser visto quando ele disse ao Terceiro Hokage sobre sua técnica quando era criança. Apesar disso, Jiraiya não gostava de ser chamado de Ero-Sennin por Naruto na frente dos outros.",
      "A perversão de Jiraiya havia sido usada contra ele em várias ocasiões, como visto quando Naruto pediu à Jiraiya para começar a treiná-lo depois de uma exibição simples do Jutsu Sexy. Quando dois membros da Akatsuki (Itachi e Kisame) foram distrair Jiraiya, eles usaram uma mulher hipnotizada para pegar seus olhos e mantê-lo ocupado. Enquanto seu esforço foi inicialmente bem-sucedido, Jiraiya, eventualmente, viu através do golpe, devido ao fato que nenhuma mulher mantinha interesse nele. Seus hábitos pervertidos também lhe causaram grande danos em uma ocasião, quando pego espionando Tsunade em seus anos mais jovem, ela começou a atacá-lo, quebrando seis ossos das suas costelas e rompendo uma série de órgãos como punição. Como resultado de tais lesões, Jiraiya agora manteve um medo bastante saudável de sua ex-companheira de equipe, e, geralmente, tentou suprimir seus jeitos pervertidos quando estava com Tsunade. Apesar disso, Jiraiya realmente gostava profundamente de Tsunade, como foi mostrado quando ele morreu, lamentando nunca ter conquistado seu coração.",
      "Algum tempo depois de deixar Konoha, Jiraiya se tornou o autor de uma série de romances para adultos chamado Icha Icha. Os romances foram baseados em sua rejeição no amor por Tsunade, que ele recontava de uma forma cômica. Sua capacidade de escrever parecia ser igual a de uma criança, já que em um episódio exclusivo do anime, Naruto escreveu um livro como o dele, e se tornou um sucesso. Essa afirmação foi mantida por Tsunade. A popularidade da série Icha Icha parecia ter valido a pena também, como Jiraiya revelou vários talões de cheques, mostrando ser muito rico. Apesar de sua riqueza, Jiraiya tirava o dinheiro de Naruto e gastava-o com mulheres. Jiraiya frequentemente desaparecia quando Naruto ia cobrar o seu dinheiro.",
      "Jiraiya também sempre se mostrava, mesmo durante uma luta. Ele se mostrava exibindo poses heróicas acompanhadas por auto-apresentações, mantendo o seu tema eremita, mesmo quando era criança. Ele ficava chateado quando alguém o interrompia durante uma apresentação, o que acontecia frequentemente. Sua invocação, Gama, foi o único de seus sapos, que também fazia as poses junto com ele. Embora ele fosse uma pessoa muito alegre, Jiraiya pode ser muito sério em uma situação exigente, mostrado durante sua luta com Orochimaru e, depois com Pain. Ele também foi bastante perspicaz, como demonstrado quando viu Naruto tentar caminhar sobre a superfície da água rasa; Jiraiya rapidamente percebeu que havia algo dentro de Naruto que estava perturbando a circulação de seu chakra.",
      "Apesar do comportamento bobalhão de Jiraiya e sua destreza como um shinobi, ele era um crente em paz, com a esperança de botar um fim no ódio que caminhava sobre o mundo ninja. Jiraiya também realizou uma grande fé na próxima geração, e via eles como a resposta desse ódio."
    ],
    "info": {
      "Estado": "Morto",
      "Sexo": "Masculino",
      "Aniversário": "11 de novembro",
      "Idade": "Parte I: 50-51 anos",
      "Altura": "Parte I: 1.91 cm",
      "Peso": "Parte I: 87.5 kg",
      "Tipo Sanguíneo": "B",
      "Classificação": "Sábio",
      "Ocupação": "Escritor",
      "Afiliação": "Konohagakure",
      "Times": "Time Hiruzen",
      "Patente Ninja": "Fase I:  Jōnin",
      "Registro Ninja": "002301",
      "Graduação (Genin)": "6"
    },
    "images": [
      "https://static.wikia.nocookie.net/naruto/images/7/73/Jiraiya_perfil.PNG/revision/latest?cb=20191203234503&path-prefix=pt-br"
    ]
  },
  "Tsunade Senju": {
    "about": [
      "Durante sua infância, Tsunade foi muito \"estragada\" por Hashirama. Por isso, ele não deixou de se perguntar se a aldeia estava bem com ela sendo a Quinta Hokage.",
      "Quando foi introduzida pela primeira vez, Tsunade era cínica com relação às pessoas que perseguiam seus sonhos, especialmente aqueles que querem se tornar Hokage, acreditando que era um sonho fútil. Essa mentalidade foi expressa quando Tsunade não só recusou a oferta de se tornar a Quinta Hokage, mas afirmou que qualquer pessoa que queria se tornar Hokage era um tolo. Depois de conhecer Naruto, ela percebe que esse cinismo é um insulto à memória de ambos Dan e Nawaki. Depois de ser repreendida por Naruto por ela zombar dos Hokage e provar que ela está errada em sua capacidade de aprender o Rasengan, ela tem uma mudança no coração. Apesar de sua atitude ainda contundente com Naruto, ela passou a cuidar dele profundamente e coloca sua fé nele para o futuro, até mesmo concordando em assumir o manto de Hokage, carregando os sonhos de Dan e Nawaki. Como Hokage, Tsunade tem mostrado o mesmo nível de lealdade para com a aldeia que os Hokage anteriores, isso é visto durante a Invasão de Pain, onde ela distribui todo seu chakra, a fim de salvar a vida de milhares de pessoas dentro de Konoha, com grande risco pessoal. Tsunade também tem uma grande dose de fé na próxima geração, e vê o potencial que Naruto e o resto dos 11 de Konoha têm.",
      "Tsunade normalmente projeta uma atitude dura, mesmo quando enfrenta grandes dificuldades pessoais. Ela critica prontamente os outros por suas falhas, como a imaturidade de Naruto ou a perversão de Jiraiya, embora seus hábitos dificelmente sejam melhores. Outra característica de Tsunade é seu temperamento monstruoso e rápido. Muitos temem ela por causa disto, como Shizune, Jiraiya e Sakura, a última dos quais em várias ocasiões adverte Naruto sobre como se comportar em sua presença. Isto também é mostrado quando ela trabalhou duro para ajudar a curar Rock Lee, de modo que ele pudesse continuar a ser um ninja. Em situações importantes ou de risco de vida que envolvem colocar alguém que ela se preocupa em risco, ela tende a ficar irritada com as pessoas que não concordam com seu plano, tais como as restrições dos Sábios de Konoha colocaram com relação a Naruto, ou o argumento sobre se Naruto e Killer B devem participar da Quarta Guerra Mundial Ninja, até mesmo chamando Gaara de \"pirralho\", quando ele discordou com ela. Tal como acontece com todos os Hokage antes dela, Tsunade acredita profundamente na Vontade do Fogo.",
      "Tsunade também tem uma firme convicção de que Naruto, e todos os jinchūriki, são pessoas, em vez de instrumentos de guerra. Ela sempre manifesta que Naruto é um grande ninja e deve ser usado pela aldeia como qualquer outro ninja seria. Esta convicção é tão forte em Tsunade que ela gritou para os outros Kage que eles não deveriam impedir que Naruto e Killer B participassem da Quarta Guerra Mundial Shinobi. Isto mostra sua grande fé em Naruto para acabar com a guerra, como ela fica até mesmo disposta a desafiar o Raikage, a fim de permitir que Naruto e B passem.",
      "Sendo uma Iryō-nin lendária, Tsunade é verdadeiramente um modelo para os outros Iryō-nin seguirem. Sua primeira prioridade em qualquer situação é a vida dos outros. Ela criou quatro regras que orientam os outros Iryō-nin no campo de batalha, uma das quais é que eles nunca devem desistir de tratar seus companheiros enquanto eles ainda estiverem respirando.",
      "Tsunade também é uma jogadora compulsiva, um traço que herdou de Hashirama, com uma série de derrotas, devido à sua terrível sorte. Como resultado, ela passou a ser conhecida comicamente como \"A Lendária Otária\" (伝説のカモ, Densetsu no Kamo) por causa dos lucros brutos que os outros fizeram devido ao seu infortúnio e vício nos jogos. O símbolo na parte de trás do casaco, 賭 (kake), significa \"jogo de azar\", ou \"aposta\", como jogos de azar é um de seus passatempos favoritos.",
      "Apesar de Tsunade ter evitando todos os avanços românticos de Jiraiya ao longo dos anos, como ela ainda estava apaixonada por Dan, mesmo depois de sua morte, ela ainda se importava muito com ele como um de seus amigos mais antigos. Enquanto ele estava em Amegakure investigando Pain, ela aposta que ele vai morrer de modo que seu terrível azar vai garantir que ele sobreviva."
    ],
    "info": {
      "Sexo": "Feminino",
      "Aniversário": "2 de Agosto",
      "Idade": "Parte I: 51-52 anos",
      "Altura": "Parte I: 163.1 cm",
      "Peso": "Parte I: 48.9 kg",
      "Tipo Sanguíneo": "B",
      "Clã": "Clã Senju",
      "Classificação": "Ninja Médico",
      "Ocupação": "Hokage",
      "Afiliação": "Konohagakure",
      "Times": "Time Hiruzen",
      "Patente Ninja": "Fase I: Kage",
      "Registro Ninja": "002302",
      "Graduação (Genin)": "6 anos"
    },
    "images": [
      "https://static.wikia.nocookie.net/naruto/images/e/e1/Apar%C3%AAncia_de_Tsunade.png/revision/latest?cb=20150909132616&path-prefix=pt-br"
    ]
  },
  "Orochimaru": {
    "about": [
      "Orochimaru (大蛇丸, Orochimaru) é um dos Lendários Sannin, junto com Tsunade e Jiraiya, de Konohagakure. Com sua ambição de vida sendo aprender todos os segredos do mundo, Orochimaru buscou a imortalidade para que ele pudesse viver todas as vidas necessárias para realizar sua tarefa. Depois de ser pego em flagrante realizando experimentos antiéticos sobre seus concidadãos por causa desta imortalidade, Orochimaru desertou de Konoha, passando a ser perseguido por suas ambições, e por muitos anos procurou a destruição da aldeia, a fim de se vingar e demonstrar o que ele tinha aprendido. Após vivenciar várias mortes durante a busca de seus objetivos, Orochimaru percebe que sua abordagem é falha ao ver as ações de Kabuto Yakushi, e começa a monitorar as escolhas e ações de seu ex-associado, Sasuke Uchiha.",
      "Orochimaru foi muitas vezes descrito como uma pessoa de mente distorcida por um grande número de pessoas, incluindo Tsunade. Jiraiya especulou que isso se deve ao fato de que ambos os seus pais morreram quando ele ainda era muito jovem, juntamente com o horror de ver Tsunade perder Nawaki e depois derramando lágrimas quando ela perdeu Dan. Isto implicou que Orochimaru cresceu desdenhando da fragilidade da vida humana e como isso afeta aqueles que ainda vivem, o que o levou a desejar a imortalidade. Com isso, seu objetivo principal era fazer experimentos em outras pessoas para ver que tipo de modificações o corpo humano poderia suportar, e de outro modo aproveitar as habilidades únicas de um sujeito para si mesmo. Depois de realizar este objetivo, Orochimaru tinha a esperança de ser digno do título de \"ser supremo\", incapaz de morrer e capaz de atingir seu objetivo secundário, que era aprender todas as técnicas ninja do mundo, o que normalmente levaria muitas vidas para se conseguir.",
      "De acordo com Sasuke, Orochimaru perdeu o seu propósito ao longo do tempo depois que deixou de ser um membro do Time Hiruzen. Seus objetivos fizeram com que ele desenvolvesse um complexo de deus e se deliciasse com o terror que ele deixava em suas vitimas. Apesar de causar conflitos para aliviar seu tédio, Orochimaru parece não ter interesse em guerras iniciadas por outros. Seu carisma também atrai um grande número de seguidores, muitos dos quais ele não hesitaria em enviar em missões potencialmente suicidas, para seu próprio beneficio pessoal, não expressando remorso algum se eles fossem incapazes de completar uma tarefa corretamente, não tendo ligações sentimentais com qualquer um deles, apesar de seus valores. Apesar disso, Orochimaru tem interesse genuíno no desenvolvimento de seus subordinados e experimentos.",
      "Fazendo de Sasuke como seu aprendiz, vendo-o como um prodígio como ele, Orochimaru tinha a intenção de pegar o corpo do jovem para obter o Sharingan para chegar a mais um passo em seu objetivo de imortalidade e aprender todas as técnicas do mundo. Este objetivo se desenvolveu ao ponto de obsessão. No entanto, apesar de saber que Sasuke estava disposto a fazer qualquer coisa para se vingar, inclusive sacrificando o seu próprio corpo, Orochimaru previu a traição de seu discípulo e mostrou apenas um nível pequeno de surpresa quando ela realmente ocorreu. O que realmente surpreendeu Orochimaru foi a decisão de Sasuke em seguir seu próprio caminho e, finalmente, escolher defender a aldeia, a qual ele inicialmente jurou destruir, o qual Orochimaru aprova abertamente e fica curioso para ver o resultado final disso.",
      "Orochimaru também tinha um desdém inicial com Naruto Uzumaki, acreditando que ele era uma piada como ninja até ele derrotou Kabuto com o Rasengan. Apesar de tentar matar Naruto momentos depois de chegar à conclusão de que ele iria se tornar uma ameaça para ele no futuro, Orochimaru ficou interessado no desenvolvimento de Naruto, provocando Naruto durante a sua batalha para ver a extensão total de suas habilidades no momento. Apesar de vir a odiar sua aldeia natal, orquestrando algumas tentativas de destruí-la, Orochimaru despreza mais seus ex-colegas da Akatsuki. Ao longo da Parte II, se Orochimaru não estivesse ocupado com o desenvolvimento de Sasuke, ele estava tentando paralisar as operações da Akatsuki, como visto no \"Arco Sai e Sasuke\". Ele expressa satisfação com a morte de Sasori e convence Sasuke em evitar matar o Time Kakashi para que eles derrotassem mais membros da Akatsuki.",
      "Um aspecto da personalidade de Orochimaru também é sua maior fraqueza: sua arrogância. Ele realmente acreditava que ele é um imortal invencível às vezes, atacando de forma imprudente contra adversários poderosos, como o seu ex-professor e Itachi Uchiha. Nas duas vezes ele ficou aleijado de alguma forma já que ele queria fazer o adversário sofrer, como contra Hiruzen, ou porque ele estava muito mal informado para enfrentar o seu adversário, como contra Itachi. Apesar de sua clara falta de moral, Orochimaru parece ser bem versado em psicologia humana e exibe sabedoria perspicaz, visto quando ele critica Tobirama pelas ações decorrentes de suas políticas.",
      "Depois de ser revivido por Sasuke, sua personalidade mudou um pouco. Apesar de ele ainda desejar pegar o corpo de Sasuke, ele reconheceu que ele estava muito fraco. Ele também percebeu que copiar alguém é um completo erro, logo após ele observar as ações de Kabuto e exibiu um interesse no \"caminho diferente\" de Sasuke. Mais tarde, ele ficou um pouco sentimental por não ter sido eleito Hokage, embora isso possa ser porque ele estava na frente de seu mestre e do Quarto. Querendo ver o caminho de Sasuke, ele escolheu lutar ao lado do Uchiha em vez de ignorar a guerra de Madara como ele planejou, e ainda fez disso uma prioridade como visto quando ele cura Tsunade e os outros Kage, depois de eles serem derrotados, antes de correr para o campo de batalha. Orochimaru também mostra um senso de humor no momento, usando a memória de Sasuke quando ele o esfaqueou para convencer Karin a ajudar o jovem novamente, com o seu método cômico de ameaçar ela e Suigetsu em cooperarem para curar Tsunade. Orochimaru também mostrou sinais de arrependimento, aparentemente triste pela morte de seu amigo de infância, Jiraiya. Orochimaru também parece se preocupar com o bem-estar de Sasuke, ao observar que era melhor deter Tobi o mais rapidamente, quando Karin sentiu que Sasuke estava à beira da morte."
    ],
    "info": {
      "Sexo": "Desconhecido",
      "Aniversário": "27 de outubro",
      "Idade": "Parte I: 50-51 anos",
      "Altura": "Parte I: 172 cm",
      "Peso": "Parte I: 63.9 kg",
      "Tipo Sanguíneo": "B",
      "Kekkei Genkai": "Liberação de Madeira",
      "Classificação": "Nukenin",
      "Ocupação": "Fundador e Líder de Otogakure",
      "Afiliação": "Konohagakure",
      "Times": "Time Hiruzen",
      "Parceiro": "Sasori",
      "Patente Ninja": "Fase I:  Anbu",
      "Registro Ninja": "002300",
      "Graduação (Genin)": "6 anos"
    },
    "images": [
      "https://static.wikia.nocookie.net/naruto/images/0/07/Orochimaru.PNG/revision/latest?cb=20151006181637&path-prefix=pt-br",
      "https://static.wikia.nocookie.net/naruto/images/d/da/Orochimaru_Part_IV.png/revision/latest?cb=20180402233439&path-prefix=pt-br"
    ]
  },
  "Nagato": {
    "about": [
      "Nagato (長門, Nagato) foi um órfão de Amegakure e um aluno de Jiraiya, que cresceu durante a Segunda Guerra Mundial Shinobi. Órfão pelo conflito, Nagato se uniu juntamente com seus companheiros órfãos de guerra para formar a Akatsuki, uma organização cujos objetivos foram parar os ciclos infinitos de morte. Depois de seu amigo e líder, Yahiko, ser morto por pregar a paz, Nagato se convenceu de que o mundo nunca iria parar de lutar voluntariamente a menos que ele conheça o que é a verdadeira dor. Ele adotou o pseudônimo de Pain (ペイン, Pein) e foi o novo líder da Akatsuki na tentativa de mudar o mundo a um estado de paz através do medo da destruição pelas mãos da Akatsuki.",
      "Nagato era sensível, gentil, que tinha a propensão de chorar, e ficou traumatizado com a ideia de matar os outros, mesmo para salvar seu amigo Yahiko. Assustado e inseguro de seu lugar no mundo, ele queria ajudar aqueles com que ele se preocupava, mas não sabia como. Ele sempre foi respeitoso e gentil com Konan, a quem ele chamava de seu \"anjo\" em Amegakure. Ele foi mostrado protegendo-a, sem pedido ou hesitação antes de sua batalha com seu antigo professor. Aparentemente, Konan era o único membro da Akatsuki que se dirigia a ele pelo seu verdadeiro nome.",
      "Quando controlava Pain, sua personalidade era muito diferente, tendo uma natureza calma, distante, séria e individual. Aparentemente acreditando nos traumas que ele teve em sua juventude tinha esclarecido o verdadeiro significado da dor e do sofrimento, ele se considerava um deus, e acreditava que ele tinha evoluído para além de um simples ser humano. Ele procurou mostrar ao mundo o significado da dor usando uma arma definitiva para deter as guerras do futuro, por meios semelhantes a \"destruição mutuamente assegurada\", e não mostrou nenhum escrúpulo moral sobre suas ações. Ele estava disposto a matar Jiraiya para garantir a conclusão de seus planos. Ele chegou até mesmo a proclamar-se um \"deus da paz\", que tinha de guiar o mundo para a maturidade através da dor. Finalmente, ele sentiu que ninguém poderia entender a verdadeira paz se não entendesse a dor \"verdadeira\", algo que seu amigo de infância, Yahiko, acreditava. Minato Namikaze acreditava que Tobi usou essa filosofia a seu favor, a fim de manipular Nagato.",
      "No anime, Nagato é mostrado sensível quando se trata de falar sobre \"dor\", quando Ibiki Morino usou um jutsu especial convocação que \"ligava pela dor\" Nagato ficou furioso (através do Caminho Animal) e gritou que \"tinha nenhuma ideia do que era verdadeira dor \" libertando-se do jutsu e atacando Ibiki violentamente.",
      "No entanto, ele foi visto ser bastante respeitoso, em especial pelos fracos e mortos. Dada a insignificância dos membros da Akatsuki freqüentes, muitas vezes ele acalmou-os e incentivou a melhoria das relações entre os membros. Depois de sua batalha com Jiraiya, ele realizou um momento de silêncio para o seu antigo professor, por respeito a seu poder.",
      "Nagato era um homem de pele clara, com cabelo ruivo (uma cor que é uma marca do clã Uzumaki) que tinha comprimento até o queixo, sendo sua característica mais notável os olhos Rinnegan. Quando era criança, seu cabelo ficava cobrindo seu rosto bloqueando a visão de seus olhos, fazendo seus olhos normais nunca serem vistos. Nagato cresceu como um homem alto, mas depois de submeter-se à Invocação: Estátua Demoníaca do Caminho Exterior, Nagato foi reduzido em uma versão atrofiada e magra com receptores de chakra implantados em suas costas, uma em cada uma das articulações do ombro e menores em seu antebraço. Nagato usa um andador mecânico para a mobilidade, que podia disparar Lâminas de Rompimento de Chakra para sua defesa pessoal. Ele foi o único membro da Akatsuki que nunca visto vestindo uniforme da organização. No entanto, os Seis Caminhos de Pain usava o uniforme da Akatsuki em seu lugar.",
      "Quando Nagato era muito jovem, sem seu conhecimento, Madara Uchiha transplantou seu Rinnegan nele, fazendo com que o jovem tivesse DNA do Clã Senju e, do Clã Uchiha."
    ],
    "info": {
      "Estado": "Morto",
      "Sexo": "Masculino",
      "Aniversário": "19 de setembro",
      "Idade": "Parte II: 35 anos",
      "Altura": "Parte II: 174.5 cm",
      "Peso": "Parte II: 40.1 kg",
      "Tipo Sanguíneo": "A",
      "Clã": "Clã Uzumaki (Descendência)",
      "Kekkei Genkai": "Rinnegan",
      "Classificação": "Rank S",
      "Ocupação": "Líder da Akatsuki",
      "Afiliação": "Amegakure",
      "Times": "Órfãos de Ame",
      "Parceiro": "Konan"
    },
    "images": [
      "https://static.wikia.nocookie.net/naruto/images/b/bb/Nagato-Edo.PNG/revision/latest?cb=20141014222811&path-prefix=pt-br",
      "https://static.wikia.nocookie.net/naruto/images/7/7a/Nagato_Jovem.png/revision/latest?cb=20200313165236&path-prefix=pt-br"
    ]
  },
  "Sarada Uchiha": {
    "about": [
      "Sarada herdou traços da personalidade de ambos seus pais. Como sua mãe, ela é crítica com desordeiros; ela também herdou seu tique verbal, \"Shannarō!\" (しゃーんなろー). Como seu pai, ela é geralmente distante e relutante em reconhecer certas pessoas, a menos que ela ache que elas mereçam. Ela tem um apego próximo por seus pais, a quem ela carinhosamente chama de \"Papai\" e \"Mamãe\", apesar de seu pai ter ficado ausente por muitos anos. Ao contrário de seus pais em sua infância, Sarada nunca está confiante demais, nem obcecada com os meninos, sendo modesta e tratando os seus colegas agradavelmente, especialmente seus amigos Chōchō Akimichi e Boruto Uzumaki. Apesar de Sarada brigar com Boruto muitas vezes e sua rivalidade com ele, eles são amigos próximos e ela se preocupa muito com ele. Sarada foi tão longe ao ponto de incentivar seu pai para tornar Boruto seu aluno, depois que ela testemunhou o grande esforço que ele fez para tentar aprender o Rasengan. Quando Sasuke finalmente se decide à aceitar Boruto como seu aluno, Sarada ficou muito animada em nome de Boruto. Sarada é também uma criança curiosa; embora considere Boruto irritante, ela o seguiu ao redor da aldeia, observando-o. Ela chega à conclusão de que eles realmente têm algo em comum (ambos querem passar mais tempo com seus pais), exibindo uma visão aguçada. Embora ela pareça ser simpática e educada, ela tem um temperamento feroz, semelhante ao de sua mãe, e não recua a partir de um argumento. Sarada também tem grande respeito por Naruto Uzumaki. Foi devido a sua admiração por Naruto que Sarada tornou sua meta se tornar Hokage.",
      "Como seu pai, Sarada tem hábitos de pensamento crítico, mostrando uma mente perspicaz e analítica, o que a ajuda na batalha para melhor ler o ataque de um inimigo. Antes de sua formatura na Academia, Sarada questionou o significado de um shinobi devido ao fato dos deveres de seu pai como um shinobi que o mantiveram longe de casa por muitos anos. Sarada tem um bom relacionamento com sua mãe, embora ela tenha questionado a validade do casamento de seus pais devido à hesitação de sua mãe para falar sobre a ausência de seu pai e de sua missão, levando-a a suspeitar que seus pais estavam guardando segredos dela. Como resultado, ela considerava os ninjas médicos como sendo pessoas misteriosas, mesmo que sua mãe seja conhecida como uma grande ninja médica. Também é sugerido que Sarada é imprudente como sua mãe, como quando Sarada deixou a aldeia secretamente para procurar seu pai, apesar do perigo que ela estava colocando a si mesma. Quando ela acreditou equivocadamente que Sakura não era sua mãe biológica, Sarada ficou perturbada e em sua raiva, renunciou qualquer ligação com sua mãe; no entanto, Naruto foi capaz de acalmá-la, dizendo-lhe que uma família de verdade é feita de amor em vez de sangue, e Sarada decidiu que Sakura era sua mãe, não importando o resto. Uma vez que Sakura confirmou para Sarada que ela era sua filha biológica, Sarada, tendo já testemunhado as interações entre seus pais que provaram que eles se amavam, concordou, afirmando que tudo o que importa era a ligação entre eles, efetivamente se conciliando com sua mãe. Muito parecido com seu tio, Itachi Uchiha, Sarada é muito leal a vila e é uma crente firme da Vontade do Fogo, fazendo dela um dos poucos membros do clã Uchiha que não caíram vitimas da Maldição de Ódio.",
      "Devido a Sasuke estar ausente durante a maior parte de sua vida por causa de sua missão, Sarada cresceu sem conhecer seu pai. Ao longo dos anos, ela sempre foi curiosa sobre seu pai e perguntava a sua mãe sobre seu paradeiro inúmeras vezes e ela ainda se tornou insegura sobre se ele realmente se importava com as duas. Crescer sem um pai foi algo profundamente perturbador para Sarada e vendo todos os seus amigos e colegas passando algum tempo com seus próprios pais, deixaram Sarada com o desejo do afeto de seu pai. Apesar das alegações de Sarada que ela não se lembra de Sasuke, ela aparentemente tem algumas lembranças dele desde a sua infância, como ele e Sakura segurando suas mãos quando ela era uma criança; isto mostra que Sasuke foi presente em sua vida antes de ele a deixar. Momentos antes de ela finalmente se encontrar com Sasuke, a emoção de vê-lo pela primeira vez em anos ativou o seu Sharingan. Sua impressão inicial de seu pai foi decepcionante devido à indiferença aparentemente fria de Sasuke para com ela e sua recusa em responder às suas perguntas a respeito de sua ausência, o que irritou muito Sarada e até mesmo a fez chorar. Apesar disso, ela ainda esperava compreendê-lo mais e ter algum tipo de relacionamento com ele. Após a provação com Shin Uchiha e perceber que Sasuke de fato se importa muito profundamente com Sarada e sua mãe, seu relacionamento com ele melhora significativamente, ao ponto em que ela foi capaz de falar com seu pai com facilidade durante seu primeiro jantar de família juntos e sua alegria quando ele a abraçou carinhosamente e a cutucou na testa antes de sair para continuar sua missão. Embora Sarada ame seu pai, ela ainda duvidava que ele viria para assistir o seu desempenho nos Exames Chūnin, e deseja seguir um caminho diferente do dele, mas mostrou ficar mais feliz do que até mesmo Sakura quando ele voltou.",
      "Sarada tem pele clara e herdou o cabelo e olhos ônix dos Uchiha de seu pai. Seu cabelo desce reto até a altura dos ombros para o lado esquerdo da testa, enquanto se esconde atrás da orelha do lado direito, enquadrando o lado esquerdo de seu rosto. Seus olhos são emoldurados por um par de óculos vermelhos, que foram dados a ela por Karin. Como observado por Naruto Uzumaki, apesar de em sua maior parte ela se assemelhar a Sasuke, suas maneiras são parecidas com as de Sakura — especialmente quando está irritada. Na novela \"Boruto: Naruto o Filme\", depois de se tornar uma genin, Sarada se torna mais popular entre os meninos.",
      "No epílogo, a roupa de Sarada consiste em uma jaqueta rosa sobre um colete amarelo, debaixo de uma camisa branca de gola alta com uma gravata vermelha, saia vermelha e botas pretas de bico aberto. Na época do Naruto Gaiden: O Sétimo Hokage e o Mês da Primavera Escarlate, Sarada veste uma camisa qipao vermelha sem mangas, semelhante a segunda vestimenta de Sakura, (a única diferença é o símbolo Uchiha nas costas), um par de shorts de cor clara e longas meias roxas que sobem até coxa e sandálias shinobi, além de longos aquecedores de braço roxo, semelhante à primeira roupa de seu pai. Em Boruto: Naruto o Filme, ela também usa um protetor de testa de Konoha em torno de sua testa com a franja por cima.",
      "Em Boruto: Naruto Next Generations, Sarada usa um vestido vermelho sem mangas desabotoado e de gola alta, um cinto branco e um lenço amarelo amarrado em volta do pescoço. Sobre o seu vestido, Sarada tem uma série de ataduras que cobrem sua barriga e a parte inferior de seu peito. Ela também usa uma luva preta sem dedos na mão direita, um aquecedor de braço preto em seu braço esquerdo e um par de sandálias de salto alto com solas de madeira.",
      "Sarada nasceu de Sasuke e Sakura Uchiha. Como Sakura se recusava a sair do lado de Sasuke durante sua viagem, mesmo enquanto ela estava grávida, Sarada acabou nascendo em um dos esconderijos de Orochimaru, com Karin ajudando no parto. Devido a isso, não há registros de seu nascimento disponíveis no Hospital de Konoha."
    ],
    "info": {
      "Sexo": "Feminino",
      "Aniversário": "31 de Março",
      "Idade": "Boruto: 11-12 anos",
      "Altura": "Período em Branco: 125 cm",
      "Clã": "Clã Uchiha",
      "Kekkei Genkai": "Sharingan",
      "Afiliação": "Konohagakure",
      "Times": "Time Konohamaru",
      "Patente Ninja": "Boruto:  Genin",
      "Graduação (Genin)": "11 anos"
    },
    "images": [
      "https://static.wikia.nocookie.net/naruto/images/b/b6/SaradaUchiha.png/revision/latest?cb=20181104154136&path-prefix=pt-br"
    ]
  },
  "Mitsuki": {
    "about": [
      "Mitsuki (ミツキ, Mitsuki) é um shinobi que veio de Otogakure para Konohagakure em busca de Boruto Uzumaki. Junto deste e de Sarada Uchiha, ele é um dos integrantes do Time Konohamaru.",
      "Mitsuki possui um comportamento muito calmo e definido por uma questão da situação em que se encontra. Embora não seja alguém conflituoso, ele fala o que pensa livremente em qualquer situação. Ele também demonstra uma inteligência perspicaz, sendo muito intelectual e observador. Apesar de não revelar muito sobre suas origens ou pais, Mitsuki se preocupa com seus companheiros de equipe, Boruto e Sarada, até o ponto onde ele nunca hesita em correr para seu lado quando eles estão em perigo ou quando necessitam de assistência. Mitsuki tem uma opinião elevada sobre Boruto Uzumaki como o filho do Sétimo Hokage e neto do Quarto Hokage, além de acreditar que Boruto está destinado a se tornar Hokage um dia, apesar de ouvir as repetidas declarações de Sarada de que ela será Hokage.",
      "Mitsuki parece admirar Naruto e Sasuke devido a ambos serem shinobi de alto ranking, e informa para Boruto e Sarada como seu pai lhe disse que seus pais são rivais que podem lutar de forma igual. Mitsuki também detém uma grande admiração por seu pai, bem como a confiança em suas habilidades, ao ponto de ser ingênuo, como mostrado quando ele se vangloriou a Boruto e Sarada que Orochimaru era ainda mais poderoso do que ambos seus pais.",
      "Mitsuki tem cabelo branco azulado despenteado, sobrancelhas finas, olhos com cor de âmbar, e uma pele pálida. Seu traje é composto por uma camisa quimono folgada, de dois tons e com mangas esvoaçantes, amarrada por um cinto Ono grosso estilizado, junto com isso, ele usa um par de calças de cor clara, e sandálias shinobi de comprimento longo. Além de sua roupa, ele usa longas luvas sem dedos negras e sandálias shinobi negras que sobem até suas panturrilhas. Mitsuki também usa seu protetor de testa de Konoha em torno de sua testa.",
      "Mitsuki é um ser humano sintético criado por Orochimaru, sendo cultivado no mesmo embrião de seu irmão mais velho. Uma noite, ao acordar em uma cama, Mitsuki recebe um medicamento de seu pai, que está ao lado de Suigetsu Hōzuki, o qual Orochimaru ordena para levar o jovem para o seu quarto uma vez que ele se levantou completamente. No caminho, Mitsuki é atacado por uma kunai de Suigetsu, mas consegue evitá-la e desarmá-lo, estendendo seus membros para tomar a kunai e tentar atacar Suigetsu, no entanto, ele acaba se ferindo, Suigetsu o cura enquanto explica que ele estava o testando e que suas memórias tinham sido roubadas.",
      "Mais tarde, Mitsuki se encontra com Orochimaru, que lhe explica que Mitsuki é seu filho e que ele deve ir com ele para encontrar um homem chamado Log, a pessoa que roubou suas memórias. Ao chegar no esconderijo de Log eles percebem que ele está protegido por um Kekkaijutsu, Orochimaru diz para Mitsuki que ele possui a capacidade de desfazê-lo, assim, Mitsuki toca na barreira, fazendo-a desaparecer completamente. Ao entrar e se depararem com seu objetivo, Orochimaru e Log se enfrentam, o Sannin consegue paralisar seu oponente com um veneno de cobra e entra no esconderijo para procurar algo.",
      "Log pede para Mitsuki remover sua máscara, revelando que ele é um irmão mais velho clone de Mitsuki. Log lhe diz que ambos são humanos sintéticos criados para satisfazer os desejos de Orochimaru e que o Sannin está buscando o embrião do qual eles foram criados. Ouvindo a conversa, Orochimaru comenta que independentemente de como eles foram criados, ambos são seus filhos amados, em seguida, ele manda Mitsuki escolher um lado, transtornado, Mitsuki passa por uma transformação, declarando que ele não vê nenhuma diferença se ele escolher qualquer um dos dois, Mitsuki usa suas cobras etéreas para roubar o pergaminho e a chave que Orochimaru estava carregando e escapa rapidamente. Uma vez feito isso, a sua transformação é desfeita e, ao abrir o pergaminho, ele encontra informações sobre Boruto Uzumaki, Mitsuki decide ir para Konoha e fazer amizade com ele, a fim de forjar o seu próprio caminho na vida."
    ],
    "info": {
      "Sexo": "Masculino",
      "Aniversário": "25 de Julho",
      "Altura": "Boruto: 149 cm",
      "Espécie": "Humano Sintético",
      "Classificação": "Ninja Médico",
      "Afiliação": "Otogakure",
      "Times": "Time Konohamaru",
      "Patente Ninja": "Boruto:  Genin"
    },
    "images": [
      "https://static.wikia.nocookie.net/naruto/images/5/5c/Mitsuki.png/revision/latest?cb=20181104152740&path-prefix=pt-br"
    ]
  },
  "Boruto Uzumaki": {
    "about": [
      "Boruto Uzumaki (うずまきボルト, Uzumaki Boruto) é um shinobi do clã Uzumaki de Konohagakure, assim como um descendente do clã Hyūga. Ele também é um membro do Time Konohamaru. Desde que seu pai, Naruto Uzumaki, se tornou o Hokage, Boruto passou a ser ressentido com ele por nunca ter tempo o suficiente para ele e sua família, levando-o a agir de maneira indignada. Ele também tinha uma tendência a tomar atalhos como um ninja em vez de depender de sua própria força. No entanto, após o treinamento sob a tutela de Sasuke Uchiha e sua luta contra Momoshiki e Kinshiki Ōtsutsuki com seu pai e professor, Boruto eventualmente passou a respeitar seu pai e seu papel como Hokage, mas mesmo assim ele promete ir por um caminho diferente do que Naruto escolheu, decidindo se tornar um ninja como Sasuke.",
      "Boruto é bastante semelhante ao seu pai, tanto que tende a ser barulhento, energético e teimoso; ele ainda tem um tique verbal, \"dattebasa\" (だってばさ), semelhante ao \"dattebayo\" de Naruto e ao \"dattebane\" de Kushina. Boruto tem uma opinião elevada de si mesmo, e de suas habilidades, se gaba livremente, embora, ao contrário de Naruto, quando ele tinha a idade de Boruto, o orgulho de Boruto é normalmente justificado. Sua própria arrogância resultou em ele não valorizar seus companheiros de equipe ou o trabalho em equipe, em geral, desde o início, ao ponto em que ele acreditava que poderia fazer tudo e qualquer coisa por conta própria. Ao contrário de seu pai, Boruto se mostrou ser bastante inteligente, e, às vezes, ele tende a ser altamente tímido sobre seus sentimentos, até o ponto em que ele finge não estar preocupado, mas, mais tarde ele mostra seu lado mais suave quando ninguém está ao redor.",
      "Apesar de suas semelhanças, Naruto e Boruto se diferem em algumas coisas: enquanto Naruto era um órfão, a família de Boruto está sempre lá para ele; enquanto Naruto foi condenado ao ostracismo por crianças de sua idade, Boruto tem muitos amigos; enquanto Naruto teve que trabalhar duro para suas habilidades e reconhecimento, os talentos de Boruto vieram a ele, naturalmente, e ele recebe louvor sem sequer tentar. Por tudo isso, Boruto carece de uma apreciação para as coisas ganhas com esforço, fazendo-o trapacear em jogos de videogame, em vez de jogá-los como se devia e utilizar o Kote, em vez de dominar ninjutsu por conta própria. Ele, se importa com sua mãe e irmã, ficando irritado quando alguém as fere física ou emocionalmente.",
      "Boruto teve um relacionamento hostil com seu pai desde que Naruto se tornou Hokage. Ele ama seu pai e fica radiante sempre que passa algum tempo juntos, mas as responsabilidades de Naruto como Hokage tornam estes momentos raros. Boruto se sente negligenciado e passou a ressentir o papel de Hokage por fazer seu pai se tornar ausente. Os métodos de Boruto para lidar com isso são numerosos: ele faz qualquer coisa para ganhar a atenção de Naruto, muitas vezes motivadas unicamente pela perspectiva de que seu pai vai notá-lo; ele menospreza o título de Hokage, acreditando que ele só é adequado para aqueles sem entes queridos; ele se esforça para se tornar forte o suficiente para superar seu pai, portanto, desvalorizando o legado de Naruto. O que ele não faz é expressar como ele se sente para Naruto, fingindo desinteresse sempre que Naruto tenta se conectar com ele. Eventualmente, quando Boruto é finalmente exposto às complicações da vida de seu pai e testemunha como o trabalho duro pode fazer um shinobi se tornar respeitável, ele perdoa a movimentada agenda de seu pai e para de tentar tomar as opções fáceis na vida.",
      "Boruto conhece Sarada Uchiha desde que eram jovens, embora eles não tenham o mesmo tipo de relacionamento que Naruto teve com o pai de Sarada, Sasuke Uchiha, quando eram mais jovens. Em vez de competirem constantemente um com o outro como seus pais faziam, Boruto e Sarada agem de maneira civil e respeitosa. Embora Sarada sempre tenha apoiado o desejo de Boruto para estar mais perto de Naruto, Boruto nem sempre foi atencioso com os seus próprios desejos para se tornar Hokage, optando por ajudá-la apenas quando isso se adaptar às suas próprias necessidades. Após se reconciliar com seu pai, Boruto teve uma mudança no coração, tomando a decisão de fazer o que puder para ajudar Sarada a se tornar Hokage, uma dinâmica como a que Naruto e Sasuke tem na vida adulta. Boruto também tem um grande respeito para com Sasuke, admirando-o por se equiparar a seu pai; chamando Sasuke de \"tio\", apesar do fato de que eles nunca se encontraram antes de Boruto se tornar um genin. Foi por meio da tutela de Sasuke e sua admiração por ele, que Boruto fez dela a sua meta de se tornar um shinobi como ele.",
      "Boruto se parece muito com seu pai, com o cabelo loiro em forma semelhante e olhos azuis. Ao contrário de Naruto, no entanto, ele tem cabelo ondulado que se alarga para fora nos lados e para trás, e um ahoge (アホ毛, que significa literalmente: cabelo insensato) que se assemelha a haste de uma folha. Seu rosto tem uma forma redonda como o de sua mãe, e ele tem duas marcas de bigodes em cada bochecha, que herdou de seu pai.",
      "Em The Last: Naruto o Filme, Boruto usava um agasalho preto, que lembra o agasalho laranja que Naruto usava na maior parte série, tendo um símbolo vermelho de fogo no peito esquerdo combinando com uma insígnia do casaco que sua mãe uma vez usou na Parte I e listras vermelhas ao longo dos lados de suas calças. Na parte detrás da jaqueta de Boruto, havia um símbolo que se assemelha a um parafuso. Usando com esta vestimenta, ele usava um par de sandálias brancas lisas."
    ],
    "info": {
      "Sexo": "Masculino",
      "Aniversário": "27 de Março",
      "Idade": "Período em Branco: 5 anos",
      "Altura": "Período em Branco: 110 cm – 122 cm",
      "Clã": "Clã Hyūga",
      "Kekkei Genkai": "Jōgan",
      "Afiliação": "Konohagakure",
      "Times": "Time Konohamaru",
      "Patente Ninja": "Boruto:  Genin",
      "Graduação (Genin)": "11"
    },
    "images": [
      "https://static.wikia.nocookie.net/naruto/images/e/ec/Boruto_Uzumaki_%28Infobox_-_Parte_IV%29.PNG/revision/latest?cb=20210622125940&path-prefix=pt-br",
      "https://static.wikia.nocookie.net/naruto/images/8/8d/Boruto_Ep%C3%ADlogo.png/revision/latest?cb=20170405142723&path-prefix=pt-br"
    ]
  },
  "Jigen": {
    "about": [
      "Apesar de ser oriundo de um período muito antigo, a aparência de Jigen conseguiu manter um físico jovem devido à influência de Isshiki Ōtsutsuki. Ele era um homem bastante alto com uma pele clara. Ele tinha uma cabeça quase que inteiramente raspada, possuindo um longo moicano de cabelos pretos, amarrados em um longo rabo de cavalo que atingia a parte inferior das costas. Jigen tinha um nariz largo, e grandes olhos negros, desprovidos da companhia de sombrancelhas. Algum tempo depois que Isshiki assumiu o controle dele, ele ganhou uma marca do Karma na forma de um diamante no seu queixo, além do número romano \"IV\" tatuado abaixo de seu olho esquerdo. A região do seu estômago parece ser completamente negra. Ele também usava unhas pretas em todos os dedos, bem como cinco brincos vermelhos na parte superior de cada orelha, acrescidos de um adicional na parte inferior de cada orelha.",
      "Em sua primeira aparição, ele usou o manto preto com capuz de forro escuro avermelhado típico dos membros de Kara, juntamente de calças e sandálias capri escuras com um colar escuro. Em aparições posteriores, ele vestiu um manto haori branco comprido com linhas verticais pretas. Jigen vestia um par de braceletes vermelhos nos braços, bem como uma faixa de couro da mesma cor dando a volta por todo seu pescoço.",
      "Na época em que Kaguya Ōtsutsuki e Isshiki Ōtsutsuki chegaram na Terra, Jigen era um monge novato. Após Kaguya deixar Isshiki em um estado fatal, Jigen foi atacado por Isshiki, que encolheu-se para entrar no ouvido do monge em função de sobreviver. Através dos nutrientes absorvidos de dentro do corpo de Jigen, Isshiki começou a ganhar controle sobre o corpo, embora eventualmente, Isshiki tenha perdido o controle sobre o corpo do monge. Mais tarde, Isshiki incorporou seu Karma em Jigen, mas como seu corpo não era poderoso o suficiente para sustentá-lo, o Ōtsutsuki optou por não renascer através dele, optando por esperar até que um Receptáculo mais adequado pudesse ser encontrado.",
      "Com o tempo, Isshiki usou o corpo de Jigen para formar uma organização clandestina para ajudar a alcançar seu objetivo, chamada de Kara. Jigen encontrou e comprou Kawaki de seu pai abusivo com uma grande quantia de dinheiro, para usar a criança como um novo Receptáculo em potencial. Depois de tomar a custódia do menino, Jigen se apresentou como seu novo pai e o tranquilizou. Mais tarde, ele tentou transferir o Karma para Kawaki e mais outros quatorze meninos, em um experimento conduzido com a ajuda do cientista da Kara, Amado. Kawaki sendo a única criança a sobreviver ao processo. Apesar de prometer-lhe segurança, Jigen colocou Kawaki através de um treinamento cansativo para dominar o Karma e constantemente o oprimia, mostrando que apenas tinha valor como um Receptáculo, golpeando o menino sempre que ele o questionava. Assim como o resto da Kara, Jigen também teve seu corpo amplamente modificado pelas Ferramentas Ninja Científicas de Amado. Isshiki planejou dar Jigen, juntamente com ele mesmo ainda vivendo dentro do corpo do monge, como alimento para a Dez-Caudas, a fim de cumprir os requisitos para que a besta florescesse em uma Árvore Divina, mesmo que o Fruto de Chakra resultante fosse de menor qualidade devido à má saúde e força do sacrifício. ",
      "O corpo de Jigen esteve presente em alguns acontecimentos enquanto controlado por Isshiki, como as reuniões da Kara, interações isoladas com membros, a tomada de poder do Dez-Caudas e a sequente batalha contra as Crianças da Profecia, onde brevemente foi capaz de expressar emoções, apesar do controle. Mais tarde, após a luta contra Koji Kashin, o corpo de Jigen colapsou e foi consumido por chamas, forçando a reencarnação de Isshiki através do Karma.",
      "Jigen era um monge regular até ser possuído por Isshiki, mas foi capaz de suportar parte de seu poder"
    ],
    "info": {
      "Estado": "Morto",
      "Sexo": "Masculino",
      "Ocupação": "Monge",
      "Afiliação": "Kara"
    },
    "images": [
      "https://static.wikia.nocookie.net/naruto/images/1/17/Jigen_Anime.png/revision/latest?cb=20201221121938&path-prefix=pt-br"
    ]
  },
  "Kaguya Ōtsutsuki": {
    "about": [
      "A princesa Kaguya Ōtsutsuki (大筒木かぐや, Ōtsutsuki Kaguya) é a matriarca do clã Ōtsutsuki e mãe de Hagoromo Ōtsutsuki e Hamura Ōtsutsuki, que viveu muito antes da fundação das aldeias ocultas, durante uma era de guerras intermináveis entre a humanidade. Ela consumiu o fruto da Árvore Divina e se tornou a progenitora do chakra, além de fazer parte da criação da besta que se tornaria conhecida como Dez-Caudas.",
      "Como observado por seu filho, Hagoromo, Kaguya foi outrora verdadeiramente uma pessoa boa e carinhosa. No entanto, depois de obter a capacidade de manipular o poderoso chakra do fruto da Árvore Divina, Kaguya se tornou despótica e desenvolveu tanto um complexo de deus como um de messias, acreditando que por direito, o chakra pertencia apenas a ela e que só ela poderia proteger e unir o mundo. Apesar de inicialmente desejar a paz como os seus filhos e netos, Kaguya cedeu a corrupção de seu poder e perdeu a fé na capacidade da humanidade para fazer o que é certo, e optou por usar seu grande e terrível poder para submeter todos à sua vontade. Como Hagoromo observou, a humanidade em torno desse momento começou a temê-la como um demônio. Ela usa o pronome arcaico \"warawa\" (ワラワ) quando se refere a si mesma — um sinal de antiga nobreza.",
      "Kaguya também exibe um grau de afeto, como ela parece se importar muito profundamente sobre o mundo, vendo-o como um berçário que ela não quer que a humanidade danifique ainda mais. Embora ela tenha declarado abertamente que ela odiava seus próprios filhos por sua capacidade de exercer o chakra e criar o Dez-Caudas para recuperá-lo pela força, ela chorou abertamente quando olhou para Naruto Uzumaki e Sasuke Uchiha, os quais a fizeram se lembrar deles.",
      "Apesar de sua crença de que o chakra deve pertencer apenas a ela e ser um pouco obsessiva em recuperá-lo de todos os outros, ela ficou disposta a ouvir a sugestão de Zetsu Negro em matar Naruto para impedir que ele e Sasuke a selassem, embora ela tenha expressado relutância em ter que destruir um grande reservatório de chakra para preservar sua liberdade.",
      "Apesar de sua frieza, Kaguya pode, contudo, ser atordoada por eventos inesperados, como um dos ninjutsu pervertidos de Naruto a pegou desprevenida, permitindo-lhe acertar um golpe nela.",
      "Uma mulher de posse de características faciais muito delicadas, Kaguya também tinha o cabelo muito longo, arrebatadoramente branco que tocava o chão. Sua característica mais notável eram as duas saliências semelhantes a chifre que se projetavam em sua cabeça — apêndices herdados por seus dois filhos. Kaguya possuía o Byakugan, e também tinha um terceiro olho no meio da testa os quais as pálpebras se separavam verticalmente. Suas sobrancelhas eram cortadas muito curtas — um símbolo de nobreza, e ela usava um batom de tom escuro nos lábios e um esmalte de tom escuro em suas unhas compridas. Ela usava o quimono hime de gola alta transitória, que era decorado com linhas intrincadas e tomoe correndo pelo centro e as bordas do vestido.",
      "Quando seu poder sai de controle, Kaguya se transforma em um conglomerado das Bestas com Cauda. Seu corpo original se transforma em uma criatura semelhante a um coelho gigantesco na parte superior do corpo humanoide, com dentes irregulares e com Rinne Sharingan em sua testa. Em sua parte traseira se forma uma grande massa esférica de chakra com as cabeças das nove Bestas com Cauda emergindo a partir dela, junto com os braços de chakra. Quando Kaguya tem seus poderes despojados, ela reverte brevemente à sua forma de Dez-Caudas, com cada cauda terminando com a cabeça de uma das Bestas com Cauda e a décima terminando com a cabeça de coelho."
    ],
    "info": {
      "Estado": "Incapacitada",
      "Sexo": "Feminino",
      "Espécie": "Ser Celestial",
      "Clã": "Clã Ōtsutsuki",
      "Kekkei Mōra": "Rinne Sharingan",
      "Kekkei Genkai": "Liberação de Gelo (Apenas Game)",
      "Classificação": "Tipo Sensor",
      "Ocupação": "Princesa",
      "Afiliação": "País dos Ancestrais (Apenas Anime)",
      "Parceiro": "Isshiki Ōtsutsuki"
    },
    "images": [
      "https://static.wikia.nocookie.net/naruto/images/6/6e/Rinne_Sharingan_de_Kaguya_%28Anime%29.png/revision/latest?cb=20200512181028&path-prefix=pt-br"
    ]
  },
  "Hagoromo Ōtsutsuki": {
    "about": [
      "Hagoromo Ōtsutsuki (大筒木ハゴロモ, Ōtsutsuki Hagoromo), conhecido mundialmente como o Sábio dos Seis Caminhos (六道仙人, Rikudō Sennin), era uma figura lendária praticamente divina que fundou o ninshū. Ele era filho da Princesa Kaguya Ōtsutsuki e ao lado de seu irmão gêmeo fraterno, foram os primeiros a nascerem com o mesmo chakra poderoso herdado de sua mãe. Tanto ele quanto seu irmão derrotaram sua mãe, que havia se tornado o aterrorizante Dez-Caudas, em uma batalha e ele selou a poderosa besta dentro de si mesmo, fazendo assim Hagoromo se tornar o primeiro jinchūriki.",
      "Hagoromo foi um homem que buscou a paz, espalhando sua sabedoria em todo o mundo. Ele foi excepcionalmente sábio, como ele foi capaz de provocar uma grande mudança em todo o mundo, simplesmente disseminando os princípios do chakra e sua religião. Ele também parecia se importar muito com os Bijū, quando eles ainda estavam com ele; dando a cada um deles um nome como um sinal de sua individualidade, e disse para eles que não importa o quão longe eles cresçam, eles estariam sempre juntos, e um dia iriam ser levados para o caminho certo. Em contrapartida, os Bijū mostraram possuir respeito e adoração para com o Sábio. Kurama ainda derramou uma lágrima com o pensamento de sua morte iminente, o que sugere que os animais podem até tê-lo visto como uma espécie de figura paterna.",
      "Durante sua reunião com Naruto, Hagoromo mostrou ser uma pessoa muito paciente e composta, não sendo afetado pelas explosões de Naruto. Ele era um homem muito inteligente, capaz de aprender metodicamente novas formas de estudo, incluindo a língua e a cultura.",
      "No anime, em sua juventude, Hagoromo era um jovem alto e deslumbrante, que, chamou bastante a atenção do público alvo. Por ter sido influenciado pelo chakra de sua mãe, ele recebeu alguns chifres em sua testa. Sua pele era morena, e ele não tinha sobrancelhas. O seu cabelo era castanho um pouco claro e espetado, ainda tendo uma tonalidade um pouco mista, aperfeiçoando de um modo especial, e prendendo uma das mechas de seus cabelos em um acessório antigo, que servia como um prendedor. Apesar de não ser usuário do Byakugan, ele tinha olhos semelhantes, estes recebendo um acabamento em lilás. Posteriormente, seus olhos alteraram-se devido ao despertamento do Sharingan.",
      "Em razão de seu estilo próprio, ele tinha características únicas que o tornavam totalmente exemplar. Sua altura e peso colaboravam muito para seus vestes, evidenciando uma melhor alteração fisionômica. No anime, o seu vestuário era bastante simples, dado a situação que se encontravam na época, bem como o estilo que era aderido. Ele usava um quimono branco longo, com magatama envoltas da parte do pescoço e, golas altas. Atrás deste quimono, tinha um símbolo e outras nove magatamas, referenciando algum tipo de cultura. Abaixo dele, ele usava uma camisa azul marinho de cacharel, que possivelmente se estendia até a posição de sua calça da mesma cor e customização que a última. Era possível observar que também empregou o uso de luvas, que tinham uma colocação similar de suas sandálias longas que separava o hálux dos demais dedos do pé.",
      "Na proporção em que ele envelheceu, Hagoromo parece ter recebido uma mudança de cor de pele, estando com uma pele mais clara do que no passado e, seus chifres se tornaram mais franzinos. Pelo tempo vivido, ele também adquiriu rugas profundas em todo seu rosto, ganhando principalmente um destaque próximo aos olhos e bochecha. A cor de seu cabelo se tornou um pouco mais avermelhada do que o comum, embora continuasse em um tom distinto do castanho claro, e, recebeu um cavanhaque longo e aparentemente toucado. Com o passar do tempo, agora tendo poderes mais avançados do que antigamente, ele desperta o Rinnegan em ambos olhos, bem como no centro de sua testa, é possível ver a marca de um outro Rinnegan vermelho. Em cada uma de suas mãos, havia símbolos, na direita sendo um símbolo de sol enquanto na esquerda era um símbolo de lua. O seu modo de vestir não alterou-se tanto, permanecendo no mesmo estilo de sempre, modificando-se em geral apenas alguns acessórios básicos utilizados na vestimenta ou em seu próprio corpo. No atual, ele não usava nenhuma roupa por baixo aparentemente, sendo um quimono branco e qualquer traje que cubra suas partes inferiores da cintura. Identicamente, ele passou a utilizar um colar de magatamas em seu pescoço.",
      "Ao lado de Hamura, Hagoromo nasceu como um dos dois filhos de Kaguya Ōtsutsuki, uma princesa que comeu o Fruto de Chakra proibido do Shinju, que aparece uma vez à cada milênio, em um esforço para ganhar habilidades semelhantes a um deus, que ela usou para pôr fim às guerras constantes durante essa era. Como resultado, Hagoromo nasceu com a habilidade de manipular o mesmo tipo de chakra poderoso como sua mãe. Em sua adolescência, Hagoromo e seu irmão viviam na ignorância da verdadeira natureza de sua mãe. Enquanto sua terra natal continuava prosperando, as pessoas desapareciam periodicamente, devido a um ritual sagrado para a Árvore Divina. Certo dia, os irmãos foram abordados por Gamamaru, que revelou-lhes que, além do pico das montanhas próximas, existia a verdade escondida sobre o ritual. Embora de início, ignorando as palavras do sapo, Hagoromo cresceu angustiado quando uma garota que morava no local, no qual ele se importava muito, chamada Haori, tornou-se parte do ritual. Quando os irmãos confrontaram sua mãe, pedindo o fim dos rituais, Kaguya ignorou o pedido, simplesmente dizendo que esse ritual era necessário. Finalmente, decidiram ir investigar, e então, os dois irmãos ficaram horrorizados ao saber que os cidadãos desaparecidos estavam sendo sacrificados para a Árvore Divina. Hagoromo ficou transtornado ao ver o cadáver de Haori, despertando o Sharingan, graças ao seu sofrimento. Querendo saber mais, os irmãos procuraram Gamamaru. Ele revelou a eles a história de sua mãe, que veio à Terra e usou o fruto da Árvore Divina, a fim de ganhar um grande poder e escravizar grande parte da humanidade através do Tsukuyomi Infinito, incluindo seu pai. Eles então decidiram que precisavam de mais poder para enfrentar Kaguya, e pediu para Gamamaru lhe ensinar o senjutsu. Enquanto Hagoromo dominava rapidamente a arte do senjutsu, Kaguya acabou chegando mais cedo à aldeia, e pressionou Hamura ao perceber que ele mentiu sobre a real localização de seu irmão mais velho."
    ],
    "info": {
      "Estado": "Morto",
      "Sexo": "Masculino",
      "Aniversário": "6 de Agosto",
      "Altura": "Parte II: 186 cm",
      "Peso": "Parte II: 69 kg",
      "Espécie": "Híbrido de Humano e Alienígena",
      "Clã": "Clã Ōtsutsuki",
      "Kekkei Mōra": "Rinnegan",
      "Kekkei Genkai": "Sharingan (Apenas Anime)",
      "Bijū": "Dez-Caudas",
      "Classificação": "Jinchūriki",
      "Ocupação": "Monge",
      "Afiliação": "País dos Ancestrais (Apenas Anime)"
    },
    "images": [
      "https://static.wikia.nocookie.net/naruto/images/d/da/Hagoromo_%C5%8Ctsutsuki_%28Infobox%29.PNG/revision/latest?cb=20200212172134&path-prefix=pt-br",
      "https://static.wikia.nocookie.net/naruto/images/b/b5/Hagoromo_Jovem.png/revision/latest?cb=20160523051635&path-prefix=pt-br"
    ]
  },
  "Hamura Ōtsutsuki": {
    "about": [
      "Hamura Ōtsutsuki (大筒木ハムラ, Ōtsutsuki Hamura) era o filho da Princesa Kaguya Ōtsutsuki e o irmão gêmeo de Hagoromo Ōtsutsuki. Ao lado de seu irmão, ele foi um dos primeiros humanos a nascer com chakra. Hamura também foi o antecessor do clã Hyūga e fundador dos shinobi da Lua.",
      "Como ele escolheu selar sua mãe, que terminou o seu reinado de terror, Hamura era um homem que acreditava em paz e liberdade. Além disso, ele era muito obediente, enquanto ele permaneceu na Lua para guardar o corpo selado de Kaguya. Apesar de se rebelar novamente contra sua mãe, Hamura ainda a amava, entendendo que todas as coisas imorais que ela fez foi para proteger da sua própria maneira tudo o que amava. E por isso, Hamura escolheu ficar perto do selo de Kaguya. Hamura ainda tinha uma grande dose de lealdade com Hagoromo, ele deseja proteger o mundo que seu irmão havia criado, mesmo durante mil anos após sua morte. Em sua adolescência, Hamura mostrou-se ser um pouco mais imprudente e impaciente, rapidamente expressando sua opinião e usando a sua autoridade para manter a paz.",
      "Hamura era um homem alto, de olhos brancos com traços característicos e saliências com chifre na testa herdado de sua mãe. Ele também não tinha sobrancelhas e seus cabelos eram de cor clara longos com franja penteada para a esquerda, com um único bloqueio na altura do queixo, que pendia do lado direito de seu rosto. Ele usava um quimono de corpo inteiro claro com um padrão de seis magatama pretos em torno de uma gola alta e calças escuras. Ele teve sua espada na bainha presa ao seu quadril esquerdo. Ele também tinha uma forma de Lua crescente escura representando a marca Yin na palma da mão esquerda.",
      "Kaguya Ōtsutsuki deu à luz filhos gêmeos, os primeiros humanos a nascer com chakra. Ele é o gêmeo mais jovem.",
      "Uma vez Hagoromo voltou a enfrentar Kaguya, a mãe desencadeou Hamura para lutar Hagoromo, depois de ter feito lavagem cerebral nele antes. Em um plano arriscado, Hagoromo escolheu ferir gravemente seu irmão para libertá-lo do controle de Kaguya, antes de curá-lo com uma etiqueta de selo especial dada pelo Gamamaru. Isso também permitiu que Hagoromo manifesta-se o seu Mangekyō Sharingan e Rinnegan, respectivamente. Kaguya percebeu que ambos Hamura e Hagoromo também tinham a habilidade de empunhar chakra, Kaguya, como o Dez-Caudas, tentou recuperar à força seu chakra. Eventualmente, Hagoromo e Hamura conseguiram derrotar e selar ela dentro de Hagoromo. Algum tempo depois, Hagoromo criou as bestas com cauda e extraiu a Estátua Demoníaca do Caminho Exterior de seu corpo para selá-lo na Lua, resultando em sua morte. Antes da morte de seu irmão, Hamura e o resto do seu clã partiram para a Lua, a fim de guardar os restos de sua mãe selados. Hamura acabou por morrer junto com a maior parte do clã, só com Toneri sobrevivendo após a passagem de mil anos.",
      "Hamura, ao lado de seus companheiros de clã falecidos, apareceu diante de Hinata Hyūga para discutir como ela, como a \"Princesa do Byakugan\" (白眼姫, Byakugan-hime), que foi a única capaz de destruir o altar Tenseigan, que estava sendo usado para controlar a Lua por seu descendente Toneri após interpretar erroneamente a sua vontade. Com isso, ele transferiu o seu próprio poder para Hinata para dar-lhe a capacidade de resistir ao orbe de chakra de Toneri, bem como o poder de destruir o altar de Tenseigan.",
      "Uma das figuras mais poderosas da história, ele foi capaz de derrotar o Dez-Caudas na batalha junto de seu irmão. Na batalha Hamura empunhava uma espada com proficiência presumível, bem como um shakujō﻿."
    ],
    "info": {
      "Estado": "Morto",
      "Sexo": "Masculino",
      "Aniversário": "6 de Agosto",
      "Altura": "Parte II: 185 cm[3]",
      "Espécie": "Híbrido de Humano e Alienígena",
      "Clã": "Clã Ōtsutsuki",
      "Kekkei Genkai": "Byakugan",
      "Ocupação": "Líder do ramo secundário do Clã Ōtsutsuki",
      "Afiliação": "Lua"
    },
    "images": [
      "https://static.wikia.nocookie.net/naruto/images/9/93/Hamura_%28Pt._III%29.png/revision/latest?cb=20160115133854&path-prefix=pt-br",
      "https://static.wikia.nocookie.net/naruto/images/b/b0/Hamura_%28The_Last%29.png/revision/latest?cb=20160115133823&path-prefix=pt-br"
    ]
  },
  "Momoshiki Ōtsutsuki": {
    "about": [
      "Momoshiki Ōtsutsuki (大筒木モモシキ, Ōtsutsuki Momoshiki) é um membro do clã Ōtsutsuki.",
      "Momoshiki era tipicamente calmo, recolhido e calculista. No entanto, ele era propenso a demonstrar tendências sádicas, o que foi mostrado durante o seu ataque juntamente com Kinshiki em Konoha, onde ele riu depois de ver os cidadãos angustiados ao disparar seus ataques elementais. Momoshiki também tinha um complexo de superioridade severo e pensava muito pouco nas outras pessoas além de si mesmo, chamando Naruto, Sasuke, Boruto e Sarada de \"seres inferiores\". Da mesma forma, ele também se importava muito pouco com outras pessoas, mesmo com seu companheiro mais próximo. Quando ele estava em uma situação difícil, ele absorveu Kinshiki sem um segundo pensamento, a fim de reivindicar mais poder para si mesmo.",
      "Semelhante a Boruto Uzumaki no início do filme, Momoshiki também não estava interessado no trabalho duro, preferindo absorver e usar as técnicas dos outros em vez de confiar em sua própria força pessoal. Momoshiki enojava qualquer tipo de esforço, e ele ficou muito irritado quando suas roupas foram arrancadas durante sua batalha final contra os seus inimigos Ele também é muito desperdiçador com seus poderes, nunca implementando quaisquer tentativas estratégicas para conservar seu chakra, e sempre dando por certo que ele simplesmente será capaz de reabastecer seu chakra com a \"Panaceia Cinábrio\" (Fruto de Chakra), e com o chakra de qualquer ataque que ele absorva, e que seus poderes sozinhos lhe garantem vitórias. Devido a sua personalidade preguiçosa, ele foi facilmente intimidado quando oponentes poderosos o suficiente representaram uma ameaça para ele após descobrirem sua fraqueza e usarem taijutsu para lutar com ele. Sasuke e Naruto concordaram que a personalidade de Momoshiki é uma imagem espelhada da de Sasuke quando ele estava inclinado a matar Itachi.",
      "Momoshiki tinha a pele pálida, cabelo branco com uma tonalidade azul-claro que ele mantinha em um longo rabo de cavalo. Seu cabelo era repartido ao meio em um padrão ziguezague, e sua cabeça era adornada com um par de chifres planos e curvados que lembravam chifres de touros (ao contrário de Kaguya, que se parecia com orelhas de coelho). Ele tinha as características faciais delicadas e as sobrancelhas eram cortadas muito curto como um símbolo de nobreza. Ele vestia uma tradicional túnica kariginu branca de caça, um par de tengu-geta, e uma única luva preta em sua mão esquerda, com um buraco cortado na palma para exibir o Rinnegan que era da cor vermelha (roxa no mangá e novela). Ele também usava um véu transparente sobre sua cabeça.",
      "Após absorver Kinshiki Ōtsutsuki, a aparência de Momoshiki sofreu uma drástica mudança; seu corpo torna-se flexível e é coberto por marcas negras, seus chifres tornam-se muito mais longos e curvam-se para trás, e todos os seus dōjutsu ficando dourados, além de despertar um terceiro Rinnegan em sua testa.",
      "Já no filme, pós absorver Kinshiki Ōtsutsuki, a aparência de Momoshiki sofreu uma drástica mudança incluindo; esclera preta, íris branca, pele vermelho escuro, um queixo pontiagudo, colmilhos, garras em suas mãos e pés, cabelo branco, rabo de cavalo ampliado, além de ficar muito mais pontiagudo, marcas brancas sob os olhos e um enorme aumento de tamanho. Seu Rinnegan em suas palmas ficou roxo e ele despertou um terceiro em sua testa.",
      "Momoshiki e seu subordinado, Kinshiki Ōtsutsuki, originaram-se a partir de um local desconhecido, que também contém seu próprio Shinju, cujo fornecimento de energia foi esgotado. Como Kaguya Ōtsutsuki, eles também queriam coletar todo o chakra e transformá-lo em um novo fruto de chakra, que iria conceder poder ilimitado, a juventude eterna e imortalidade. Com medo de sua chegada, Kaguya criou o Exército de Zetsu Branco, a fim de se defender de um encontro com eles e não permitir que eles tentassem roubar seu chakra. Suas ações e paradeiro durante os vários séculos entre os dois selamentos separados de Kaguya é em grande parte desconhecido, e não está claro por que esperaram tanto tempo para viajar para a Terra e tentar realizar seus objetivos."
    ],
    "info": {
      "Estado": "Incapacitado",
      "Sexo": "Masculino",
      "Idade": "Boruto: +1000 anos",
      "Altura": "Boruto: 176 cm",
      "Espécie": "Alienígena",
      "Clã": "Clã Ōtsutsuki",
      "Kekkei Genkai": "Byakugan",
      "Afiliação": "Espaço Ōtsutsuki",
      "Parceiro": "Kinshiki Ōtsutsuki"
    },
    "images": [
      "https://static.wikia.nocookie.net/naruto/images/6/68/Momoshiki.jpg/revision/latest?cb=20180515230205&path-prefix=pt-br"
    ]
  },
  "Itachi Uchiha": {
    "about": [
      "Itachi Uchiha (うちはイタチ, Uchiha Itachi) foi um prodígio do clã Uchiha de Konohagakure. Ele se tornou um criminoso internacional depois de assassinar seu clã inteiro, poupando apenas seu irmão mais novo, Sasuke. Ele se juntou a Akatsuki, onde ele entrou em frequentes conflitos com Konoha e seus ninjas, incluindo Sasuke, que procurou vingar sua família. Depois de morrer durante uma batalha com Sasuke, as motivações de Itachi foram reveladas serem mais complicadas do que pareciam ele só queria proteger seu irmão e a vila, permanecendo um shinobi leal a Konohagakure até o fim.",
      "Desde a tenra idade, Itachi era tranquilo e perspicaz. Ele viveu à distância, observando os indivíduos e ideias sem se envolver diretamente para que ele pudesse entendê-los completamente. Por esta razão ele nunca teve a lealdade hipócrita ao seu clã que era tão comum entre os Uchiha; embora ele amasse sua família e queria o melhor para eles, ele sabia que havia coisas mais importantes do que as aspirações dos Uchiha.",
      "Apesar de ser um pacifista por natureza, Itachi sentiu que suas próprias necessidades eram secundárias para o bem maior e; para esse fim, ele se tornou um shinobi. Ele treinou incansavelmente para melhorar a si mesmo o mais rápido que pôde e se submeteu a todas as inconveniências da vida shinobi sem se queixar, pela simples motivação de ser útil aos outros. Sendo um ninja extremamente habilidoso, Itachi podia abordar os problemas com menos violência do que os outros fariam, satisfazendo sua natureza pacífica. Estes dois extremos de sua personalidade entrou em conflito quando os eventos o direcionou para o Massacre do Clã Uchiha; com ele não querendo prejudicar a sua família e buscando uma solução pacífica, mas sabendo que o caminho com o menor derramamento de sangue seria o extermínio do clã. Quando a inevitabilidade do massacre se tornou mais evidente, a atitude normalmente educada de Itachi para com o seu clã se tornou mais violenta, criticando-o abertamente e atacando as escolhas que selaram o destino de seu clã e o seu próprio.",
      "Apesar dos traumas que ele sofreu por matar sua própria família, Itachi não culpa aqueles entre a liderança de Konoha que lhe deu a missão; embora ele não confiasse em Danzō Shimura em um nível pessoal, ele sabia que Danzō só tinha os melhores interesses para a aldeia em seu coração. Mas Itachi – em parte pela necessidade de se juntar a Akatsuki – ficou muito alterado após o massacre, raramente ou nunca mostrando emoção. Ele se tornou mais propenso a demonstrações de força e permitia certos hábitos violentos de seu parceiro, Kisame Hoshigaki, sob o pretexto de que ele promovia os objetivos da Akatsuki. Itachi não conseguia se manter totalmente em seu caminho pacifista, optando pelo confronto ou ordenando Kisame se a probabilidade de danos colaterais se tornava muito elevada para si ou para os outros. Apesar de Kisame, às vezes, protestar, ele considerava Itachi um bom amigo e passava a ouvir as suas instruções.",
      "A proteção de Konoha sempre foi a vanguarda na mente de Itachi,",
      "A segurança de Sasuke finalmente convenceu Itachi à matar o resto dos Uchiha, acreditando que sua própria condenação valeu a pena para assegurar a sobrevivência de Sasuke. Mesmo que ele tenha feito isso por Sasuke, Itachi quis ser punido por seus crimes e escolheu Sasuke como o único a tomar a vingança contra ele. Para empurrar Sasuke nesse sentido, Itachi escondeu a verdadeira razão por detrás de suas ações e, em vez disso, assumiu uma persona de um homem que não tinha amor por seu irmão mais novo. Assumindo essa persona, Itachi se preocupava com Sasuke só por causa dos olhos que ele poderia tomar para ganhar o Mangekyō Sharingan Eterno. Suas ações na Akatsuki foram feitas para reforçar essa persona, e sempre que ele encontrava Sasuke ao longo dos anos ele passava a insultar sua fraqueza e encorajá-lo a ficar forte o suficiente para matá-lo. Seu plano era que, uma vez que ele tivesse sido morto por Sasuke, seu irmão seria considerado um herói. Itachi nunca quis revelar a Sasuke a verdade sobre o massacre Uchiha, e se ele descobrisse, Itachi esperava que a memória de um irmão mais velho odioso iria levá-lo a não acreditar.",
      "Depois que ele morreu e foi reencarnado, Itachi descobre que seus planos fracassaram, em grande parte; Sasuke não é um herói e ele seguiu outro caminho após descobrir a verdade sobre Itachi. Naruto Uzumaki aponta para Itachi a falha em seus planos: ele estava tentando manipular Sasuke ao invés de ser honesto com ele e não confiava em sua própria força."
    ],
    "info": {
      "Estado": "Morto",
      "Sexo": "Masculino",
      "Aniversário": "09 de Junho",
      "Idade": "Parte I: 17-18",
      "Altura": "Parte I: 175.2 cm",
      "Peso": "Parte I: 57.1 kg",
      "Tipo Sanguíneo": "AB",
      "Clã": "Clã Uchiha",
      "Kekkei Genkai": "Sharingan",
      "Classificação": "Rank S",
      "Ocupação": "Capitão da Anbu (Anterior)",
      "Afiliação": "Konohagakure",
      "Times": "Time Ro (Apenas Anime)",
      "Parceiro": "Jūzō Biwa (Apenas Anime)",
      "Patente Ninja": "Fase I:  Anbu",
      "Registro Ninja": "012110",
      "Graduação (Genin)": "7 anos",
      "Graduação (Chūnin)": "10 anos"
    },
    "images": [
      "https://static.wikia.nocookie.net/naruto/images/2/24/Itachi-Uchiha.png/revision/latest?cb=20181104200812&path-prefix=pt-br"
    ]
  },
  "Shikamaru Nara": {
    "about": [
      "Shikamaru Nara (奈良シカマル, Nara Shikamaru) é um membro do clã Nara de Konohagakure. Apesar de ser preguiçoso por natureza, Shikamaru tem um intelecto raro que constantemente lhe permite prevalecer em combate. As responsabilidades que esse intelecto gera para ele frequentemente o deixam aborrecido, mas ele as aceita de bom grado, para que possa estar a serviço de seus companheiros do Time Asuma, e para provar a si mesmo e às gerações do passado e do futuro o seu valor. Anos mais tarde, ele se casa com Temari e tem um filho chamado Shikadai Nara. Depois da nomeação de Naruto Uzumaki como Hokage, Shikamaru se torna seu conselheiro pessoal e assistente.",
      "Quando ele era um genin, Shikamaru Nara era o tipo de criança sem entusiasmo, que gostava de ver nuvens. Ele preferia não se envolver em atividades \"problemáticas\", fingindo estar ocupado para evitar a responsabilidade. Ele também não gosta de lutar, considerando que, como a maioria das coisas isso também é \"problemático\". Ele tem plena consciência deste lado da sua personalidade. Ele até nomeou-se \"o número um em fugir\" ou \"o covarde número um\".",
      "No entanto, quando o dever chama, Shikamaru tem uma forte bússola moral e sentido de compromisso para com os seus companheiros. Mesmo que, por seu próprio testemunho, ele não tenha coragem, ele vai sacrificar-se e enfrentar a morte quase certa, para o bem de seus amigos e/ou moradores sem um segundo pensamento. Por causa de sua habilidade de liderança nata, ele foi o primeiro genin dos Nove Novatos a se tornar um chūnin. O peso das decisões que ele deve fazer como um chūnin e, portanto, líder da equipe fizeram com que Shikamaru amadurecesse rapidamente. Isto foi mais evidente após a morte de Asuma. Ele prometeu proteger e, posteriormente, orientar a filha de Asuma, para que a criança possa crescer e se tornar um \"adulto legal\" como Asuma. O senso de dever e compromisso com o futuro de sua aldeia também fizeram Shikamaru refletir em sua decisão de fazer cumprir a recente decisão dos 11 de Konoha em parar Sasuke Uchiha a qualquer custo, mesmo em face de possíveis objeções em nome dos membros originais do Time 7. Ele também resolve ser o assistente de Naruto, pelo fato de que ele nunca mais quer que Naruto sofra com a mesma solidão que ele sofreu durante sua infância novamente.",
      "Chōji Akimichi é o melhor amigo de Shikamaru. Ele respeita e confia nele. Ele diz que, se tivesse que lutar contra Chōji no Exame Chūnin ele desistiria. Depois de ele deixar Chōji para lutar sozinho contra Jirōbō, Shikamaku diz ao resto da equipe que Chōji é mais forte do que qualquer outro nesta equipe.",
      "Shikamaru gosta de jogar jogos de pensamento, jogos estes que normalmente homens mais velhos jogam, como Shōgi e Go (seu professor, Asuma, chegou a dizer em um ponto \"Esse garoto é como um homem velho. Ele gosta de fazer as coisas devagar.\").",
      "O traço de caráter mais distintivo de Shikamaru é que ele considera a maioria das mulheres mandonas e \"problemáticas\", principalmente Temari, sua mãe e Ino. Ele geralmente define-as como agressivas, exigentes e às vezes até mesmo assustadoras. Considerando a personalidade tirânica de sua mãe, isso não é muito surpreendente. Seu pai também tem a mesma atitude, apesar de ter se casado com Yoshino. Quando Shikamaru questionou o pai sobre por que ele se casou com uma mulher dominadora, Shikaku respondeu que mesmo a mulher mais difícil vai mostrar o seu lado suave para o homem que ela ama. No entanto, Shikamaru é geralmente cortês com as mulheres, fazendo-lhes favores e evitando brigas com elas. Ele sente que os homens, como ele, devem ser seus protetores e não o contrário. Apesar de este último ponto, ele lutou exclusivamente somente contra mulheres durante a Parte I do mangá, embora por causa de circunstâncias que foram em sua maioria fora de seu controle. Sua visão niilista sobre as mulheres também se estende ao casamento, como visto em seu sonho no Tsukuyomi Infinito, onde Shikamaru sonha em ver seus pais e vários outros casais, como seu sensei, observando que o casamento é muito problemático para si mesmo. Ironicamente, mais tarde ele acaba se casando com Temari (uma mulher com personalidade semelhante à sua mãe), que dá à luz ao seu filho, Shikadai.",
      "Ele expressou um maduro e modesto interesse especial no casamento e criar uma família. Ele espera \"se casar com uma garota normal que não seja muito feia e nem muito bonita. Ter dois filhos, primeiro uma menina, então um menino. Aposentar depois que minha filha se casar e meu filho se tornar um ninja bem sucedido, e passar o resto da minha vida jogando Shōgi ou Go. Então morrer de velhice antes da minha esposa\"."
    ],
    "info": {
      "Sexo": "Masculino",
      "Aniversário": "22 de Setembro",
      "Idade": "Parte I: 12-13",
      "Altura": "Parte II: 170",
      "Peso": "Parte I: 42-42.9",
      "Tipo Sanguíneo": "AB",
      "Clã": "Clã Nara",
      "Ocupação": "Representante da Quarta Divisão das Forças Aliadas Shinobi",
      "Afiliação": "Konohagakure",
      "Times": "Time Asuma",
      "Patente Ninja": "Fase I:  Genin /  Chūnin",
      "Registro Ninja": "012611",
      "Graduação (Genin)": "12",
      "Graduação (Chūnin)": "12"
    },
    "images": [
      "https://static.wikia.nocookie.net/naruto/images/6/6c/Shikamaru_Cl%C3%A1ssico.PNG/revision/latest?cb=20191130212438&path-prefix=pt-br",
      "https://static.wikia.nocookie.net/naruto/images/5/5e/Shikamaru_Nara_%28Infobox_-_Parte_II%29.PNG/revision/latest?cb=20141109154344&path-prefix=pt-br",
      "https://static.wikia.nocookie.net/naruto/images/6/6c/Shikamaru_%28Ep%C3%ADlogo%29.png/revision/latest?cb=20151227200439&path-prefix=pt-br"
    ]
  },
  "Ino Yamanaka": {
    "about": [
      "Ino Yamanaka (山中いの, Yamanaka Ino) é um membro do clã Yamanaka de Konohagakure. Ela e seus colegas do Time Asuma formam o Ino–Shika–Chō. Anos após o fim da Quarta Guerra Mundial Ninja, ela forma sua própria família com Sai e treina seu filho juntamente com a nova geração do Ino–Shika–Chō.",
      "Ino é descrita como relativamente alegre e pode ser mandona com as pessoas, especialmente com seus companheiros de equipe, se eles ficarem em seu caminho ou se seus comportamentos a incomodarem. Ela também é muito confiante, amável e sincera, e não tem medo de falar o que pensa.",
      "Ino tende à assumir o controle de seus companheiros devido às suas naturezas preguiçosas e indiferentes, como quando ela sugere que Chōji deve perder peso ou que Shikamaru precisa parar de ficar acomodado. Ela, no entanto, se preocupa claramente com eles, como mostrado por seu alívio quando Chōji sobreviveu aos seus ferimentos fatais. Shikamaru, apesar de pensar que a maioria das meninas são \"problemáticas\", normalmente não oferece resistência, não ficando disposto a lidar com a forma como ela reage, se as coisas não saírem do jeito que ela quer. Asuma reconheceu o controle que ela tem sobre os outros, e, ao morrer, ele diz a ela para cuidar de Chōji e Shikamaru, e garantir que eles não entrem em apuros e para manter os dois no caminho certo, e também para não perder para Sakura nem em ninjutsu, nem no amor.",
      "Ino possuí uma grande dose de orgulho sobre sua aparência, o que é evidente, mesmo durante seus dias mais jovens na Academia. Ela também requer um grande esforço para manter-se, bem como melhorar a sua aparência, como pode ser visto a partir de suas constantes dietas para perder peso, na crença de que isso irá torná-la mais atraente.",
      "Durante a Quarta Guerra Mundial Ninja, Ino demonstrou mais coragem e confiança tanto que ela não se intimidou quando ouviu Shikamaru dizer o quão poderosos os Irmãos Ouro e Prata eram e até mesmo disse a seus companheiros de equipe para não vacilarem. Mantendo a promessa que ela fez para Asuma, Ino resolveu colocar sua vida em risco, para proteger seus companheiros de equipe e sua aldeia, não importando o custo. No momento em que seu pai morreu, ele acreditou que ela tinha realmente florescido no trevo de arbusto da família Yamanaka, e orgulha-se de suas obrigações com seus amigos.",
      "Ino muitas vezes pensa em meninos. Ela é atraída por Sasuke e até mesmo chorou quando ele foi declarado um criminoso internacional, mostrando que ela ainda se preocupa com ele, apesar de sua descida para a escuridão. Confirma-se que ela o ama durante a Quarta Guerra Mundial Ninja, onde ela retrata ele como o \"amor\" que o trevo de arbusto simboliza. Quando ele retorna, Ino corre em direção à ele, apenas para ser parada por seus companheiros Shikamaru e Chōji. Ela também se sente atraída por Sai, principalmente porque ele é muito semelhante a Sasuke. Ela flerta com ele quando introduzido pela primeira vez. Na verdade, ela é tão atraída por eles que ela sonhou no Tsukuyomi Infinito que ambos Sai e Sasuke estavam brigando por ela.",
      "Anos mais tarde, a atração de Ino por Sai se aprofunda e os dois se casam e tem um filho chamado Inojin. Como uma mãe casada, sua personalidade permanece praticamente a mesma, já que ela assusta facilmente seu filho por seu atraso. Ao mesmo tempo, ela desenvolve um grande respeito pelas tradições e o legado de seu clã, sendo muito inflexível sobre a passagem sobre as técnicas dos Yamanaka para Inojin e continuando o costume de formar uma nova geração de Ino-Shika-Chō."
    ],
    "info": {
      "Sexo": "Feminino",
      "Aniversário": "23 de Setembro",
      "Idade": "Parte I: 12-13",
      "Altura": "Parte I: 149.3 - 151.2 cm",
      "Peso": "Parte I: 38.2-38.5",
      "Tipo Sanguíneo": "B",
      "Clã": "Clã Yamanaka",
      "Classificação": "Tipo Sensor",
      "Ocupação": "Botânica",
      "Afiliação": "Konohagakure",
      "Times": "Time Asuma",
      "Patente Ninja": "Fase I:  Genin",
      "Registro Ninja": "012604",
      "Graduação (Genin)": "12 anos",
      "Graduação (Chūnin)": "14 anos"
    },
    "images": [
      "https://static.wikia.nocookie.net/naruto/images/d/dd/Ino.png/revision/latest?cb=20180510114823&path-prefix=pt-br",
      "https://static.wikia.nocookie.net/naruto/images/7/71/Ino_%28Parte_II%29.png/revision/latest?cb=20151228124622&path-prefix=pt-br",
      "https://static.wikia.nocookie.net/naruto/images/1/1a/Ino_Epilogo_Adulta.png/revision/latest?cb=20151226163341&path-prefix=pt-br"
    ]
  },
  "Chōji Akimichi": {
    "about": [
      "Chōji Akimichi (秋道チョウジ, Akimichi Chōji) é um membro do clã Akimichi de Konohagakure. Embora seja sensível com relação ao seu peso, Chōji é, contudo, dedicado aos seus amigos, especialmente o Time Asuma. Anos mais tarde, ele se casa com Karui e tem uma filha.",
      "Chōji é uma pessoa muito gentil, educada e atenciosa. Essas características são ditas serem a sua maior força, tanto por seu pai, Chōza, como seu antigo professor, Asuma, enquanto sua maior fraqueza era a sua falta de auto-confiança. Chōji também tende a comer muito quando ele está com raiva. Desde a Parte II da série, no entanto, seus hábitos alimentares são mais controlados e já não interferem com seus deveres como um shinobi.",
      "Chōji tem uma amizade de longa data com Shikamaru. Os dois têm total confiança um no outro, com Shikamaru sendo uma das poucas pessoas que no passado viu a falta de capacidade atlética de Chōji, mas notou que ele tinha um coração bondoso; reconhecendo a verdadeira força de Chōji. Devido a isso, Chōji tem uma fé inabalável e lealdade para com Shikamaru e, se necessário, daria sua vida por ele, o que quase aconteceu durante sua batalha contra Jirōbō. Chōji também se preocupa profundamente por seu mentor, Asuma, e teve um momento difícil na luta contra ele durante a Quarta Guerra Mundial Shinobi, devido a não querer ferir seu próprio professor,",
      "Como afirmado por seu pai e professor, Chōji possuía muita pouca confiança em si mesmo e suas habilidades, que muitas vezes impediam suas ações ou mesmo a progressão em alguns aspectos.",
      "Chōji tem cabelo castanho, espetado, marcas de redemoinho nas bochechas, e como o resto do seu clã, ele tem um físico mais robusto. Desde sua infância, ele tem sido sempre bastante robusto, o que é uma necessidade em seu clã para executar suas técnicas, uma vez que convertem as calorias em chakra. Durante a Parte I, Chōji usava uma bermuda preta, um longo lenço branco, um haori verde de manga curta, sobre uma camisa verde-claro (retratado como branco no anime) com kanji obrigatório de seu clã para \"comida\" (食, shoku) sobre ele, pequenos brincos de argola, e suas pernas e braços eram envoltos em ataduras. Seu protetor de testa foi moldado em uma forma que permitia que dois tufos de cabelo ficassem para fora de cada lado.",
      "Durante a Parte II, ele ostenta um terno vermelho com armadura banhada em seu torso, braços e parte superior das pernas, o que é aparentemente o traje padrão para os shinobi de seu clã. A frente de sua armadura no peito possuí o kanji obrigatório para \"comida\" (食, shoku). Seu cabelo castanho cresceu até a cintura e ele também troca seus brincos de argolas para pregos, os quais ele ganha de Asuma. Durante a Quarta Guerra Mundial Shinobi, ele usa o colete padrão dos shinobi de Konoha sobre sua roupa. Após Chōji usar a Técnica do Tamanho Múltiplo, ele ganha duas marcas extras debaixo de ambos os olhos também.",
      "Dois anos após a Quarta Grande Guerra Shinobi, a aparência geral de Chōji muda um pouco, sendo mais gordo do que ele se considera. Seus cabelos agora são curtos e ele ostenta um pequeno cavanhaque no queixo. Sua roupa é basicamente a mesma, mas ele usa grandes protetores de braço e suas sandálias atingem suas panturrilhas. Anos mais tarde, o cabelo de Chōji cresce na altura dos ombros e é penteado para trás. Ele também ostenta um cavanhaque completo ao redor de sua boca."
    ],
    "info": {
      "Sexo": "Masculino",
      "Aniversário": "1 de Maio",
      "Idade": "Parte I: 12-13 anos",
      "Altura": "Parte I: 150.6-156.3 cm",
      "Peso": "Parte I: 62-69.3 kg",
      "Tipo Sanguíneo": "B",
      "Clã": "Clã Akimichi",
      "Ocupação": "Líder do Clã Akimichi",
      "Afiliação": "Konohagakure",
      "Times": "Time Asuma",
      "Patente Ninja": "Fase I:  Genin",
      "Registro Ninja": "012625",
      "Graduação (Genin)": "12",
      "Graduação (Chūnin)": "14"
    },
    "images": [
      "https://static.wikia.nocookie.net/naruto/images/a/a0/Ch%C5%8Dji_Akimichi_%28Fase_I%29.png/revision/latest?cb=20180301103542&path-prefix=pt-br",
      "https://static.wikia.nocookie.net/naruto/images/4/44/Choji_Parte_II.png/revision/latest?cb=20130806210848&path-prefix=pt-br",
      "https://static.wikia.nocookie.net/naruto/images/e/e8/Ch%C5%8Dji_Akimichi_%28Boruto_-_Anime%29.png/revision/latest?cb=20180301103810&path-prefix=pt-br"
    ]
  },
  "Rock Lee": {
    "about": [
      "Rock Lee (ロック・リー, Rokku Rī) é um shinobi de Konohagakure. Apesar de ele não ter certas habilidades tipicamente associadas com a vida como um ninja, Lee pretende compensar suas deficiências de qualquer maneira que puder. Recebendo treinamento especial a este respeito de seu professor, Might Guy, ele se torna um mestre em taijutsu e visa apenas ficar mais forte. Anos mais tarde, ele passa suas habilidades e métodos de treinamento para seu filho.",
      "Lee é extremamente enérgico, modesto, carismático e possuí excesso de entusiasmo. Apesar de sua natureza muito apaixonada, Lee também mostra fortes instintos, sempre estando focado nas missões que realiza, raramente perdendo a compostura, e notando a presença de pessoas ao seu redor, mesmo reconhecendo seus amigos. Ele é caracterizado como sendo o epítome de um \"cara legal\", tendo assumido muitas das peculiaridades da personalidade de Might Guy. Um traço tal é a sua aparente falta de senso comum, acreditando, por vezes, que ele pode conseguir o que quer por não querer isso. Em outras ocasiões, ele toma notas copiosas, mas esquece que ele não pode vê-los durante uma luta. Ele também tem um grande senso de honra, e respeita seus oponentes, recusando-se a guardar rancor contra aqueles que o derrotaram, e retornando favores para aqueles que o ajudaram. Isto foi demonstrado pela sua amizade com Gaara e perdoando-o por esmagar seu braço e perna, o que motivou a internação e quase encerrou sua carreira como um ninja. Lee sente que os outros devem mostrar o mesmo respeito para com os seus adversários, e fica revoltado quando alguém é desnecessariamente cruel com seus inimigos.",
      "Lee é conhecido por falar respeitosamente com os outros, sendo muito bom em ambas as versões de idioma Português e Japonês, e nunca usando contrações ou palavrões. Ele também usa japonês formal, aplicando-se os títulos próprios (\"-san\", \"-kun\", etc) para qualquer pessoa que encontra. No entanto, Lee refere-se à seus companheiros de equipe, Neji e Tenten, apenas por seus nomes próprios, o que implica que ele está perto o suficiente para que eles usem uma maneira tão informal para falar com eles. Seu relacionamento com Guy tem também o levado a adquirir muitos dos traços de Guy, além de sua personalidade, sua dedicação às suas promessas, assim como sua crença de que não se pode não gostar de alimentos, são características de Guy. Lee também carrega um pequeno livro e lápis para se lembrar das várias informações que Guy lhe deu ao longo do tempo.",
      "As tentativas de Lee para provar a si mesmo que ele é melhor são temas recorrentes de suas ações ao longo da série. Ele é geralmente otimista, e acredita que, com trabalho duro e paixão, ele pode superar um gênio natural, mas pode ser propenso à depressão, quando confrontado com retrocessos. Seu desejo de sucesso foi inicialmente mais evidente com a sua rivalidade com Neji, tendo aprendido com Guy que ter um rival irá fornecer incentivos para o sucesso. Neji, um ninja \"gênio\", encontrou os esforços de Lee de melhorar-se a ser em vão, acreditando que Lee seria preso como um \"fracasso\" para o resto de sua vida. Além disso, ao fazer uma promessa, Lee atribui a si mesmo tarefas árduas para completar no caso de ele não fazer jus às suas expectativas. Quando essa promessa é quebrada, geralmente por pouco, ele treina para impedir que isso aconteça novamente.",
      "Como tal, Lee resolveu provar que Neji estava errado, e confrontou outro \"gênio\", Sasuke Uchiha, numa tentativa de testar o seu valor. Enquanto Lee manteve o desejo de derrotar Neji em uma luta durante os Exames Chūnin, após a derrota eventual de Neji por Naruto Uzumaki, um outro chamado \"fracasso\", Lee tornou-se menos interessado ​​neste objetivo. Neji, rejeitando sua crença anterior sobre o destino, também pode ter contribuído para isso, como ele agora respeita Lee, acreditando que ele vai superar o talentoso com bastante trabalho.",
      "Pouco depois depois de conhecer o Time Kakashi, Lee revelou que gostava de Sakura Haruno, pedindo-lhe para ser sua namorada e prometeu protegê-la de qualquer perigo. Enquanto ela não parecia compartilhar esses sentimentos por ele, e considerou-o estranho, Lee manteve esses sentimentos, e saiu do seu caminho para ajudá-la durante todo o Exame Chūnin. Sakura se torna mais sensível depois disso, e soca Naruto sempre que ele insulta Lee.",
      "Apesar disso, Sakura não parece retornar qualquer sentimento romântico por Lee, como ela se refere a ele com o mais formal \"Lee-san\", em oposição a \"Lee-kun\". Após a conclusão dos Exames, o interesse de Lee em Sakura vai em grande parte sem solução no mangá. É ocasionalmente referenciado no anime, como quando Naruto lutou Lee no arco Lee Dōjō; Naruto se transformou em Sakura, fazendo com que Lee esquecesse a luta o tempo suficiente para Naruto atacá-lo. No entanto, quando Madara consegue lançar o Tsukuyomi Infinito na lua, Lee sonha que ganha o afeto de Sakura, o que sugere que ele ainda tem sentimentos românticos por ela."
    ],
    "info": {
      "Sexo": "Masculino",
      "Aniversário": "27 de novembro",
      "Idade": "Parte I: 13-14 anos",
      "Altura": "Parte I: 158.5 cm - 162.1 cm",
      "Peso": "Parte I: 46.6 kg - 47.5 kg",
      "Tipo Sanguíneo": "A",
      "Clã": "Clã Lee",
      "Ocupação": "Examinador dos Exames Chūnin (Apenas Filme)",
      "Afiliação": "Konohagakure",
      "Times": "Time Guy",
      "Patente Ninja": "Fase I:  Genin",
      "Registro Ninja": "012561",
      "Graduação (Genin)": "12",
      "Graduação (Chūnin)": "15"
    },
    "images": [
      "https://static.wikia.nocookie.net/naruto/images/9/97/Rock_Lee_Part_I.png/revision/latest?cb=20160926212512&path-prefix=pt-br",
      "https://static.wikia.nocookie.net/naruto/images/8/81/Rock_Lee.png/revision/latest?cb=20130729004436&path-prefix=pt-br",
      "https://static.wikia.nocookie.net/naruto/images/3/3f/Lee_%28Parte_IV%29.png/revision/latest?cb=20160704020337&path-prefix=pt-br"
    ]
  },
  "Kiba Inuzuka": {
    "about": [
      "Kiba Inuzuka (犬塚キバ, Inuzuka Kiba) é um membro do clã Inuzuka de Konohagakure. Tanto ele quanto seu companheiro canino, Akamaru, são membros do Time Kurenai.",
      "Kiba é frequentemente mal humorado e impulsivo (em contraste com seus companheiros de equipe, Shino e Hinata), e pode ser propenso a cometer erros quando ele fica agitado na batalha. Ele também gosta de combate, mesmo quando enfrenta adversários particularmente fortes. Ele se preocupa profundamente com Akamaru, e está disposto a fazer o que for necessário para protegê-lo. E, apesar de sua atitude bastante rude, muitas das ações de Kiba revelam que ele está muito perto de sua irmã mais velha, Hana, e continua a ser ferozmente leal ao seu clã e tem muito orgulho dele.",
      "Kiba argumenta frequentemente com Shino sobre qual curso de ação o grupo deve tomar, especialmente quando Shino aconselha cautela. Kiba muitas vezes vê-se como o líder do grupo, e torna-se ofendido com qualquer ação de Shino que ele perceba como um desafio a sua liderança. Parece que houve um concurso para a liderança do Time 8 durante Exame Chūnin, como Kiba disse que Hinata votou nele. Apesar de suas divergências com Shino, ele considera Shino um amigo, e respeita as suas capacidades de combate. Kiba tornou-se muito perto de Hinata e age fraternal em sua direção, mas tende a se preocupar com ela, pedindo que ela seja forte antes da segunda fase do exame, Kiba gosta de provocar Hinata com brincadeiras sobre sua afeição para Naruto Uzumaki. Isso geralmente inclui dizer que Naruto está perto, ou apenas mencionar suas reações com ele para outras pessoas, para sua vergonha. Apesar disso, eles têm uma forte amizade.",
      "No anime, principalmente nos arcos filler, é mostrado que Kiba também se dá bem com Naruto, apesar de seus argumentos. Este parece ser comprovado quando foi mostrado que Kiba, Akamaru, Naruto, Chōji e Shikamaru ignoravam aulas juntos e brincavam no parque. Esses três parecem ser alguns dos primeiros verdadeiros amigos que Naruto fez na aldeia. Eles também têm um pouco de uma rivalidade que decorre desde a infância. Ele mostrou ter se frustrado com o crescimento de Naruto e está determinado a superá-lo. Ele ainda mostrou admiração para com Naruto, afirmando que ele queria ser como ele.",
      "Kiba também sonha em se tornar o Hokage um dia e expressou esse desejo tanto durante sua luta com Naruto durante o Exame Chūnin, Em seu Tsukuyomi Infinito, Kiba sonha que é Hokage e também deseja criar um feriado nacional para todos os cães.",
      "Apesar de toda a selvageria e impulsividade de Kiba, quando ele vê Tamaki, ele geralmente fica em um estado de estupor apaixonado, onde ele congela e fica com uma perda de palavras. Isto é, então, imediatamente seguido por Kiba agir educadamente e controlar sua personalidade selvagem ao fazer conexões entre os dois que normalmente não fazem nenhum sentido real. Seu comportamento apaixonado é suficiente para fazer Akamaru e os ninneko se revoltarem e Shino ficar sem palavras (que vê um \"garoto-cão\" e uma \"garota-gato\" romanticamente envolvidos).",
      "A personalidade e o estilo de luta de Kiba são potenciados pela sua aparência selvagem. Apesar de claramente ser humano, ele tem várias características físicas mais semelhantes aos animais. Como a maioria de seu clã, ele tem cabelo castanho bagunçado, nítidos olhos negros com pupilas verticais, grandes dentes caninos, e suas unhas podem serem transformadas em garras. Ele também tem as distintas marcas vermelhas do clã Inuzuka em suas bochechas."
    ],
    "info": {
      "Sexo": "Masculino",
      "Aniversário": "7 de Julho",
      "Idade": "Parte I: 12-13 anos",
      "Altura": "Parte I: 151.2-152.5cm",
      "Peso": "Parte I: 43.3-44.7 kg",
      "Tipo Sanguíneo": "B",
      "Clã": "Clã Inuzuka",
      "Ocupação": "Modelo Comercial (Apenas Anime)[6]",
      "Afiliação": "Konohagakure",
      "Times": "Time Kurenai",
      "Parceiro": "Akamaru",
      "Patente Ninja": "Fase I:  Genin",
      "Graduação (Genin)": "12",
      "Graduação (Chūnin)": "14"
    },
    "images": [
      "https://static.wikia.nocookie.net/naruto/images/f/fb/Kiba_Inuzuka_%28Cl%C3%A1ssico%29.png/revision/latest?cb=20140823001353&path-prefix=pt-br",
      "https://static.wikia.nocookie.net/naruto/images/b/b1/Kiba_%28Parte_II%29.png/revision/latest?cb=20170530230546&path-prefix=pt-br",
      "https://static.wikia.nocookie.net/naruto/images/a/aa/Kiba_Inuzuka_%28Parte_IV%29_Anime.png/revision/latest?cb=20180125004022&path-prefix=pt-br"
    ]
  },
  "Asuma Sarutobi": {
    "about": [
      "Asuma Sarutobi (猿飛アスマ, Sarutobi Asuma) foi um jōnin do clã Sarutobi de Konohagakure, assim como um ex-membro dos Doze Guardiões Ninja. Ele também foi o líder do Time Asuma, que consistia em Shikamaru Nara, Ino Yamanaka e Chōji Akimichi.",
      "Asuma era um indivíduo tipicamente descontraído, e não se envolvia em coisas que não fossem absolutamente necessárias, como visto quando ele decidiu não ajudar a salvar Hinata Hyūga durante sua luta nos Exames Chūnin. Ele era um fumante inveterado, mas, apesar disso, ele interrompia abruptamente seu hábito em certas circunstâncias, como quando seu pai morreu,",
      "Apesar da personalidade muito contundente de Asuma, muitas vezes ele chamava seus alunos por suas principais características, um \"glutão\" (Chōji), uma \"matraca\" (Ino), e um \"preguiçoso\" (Shikamaru), apesar disso ele tinha um relacionamento muito bom com todos os três. Muitas vezes ele os levou para o Yakiniku Q para almoçar e jantar, onde frequentemente Chōji comia demais, fazendo Asuma ter que pagar mais e pedir desculpas enfaticamente ao proprietário. Para ajudá-los a superar suas naturezas de baixo desempenho, ele tentava usar o suborno e a enganação para manipulá-los a fazer o que ele queria. Isto foi visto mais com Chōji, o qual Asuma foi frequentemente capaz de seduzir em ação com a promessa de comida e até mesmo Shikamaru com quem ele teve que usar jogos como shōgi para avaliar seu nível de habilidade. Dentre seus alunos, Asuma passava mais tempo com Shikamaru. Asuma e Shikamaru muitas vezes jogavam shōgi ou Go em seu tempo livre, embora Asuma nunca tenha sido capaz de vencer Shikamaru.",
      "Ao longo da série, tinha sido fortemente sugerido que Asuma estava envolvido romanticamente com sua colega jōnin Kurenai Yūhi, tendo sido próximos durante a infância. Os dois apareceram juntos na maioria de suas cenas, e os outros personagens faziam disso um ponto a salientar sobre esse fato em várias ocasiões. Quando Kakashi Hatake encontrou os dois juntos em uma loja de bolinhos de massa, Kakashi perguntou se eles estavam em um encontro, para o qual Asuma respondeu rapidamente mudando de assunto. Durante a batalha de Asuma contra Hidan e Kakuzu, Kurenai foi muitas vezes mostrada se perguntando sobre o seu progresso, parecendo estar ansiosa. Quando ela soube de sua morte, ela caiu de joelhos enlutada. Mais tarde, ela colocou flores em seu túmulo durante seu funeral. A verdade sobre sua relação foi então clara quando Kurenai revelou que ela estava grávida de Asuma.",
      "Asuma era um homem alto, de pele bronzeada, olhos castanhos, cabelo preto e espetado, curto e barba. Sua roupa consistia no uniforme padrão dos ninja de Konoha, com as mangas arregaçadas até metade do caminho, colete, sandálias shinobi regulares e protetor de testa. Ele também usava um cinto que tinha o kanji para \"Fogo\" (火) marcado sobre ele em torno de sua cintura, um par de pulseiras pretas e ataduras enroladas em torno dos braços de suas mangas.",
      "Quando genin, ele usava uma camisa branca de manga curta, com um colar azul e preto sobre sua armadura de malha, juntamente com um colete branco simples, com um par de calças pretas e um cinto branco. No anime, foi mostrado que enquanto ele era um membro dos Doze Guardiões Ninja, ele usava uma camisa de manga comprida simples com bandagens nos braços, calças, uma faixa que denotava que ele era um guardião e uma jaqueta com gola de pele. Ele também usava suas facas de trincheira com ele nesse ponto.",
      "Asuma nasceu como filho de Hiruzen Sarutobi e, de Biwako Sarutobi. Durante a cerimônia de entrada da Academia, Asuma fez amizade com Kurenai Yūhi. Mais tarde, ele aplaudiu a seus colegas durante a terceira rodada dos Exames Chūnin. Por volta da época do ataque da raposa, ele, juntamente com os outros ninjas jovens também foi barrado pelo Pai de Kurenai de participar na defesa da aldeia. Alguns anos após o evento, Asuma se tornaria um tio para Konohamaru. Mais tarde, ele se tornou um Chūnin e mais tarde um Jōnin.  Cerca de sete anos antes do início da série, ele teve um desentendimento com seu pai, e deixou Konoha para perseguir seus interesses pessoais. Durante sua ausência, ele se tornou um dos Doze Guardiões Ninjas, um grupo que protegia o daimyō do País do Fogo, indicados pela faixa na cintura. Durante este tempo, ele desenvolveu uma forte amizade com o monge Chiriku, que viria a se tornar o monge chefe do Templo do Fogo. Antes de retornar a Konoha para retomar o serviço militar ativo, ele acumulou uma recompensa de 35 milhões de ryō no mercado negro, algo que parecia ser particularmente orgulhoso. Depois de voltar para a aldeia, retomou as suas funções jōnin. Cerca de 12 anos após o ataque do Nove-caudas, vendo o colega cair na auto-piedade mais profunda de perder Obito Uchiha e Rin Nohara, Asuma, juntamente com Might Guy e Kurenai decidiu falar com o terceiro Hokage, manifestando sua desaprovação de Kakashi sendo na Anbu com tanta amargura e sugeriu, em vez disso, que ele seja re-atribuído como um jōnin senei na esperança de restaurar a bondade de Kakashi."
    ],
    "info": {
      "Estado": "Morto",
      "Sexo": "Masculino",
      "Aniversário": "18 de Outubro",
      "Idade": "Parte I: 27-28 anos",
      "Altura": "Parte I: 190.8 cm",
      "Peso": "Parte I: 81.6 kg",
      "Tipo Sanguíneo": "O",
      "Clã": "Clã Sarutobi",
      "Afiliação": "Konohagakure",
      "Times": "Doze Guardiões Ninja",
      "Registro Ninja": "010829",
      "Graduação (Genin)": "9",
      "Graduação (Chūnin)": "12"
    },
    "images": [
      "https://static.wikia.nocookie.net/naruto/images/4/48/Asuma_Sarutobi.png/revision/latest?cb=20130806211344&path-prefix=pt-br",
      "https://static.wikia.nocookie.net/naruto/images/f/fc/Asuma.PNG/revision/latest?cb=20120628145044&path-prefix=pt-br"
    ]
  },
  "Shisui Uchiha": {
    "about": [
      "Shisui era um indivíduo muito humilde e realista. Ele nunca foi arrogante sobre suas próprias habilidades ou realizações, porém não estava acima de contar aos outros quando cometiam erros. Ao mesmo tempo, ele tinha uma mente aberta, nunca acreditando obstinadamente em um ideal único e se esforçou para ver essa natureza única da situação atual diante dele. Ele também foi mostrado sendo muito perspicaz e intuitivo mesmo em uma idade jovem, capaz de ver através da natureza emocional dos outros e também capaz de perceber os menores detalhes ao seu redor.",
      "Shisui foi também muito dedicado ao clã, razão pela qual a Polícia Militar de Konoha pediu-lhe para espionar Itachi. É por causa desta devoção que a polícia não acreditava que ele poderia ter cometido suicídio.",
      "Apesar de Shisui ter sido leal ao seu clã, ele era ainda mais dedicado para o bem estar de sua aldeia, um traço que seu próprio clã, aparentemente, ignora. Sua devoção à sua aldeia era tão forte, que ele nunca foi vítima de cair na Maldição de Ódio quando despertou seu Sharingan ou até mesmo seu Mangekyō Sharingan. Ele até chegou a tentar colocar o seu clã em um genjutsu, a fim de parar o seu golpe de Estado que levaria à  uma guerra civil. No entanto, isto acaba falhando quando Danzō roubou seu olho direito. Conhecendo a personalidade faminta por poder de Danzō, poderia levá-lo a roubar seu olho esquerdo, Shisui resolveu impedi-lo de ganhar tanto poder. Com isto em mente, ele confiou seu olho esquerdo para Itachi e lhe disse para proteger a vila, ainda com isso, Shisui foi capaz de morrer com um sorriso, sabendo que a aldeia estaria em boas mãos apesar de tudo que ele tinha passado antes de sua morte.",
      "Shisui ainda foi sagaz ao ponto de apagar sua própria existência para impedir que seu corpo acabasse caindo em mãos erradas, que inadvertimente, o impediu de ser reencarnado por Kabuto anos depois que por consequência seria forçado à lutar contra sua aldeia. Shisui também valorizava muito a noção de \"família\" como visto quando ele jurou nunca deixar as questões do clã destruir a relação entre Itachi e Sasuke. Ele também tinha um senso de humor, como pode ser visto quando desfrutava a difícil situação que ele colocou em Itachi quando Sasuke discutiu com Shisui sobre quem é o mais forte.",
      "Como Itachi, Shisui não parece gostar de matar pessoas e prefere usar métodos não-letais, sempre que possível, como mostrado quando ele usou um genjutsu para assustar o esquadrão de Ao quando foi afirmado que ele poderia ter matado toda sua equipe com facilidade. Shisui também usou um genjutsu em Danzō, que desapareceria em breve, em vez de matá-lo, quando este tentou roubar seus olhos.",
      "Tendo forte semelhança com seu antepassado Kagami Uchiha, Shisui também tinha cabelo curto, despenteado, de cor escura, olhos negros e um nariz relativamente amplo, e ele era bem definido com cílios, que foram virados para cima em cada extremidade. No anime, no entanto, essas linhas são interrompidas em vez de inteiras.",
      "Ele usava o traje padrão do clã Uchiha, que inclui uma gola alta, roupa de cor escura, juntamente com uma tantō presa ao lado direito da parte de trás do seu ombro. Ele também usava o que parecia ser um arnês para sua tantō que corre em seu peito e é preso sobre ambos os seus ombros. Ele vestia calças longas escuras, cobertas na parte da canela por faixas brancas, juntamente com a tradicional sandália ninja."
    ],
    "info": {
      "Estado": "Morto",
      "Sexo": "Masculino",
      "Aniversário": "19 de outubro",
      "Altura": "Parte II: 180 cm",
      "Peso": "Parte II: 68.9 kg",
      "Tipo Sanguíneo": "A",
      "Clã": "Clã Uchiha",
      "Kekkei Genkai": "Sharingan",
      "Afiliação": "Konohagakure",
      "Times": "Time Shisui (Apenas Anime)",
      "Patente Ninja": "Fase II:  Anbu"
    },
    "images": [
      "https://static.wikia.nocookie.net/naruto/images/4/4c/Shisui_Uchiha.png/revision/latest?cb=20200301141741&path-prefix=pt-br"
    ]
  },
  "Kurenai Yūhi": {
    "about": [
      "Kurenai Yūhi (夕日紅, Yūhi Kurenai) é uma kunoichi de nível jōnin de Konohagakure. Ela também é a líder do Time Kurenai, que consiste em: Hinata Hyūga, Shino Aburame, Kiba Inuzuka e Akamaru.",
      "Kurenai é uma mulher inteligente, carinhosa e corajosa. Ela demonstra grande cuidado e preocupação com seus alunos e tem um grande interesse em seu crescimento, especialmente no que diz respeito a Hinata, devido ela saber muito bem como Hinata era vista por seu pai. Quando Hinata tentou oferecer um medicamento para Naruto após sua luta com Kiba, Kurenai convenceu Naruto para levá-lo, pois ela sabia da paixão de sua aluna por ele. Sua personalidade é firme, honesta e simples. Ela também é retratada como  \"Grande Irmã\".",
      "Tem sido fortemente sugerido que Kurenai estava envolvida romanticamente com seu colega jōnin, Asuma Sarutobi. Os dois apareceram juntos na maioria de suas cenas, e os outros personagens fez questão de ressaltar este fato em várias ocasiões. Quando Kakashi Hatake encontra os dois juntos em uma loja de bolinhos de massa, ele pergunta se eles estavam em um encontro, o que fez Kurenai se envergonhar e deu uma desculpa de que ela estava apenas em missão. A verdade sobre sua relação com ele fica clara na Parte II, quando Kurenai revela que ela está grávida de uma filha de Asuma, Mirai Sarutobi. Desde que se tornou uma mãe solteira, Kurenai mostrou ser muito capaz, fazendo Mirai ser muito alegre e responsável.",
      "Kurenai é uma mulher alta de pele clara de construção delgada. Ela tem longos cabelos negros, seu cabelo é desgrenhado pela altura dos ombros e seus olhos muito originais que são vermelhos, com um anel adicional neles. Ela usa uma maquiagem composta por batom vermelho e sombra de olho roxa. Sua roupa normal é composta por uma blusa de malha de armadura vermelha com apenas a manga direita visível. Ele é bem grande e o material se assemelha à ligaduras com um padrão em que se assemelha aos dos espinhos. Suas mãos e coxas também estão envoltas por ataduras e ela usa o protetor de testa de Konoha e sandálias de shinobi padrão.",
      "Em um flashback, foi mostrado que Kurenai costumava usar o equipamento padrão dos shinobi de Konoha, consistindo de um colete e uma roupa vermelha de  mangas simples debaixo dela.",
      "Em The Last: Naruto o Filme, dois anos após o fim da Quarta Guerra Mundial Shinobi, ela usa uma camisa de manga longa de cor cinza com uma tonalidade escura sob uma camisa sem mangas cor de vinho com três listras cor de rosa sobre ela. Ela usa calças cinzentas de tom claro com sandálias cor de rosa. Vários anos depois, Kurenai encurta seu cabelo e desenvolve pequenas rugas no canto de sua boca e veste um quimono vermelho com um cinto branco.",
      "Quando criança, Kurenai conheceu Asuma Sarutobi durante a cerimônia de admissão da Academia e graduou-se aos 9 anos. Mais tarde, ela estava torcendo por seus colegas durante a terceira rodada do Exame Chūnin."
    ],
    "info": {
      "Sexo": "Feminino",
      "Aniversário": "11 de junho",
      "Idade": "Parte I: 27-28 anos",
      "Altura": "Parte I: 169.1 cm",
      "Peso": "Parte I: 54.4 kg",
      "Tipo Sanguíneo": "AB",
      "Clã": "Clã Sarutobi",
      "Classificação": "Tipo Sensor",
      "Afiliação": "Konohagakure",
      "Times": "Time Kurenai",
      "Patente Ninja": "Fase I:  Jōnin",
      "Registro Ninja": "010881",
      "Graduação (Genin)": "9",
      "Graduação (Chūnin)": "13"
    },
    "images": [
      "https://static.wikia.nocookie.net/naruto/images/9/9a/Kurenai_%28HD%29.png/revision/latest?cb=20170113120917&path-prefix=pt-br",
      "https://static.wikia.nocookie.net/naruto/images/c/c5/Kurenai.png/revision/latest?cb=20130515223615&path-prefix=pt-br",
      "https://static.wikia.nocookie.net/naruto/images/1/15/Kurenai_%28Boruto-Anime%29.png/revision/latest?cb=20181127011150&path-prefix=pt-br"
    ]
  },
  "Shino Aburame": {
    "about": [
      "Shino Aburame (油女シノ, Aburame Shino) é um membro do clã Aburame de Konohagakure. Calmo e às vezes desanimador, Shino coloca seu talento único com insetos para usar em sua associação com o Time Kurenai. Nos anos posteriores, ele se torna um instrutor na Academia.",
      "Desde sua infância, Shino tem sido uma pessoa calma, recolhida e solitária, sendo bastante misterioso. Shino é retratado como sendo algo entre apenas estoico e matéria-de-fato, raramente sorrindo ou mostrando emoção; em vez de agradecer a seus companheiros de equipe por parabenizá-lo por sua vitória nas preliminares, ele lhes disse que esperava que eles fizessem o mesmo. Ele também tem uma tendência de guardar rancor e ser um pouco intimidador, como visto quando Naruto não conseguiu reconhecê-lo no início da Parte II (que é justo como a única parte visível de seu rosto eram os óculos de sol), mas reconhece facilmente Kiba e Hinata. Ele ainda afirma que tem rancor deste dia.",
      "Shino parece estar ciente desses traços de sua personalidade ímpar; no anime, quando ele comeu comida envenenada com um produto químico que o obrigou a rir, ele disse ameaçadoramente para Naruto esquecer o que tinha acontecido. Seu interesse em insetos só ajuda a reforçar esse ponto de vista dele; gastando grande parte de seu tempo livre observando eles, e muitas vezes fazendo analogias associadas com insetos quando fala, as pessoas consideram Shino como \"assustador\", e tendem a não gostar de estar em sua companhia por períodos prolongados de tempo. Em seu sonho no Tsukuyomi Infinito, Shino sonhou que ele encontrou uma nova espécie de inseto de tamanho gigante e domou-o como seu próprio.",
      "Apesar de discutir ocasionalmente com Kiba, Shino tem um forte senso de conexão com seus companheiros e aliados, visto pela primeira vez quando ele prometeu a Sasuke que iria ajudá-lo a lidar com Gaara depois de lidar com Kankurō, mas lamentou não poder manter essa promessa. Isto mostrou que Shino também é muito destemido, visto que ele e seus companheiros estavam morrendo de medo depois de verem os poderes de Gaara durante a segunda fase do Exame Chūnin, mas ele ainda resolveu ajudar Sasuke da melhor maneira que podia contra Gaara. Ele também lamentou estar indisponível e, portanto, incapaz de ajudar com o resgate de Sasuke Uchiha. A partir daí, ele resolveu trabalhar em suas habilidades de trabalho em equipe com Kiba e Hinata. Ele até ajudou Hinata a melhorar suas habilidades, e é uma das poucas pessoas, além de Naruto, que professa abertamente confiança nela. Os frutos de seus esforços são vistos no anime, onde Shino foi capaz de levar a cabo uma missão de sucesso ao mesmo tempo em que manteve os outros seguros. Ele também demonstra ser capaz de compreender o funcionamento interno de seus companheiros de equipe, sentindo quando a menor das coisas está errada com qualquer um deles. Durante a Quarta Guerra Mundial Shinobi, ele foi capaz de manter o fluxo de chakra de seu companheiro de equipe ativo através do uso de seus insetos.",
      "Shino fala de uma forma curiosa, como observado por ambos Naruto e Kiba. Ele fala de uma maneira mais simples descrita como \"minuciosa\" e usa a palavra \"porque\" (なぜなら, nazenara) um grande número de vezes. Para os outros, seu modo de falar parece ser sobre a preocupação com os pontos triviais de uma conversa que poderiam ser deixados de lado, ou, fornecendo informações que vão deixar ainda mais perguntas — mesmo elas já estando respondidas.",
      "Shino é bastante confiante em suas habilidades e que ele vai ganhar uma batalha, e tende a tentar comunicar isso para seu adversário para o seu próprio bem-estar. Ainda assim, Shino gosta de lutas, e não gosta de ser negado e perder a oportunidade de lutar contra um adversário qualificado, como visto quando ele saiu do seu caminho durante a invasão em Konoha para lutar contra Kankurō, depois que o último desistiu da luta para evitar revelar os segredos de suas marionetes.",
      "No anime, foi mostrado que Shino entra em pânico quando é confrontado por animais ou plantas insectívoras (com o próprio Shino comparando-o a tortura psicológica). Ele também cai em desespero, mostrando expressões tristes — atípicas dele — até o ponto onde ele quase chora e ainda se recusa a continuar sua missão para evitar a perda de mais insetos."
    ],
    "info": {
      "Sexo": "Masculino",
      "Aniversário": "23 de janeiro",
      "Idade": "Parte I: 12-13 anos",
      "Altura": "Parte I: 156.2 cm - 161.1 cm",
      "Peso": "Parte I: 45.8 kg - 48.5 kg",
      "Tipo Sanguíneo": "AB",
      "Clã": "Clã Aburame",
      "Ocupação": "Instrutor da Academia[6]",
      "Afiliação": "Konohagakure",
      "Times": "Time Kurenai",
      "Patente Ninja": "Fase I:  Genin",
      "Registro Ninja": "012618",
      "Graduação (Genin)": "12",
      "Graduação (Chūnin)": "14"
    },
    "images": [
      "https://static.wikia.nocookie.net/naruto/images/f/f1/Shino_Aburame.PNG/revision/latest?cb=20141018074459&path-prefix=pt-br",
      "https://static.wikia.nocookie.net/naruto/images/9/92/Shino_Aburame-Shippuden.png/revision/latest?cb=20140823001818&path-prefix=pt-br",
      "https://static.wikia.nocookie.net/naruto/images/6/68/Shino_Professor.png/revision/latest?cb=20170419181814&path-prefix=pt-br"
    ]
  },
  "Obito Uchiha": {
    "about": [
      "Obito Uchiha (うちはオビト, Uchiha Obito) foi um membro do clã Uchiha de Konohagakure. Acreditava-se que ele tinha morrido durante a Terceira Guerra Mundial Shinobi, com seu único legado sobrevivente sendo o Sharingan que ele deu ao seu companheiro de equipe, Kakashi Hatake. Na verdade, Obito foi salvo da morte e treinado por Madara Uchiha, mas os acontecimentos da guerra deixaram Obito desiludido com o mundo, e ele tentou substituí-lo por um novo. Madara Uchiha fez Obito Uchiha ser seu sucessor, lhe dando o Plano Olho da Lua. Usando o pseudônimo de Tobi (トビ, Tobi) e Madara Uchiha, Obito manipulou a Akatsuki das sombras para dar continuidade aos seus planos, eventualmente, indo a público com eles e, no processo, iniciando a Quarta Guerra Mundial Shinobi sendo manipulado pelo Zetsu Negro. Durante a guerra, Obito teve uma mudança no coração, porém, ele acabou sacrificando sua vida para ajudar a salvar o mundo.",
      "Em sua juventude, Obito estava sempre atrasado, a maioria das vezes devido às boas ações que ele fazia, como ajudar os idosos. Em um ponto de sua vida, ele comentou que conhecia todas as pessoas idosas de Konoha. Obito também facilmente ia às lágrimas, que ele sempre insistiu que era porque tinha algo em seus olhos, apesar de usar óculos de proteção. Pelo fato de Obito ter crescido sozinho e sem os pais, ele procurou ser reconhecido por todos e, como resultado, sonhava em ser Hokage e salvar o mundo. Obito era apaixonado por Rin, que era seu único ponto de apoio neste sonho, apesar de perceber que ela era apaixonada por Kakashi por sua vez. A partir disso, Obito começou a invejar as habilidades prodigiosas de Kakashi e constantemente procurava ultrapassá-lo. Em última análise, Obito nunca teve a chance de revelar seus sentimentos a Rin antes de sua suposta morte. Como Kakashi observou, Obito compartilhava muitas das qualidades de Naruto, incluindo uma rivalidade unilateral com seu parceiro gênio e sentimentos unilaterais por seu parceiro feminino. Ele também possuía os mesmos desejos de Naruto em se tornar um Hokage que jamais abandonaria seus companheiros. Obito tinha fortes sentimentos por seus companheiros, pelo Hokage e pelos shinobi, qualidades que fizeram dele ideal para a corrupção, de acordo com Madara. No final, ao testemunhar a morte de Rin, a determinação e idealismo de Obito foram destruídos e sua Vontade do Fogo foi quase completamente extinta.",
      "Após se aliar a Madara e ser condicionado por ele para continuar seu trabalho, Obito se tornou extremamente focado, recolhido e sério. De sua antiga lealdade e ideologias veio uma grande amargura, fazendo ele se sucumbir a Maldição de Ódio de seu clã, com o mundo inteiro sendo o objeto de seu ódio, com o sistema shinobi que levou à morte sem sentido de Rin sendo o responsável por ele perder a esperança nele. Declarando que ele não se importava mais com seu bem-estar e que nada neste mundo importa além do Plano Olho da Lua,",
      "Embora ele fosse frequentemente arrogante e desrespeitoso com aqueles que ele considerava fraco, Obito não deixava de elogiar os outros.",
      "Obito era um mestre manipulador, seja para corromper sutilmente os objetivos próprios de seus alvos, omitindo partes das histórias ou eventos para seu próprio benefício, como fez com Sasuke, ou aparecer para compartilhar suas crenças. Como Madara lhe ensinou, Obito aproveitou a escuridão dentro dos corações de seus alvos para controlá-los, isso é melhor visto na existência da Akatsuki com seus membros descontroladamente diferentes trabalhando juntos, porque eles acreditavam que a organização promoveria seus próprios fins, enquanto, na realidade, serviam como meros instrumentos para promover os objetivos de Obito. A lealdade de Obito não se estendia para ninguém além de si mesmo, até mesmo traindo Madara, alegando que ele nunca o considerou um aliado. Ele era capaz de ter muita paciência para alcançar seus objetivos; no entanto, ao aproximar-se da conclusão de sua ambição final, ele começou a descartar a cautela e avançar de forma mais agressiva e decisiva, insistindo que o Tsukuyomi Infinito seria iniciado imediatamente.",
      "Quando introduzido pela primeira vez como \"Tobi\", Obito exagerava ao interpretar sua antiga personalidade a extremos ridículos, exercendo o papel de idiota que irritava a maioria dos membros da Akatsuki, embora Kisame apreciasse a capacidade de Tobi em iluminar uma organização sombria, como a deles. Por causa das semelhanças entre Naruto e sua auto criança, Obito manifestou grande raiva por Naruto continuar a seguir a mesma ideologia que ele já seguiu, considerando-o incrivelmente ingênuo e infantil por ainda acreditar em tais princípios.",
      "Kakashi, depois de deduzir a razão para isso e suas ações, observou que a Vontade do Fogo de Obito nunca tinha realmente desaparecido e que sua negação lhe estava causando um tumulto interior que estava o rasgando por dentro. Durante seu confronto com Naruto e Sasuke, Obito imaginou brevemente o modo como sua vida poderia ter sido se ele tivesse voltado para Konoha quando Rin morreu e para seus companheiros, mesmo indo tão longe a ponto de imaginar a si mesmo como Hokage, apesar de não entender por que conscientemente. Ao ver essas visões novamente, Obito começou a concluir que ele estava subconscientemente lamentando suas ações afiliadas com o Plano Olho da Lua. as ações de Naruto, em última análise, conseguiram mudar a mentalidade de Obito, permitindo-lhe superar sua Maldição de Ódio."
    ],
    "info": {
      "Estado": "Morto",
      "Sexo": "Masculino",
      "Aniversário": "10 de fevereiro",
      "Idade": "Parte II: 29-31 anos",
      "Altura": "Parte II: 175.0 cm - 182.0 cm",
      "Peso": "Parte II: 55.9 kg - 70.3 kg",
      "Tipo Sanguíneo": "O",
      "Clã": "Clã Uchiha",
      "Kekkei Genkai": "Sharingan",
      "Bijū": "Dez-Caudas",
      "Classificação": "Jinchūriki",
      "Ocupação": "Líder da Akatsuki",
      "Afiliação": "Konohagakure",
      "Times": "Time Minato",
      "Parceiro": "Madara Uchiha",
      "Patente Ninja": "Fase II:  Chūnin",
      "Registro Ninja": "010886",
      "Graduação (Genin)": "9",
      "Graduação (Chūnin)": "11"
    },
    "images": [
      "https://static.wikia.nocookie.net/naruto/images/2/28/Obito_%28Guerra%29.png/revision/latest?cb=20141219124512&path-prefix=pt-br",
      "https://static.wikia.nocookie.net/naruto/images/8/82/Uchila_Obito.jpeg/revision/latest?cb=20180622115708&path-prefix=pt-br"
    ]
  },
  "Deidara": {
    "about": [
      "Deidara (デイダラ, Deidara) foi um nukenin de rank S de Iwagakure. Ele também foi um dos mais jovens membros da Akatsuki, e foi um parceiro de Sasori e Tobi consecutivamente antes de sua morte.",
      "Deidara é extremamente orgulhoso, acredita que a arte é uma potência perfeita, que pode se tornar imbatível. Nunca aceita uma derrota, e cada vez que isso acontece, ele sempre planeja uma vingança. Deidara odeia especialmente Itachi Uchiha e Sasuke Uchiha, pois esses são indiferentes e não mostram nenhuma emoção diante da sua arte da argila explosiva, além dos irmãos Uchiha obterem o Sharingan, que é considerado por Deidara uma arte mais poderosa do que sua argila e que certamente supera suas habilidades. Na verdade, Deidara é uma pessoa imprudente e, embora ele arfime que prefere improvisar, ele sempre calcula uma situação e segue os planos e estratégias específicas. No entanto, se alguém insulta a sua arte, ele fica completamente em um estado de loucura e chega a sacrificar a si mesmo a fim de matar seu adversário.",
      "Ele respeitava muito seu primeiro parceiro, Sasori, chegando a usar um título honorífico a ele e afirmando que Sasori é muito mais forte do que ele, porém quando o assunto é sobre a arte exercida na técnicas dos dois, eles tinham o hábito de discutir para ver qual o verdadeiro significado da arte. Quanto à seu outro parceiro, Tobi, Deidara tinha o hábito de se irritar e se incomodar facilmente com as frequentes brincadeiras de Tobi, mostrado principalmente no arco do Sanbi.",
      "Deidara se referia a seu ninjutsu explosivo como uma arte, acreditando que cada bomba que ele fazia era uma realização significativa. Um dos seus slogans preferidos é: \"A arte é uma explosão\" (芸術は爆発だ, Geijutsu wa Bakuhatsu da), que foi originalmente usado pelo famoso artista japonês Tarou Okamoto, além de muitas formas da argila explosiva de Deidara serem semlhantes à que Tarou também trabalha. Embora Deidara seja muito orgulhoso na sua força e \"arte\", ele é inteligente o suficiente para reconhecer quando o seu adversário é mais forte do que ele. No entanto, ele despreza completamente o Sharingan de Itachi e Sasuke, afirmando que isso não é algo artísticos.",
      "Deidara possui cabelos loiros e olhos azuis e puxados. O seu cabelo é colocado em um rabo de cavalo com uma franja cobrindo o seu olho esquerdo, onde ele usa um aparelho mostrando ser um lutador de longa distância. Como todos os membros da Akatsuki, ele usa um casaco preto com nuvens vermelhas, Deidara tem no seu dedo direito indicador um anel símbolo da Akatsuki, que seu kanji significa azul (青, ao). Ele tem unhas coloridas e pouco grande nas mãos e nos pés. Uma característica exclusiva de Deidara são as bocas nas suas mãos, logo depois é revelado que ele tem um boca gigante no seu peito, durante a sua luta contra Sasuke.",
      "Durante seus dias como um shinobi em Iwagakure, Deidara foi o estudante do Terceiro Tsuchikage. Apesar de Deidara muitas vezes irritasse seu sensei, Ōnoki ainda estava orgulhoso dele. Ele era um membro do Corpo de Explosão, e tinha o Kekkei genkai Liberação de Explosão. Deidara também recebeu elogios por suas esculturas de barro. No entanto, ele ainda desejava alcançar alturas ainda maiores. Na primeira, ele simplesmente focou-se na criação de obras cada vez maiores, mas em pouco tempo, ele começou a desejar o kinjutsu que foi passado em Iwagakure. Uma técnica que permite que se amasse chakra em substâncias. Ele violou a lei e roubou a técnica, levando-o a ser perseguido. No entanto, como a Argila Explosiva que ele tinha usado pela primeira vez detonou. Sempre que ele detona sua Argila Explosiva, lembra o processo que lhe permitiu chegar a esta arte.",
      "Depois que ele fugiu de sua vila e tornou-se um nukenin, ele começou a ajudar os rebeldes em vários países como um bombardeiro terrorista que se dedicava a arte. É quando a Akatsuki finalmente toma conhecimento das capacidades dele. Algum tempo depois de Orochimaru entrar da Akatsuki, Deidara foi localizado por Itachi Uchiha, Kisame Hoshigaki e Sasori, que estavam sob as ordens do líder, Pain, para recrutá-lo. Deidara se recusou, a princípio, resultando em Itachi desafiá-lo, prometendo deixá-lo sozinho, se Deidara ganhasse. Deidara, de bom grado, aceitou o desafio de Itachi, mas foi facilmente derrotado pelo Sharingan de Itachi, e se juntou à Akatsuki. Deidara, tendo tomado um grande golpe para seu ego, carregava um ódio mortal por Itachi e seu Sharingan para o resto de sua vida, embora ele era inteligente o suficiente para reconhecer que Itachi era um adversário mais poderoso. No entanto, ele fez tomar medidas durante o seu tempo com a Akatsuki para se vingar de Itachi, tais como a formação de seu olho esquerdo para combater genjutsu. Ele também revelou para Sasuke que ele criou o C4 com o único propósito de matar Itachi."
    ],
    "info": {
      "Estado": "Morto",
      "Sexo": "Masculino",
      "Aniversário": "5 de Maio",
      "Idade": "Parte II: 19 anos",
      "Altura": "Parte II: 166 cm",
      "Peso": "Parte II: 50.8 kg",
      "Tipo Sanguíneo": "AB",
      "Kekkei Genkai": "Liberação de Explosão",
      "Classificação": "Rank S",
      "Ocupação": "Terrorista de Bombardeio",
      "Afiliação": "Iwagakure",
      "Times": "Corpo de Explosão",
      "Parceiro": "Sasori",
      "Registro Ninja": "IW-08721"
    },
    "images": [
      "https://static.wikia.nocookie.net/naruto/images/3/30/Deidara_%28Parte_II%29.PNG/revision/latest?cb=20150112171710&path-prefix=pt-br",
      "https://static.wikia.nocookie.net/naruto/images/c/c8/Deidara_surpreso_com_o_Sharingan_de_Itachi.png/revision/latest?cb=20160329031729&path-prefix=pt-br"
    ]
  },
  "Sasori": {
    "about": [
      "Sasori (サソリ, Sasori), também conhecido como Sasori da Areia Vermelha (赤砂のサソリ, Akasuna no Sasori) era um shinobi de Sunagakure e que se juntou a Akatsuki, onde foi parceiro de Orochimaru e Deidara, respectivamente.",
      "Quando criança, Sasori sempre pareceu triste, devido à falta de amor dos pais. Quando introduzido à arte do teatro de bonecos por sua avó, Chiyo, ele cresceu um pouco mais feliz. Ele finalmente criou fantoches com a semelhança de seus pais, mas os bonecos não poderiam dar-lhe o amor que ele desejava, ele tornou-se frio e distante. Isto levou a ele ter pouca consideração pela vida humana, e ele foi tão longe para afirmar que ele se sentiria nada se até mesmo Chiyo morresse, como ele alegou que seu coração tinha se tornado como o seu corpo de fantoches: sem emoções. Apesar de sua crueldade, Sasori também tinha sido demonstrado possuir uma visão muito realista sobre a vida, raramente crescente trabalhou até por cima de obstáculos que veio sua maneira. Ele também raramente mostrou qualquer emoção extrema, e mesmo estes casos foram de curta duração.",
      "Sasori também era conhecido por sua impaciência, como ele várias vezes disse que não queria esperar ou manter os outros à espera. Apesar de sua impaciência, ele levou o seu tempo com sua primeira batalha contra Kankurō devido ao interesse de ver lutando contra suas antigas criações sendo utilizadas pela próxima geração, fazendo Deidara esperar.",
      "Sasori e seu segundo parceiro na Akatsuki, Deidara, ambos tinham visões conflitantes de arte, e eles freqüentemente discutiam sobre seus pontos de vista diferentes. Deidara manteve a opinião de que a arte era uma coisa passageira que se afasta rapidamente, onde, como Sasori acreditava que arte é algo maravilhoso que é deixado muito tempo no futuro. Isso refletiu em suas naturezas individuais; Deidara fazia esculturas de argila que explodiam, enquanto Sasori criava de longa duração bonecos de seres humanos. No entanto, Deidara exteriormente parecia respeitar as crenças de Sasori, embora Sasori nunca tenha respeitado a de Deidara.",
      "A ambição de Sasori era tornar-se arte, tornando-se um boneco, porque ele pensou que a arte é algo maravilhoso que é deixado muito tempo no futuro. Ele abandonou essa ambição quando Kankurō disse-lhe que era em suas criações que ele colocava seu coração e alma para que duraria para sempre. Depois de aceitar a vista de Kankurō sobre a arte eterna, ele confiou seus fantoches Mãe e Pai para Kankurō, e disse-lhe para passá-los para a geração seguinte, quando ele morre. Neste momento, ele é mostrado para ter um lado emocional também.",
      "Também digno de nota é que ele estava disposto a aceitar opiniões de outras pessoas sobre determinados temas, ao contrário de Deidara, que teimosamente ficou por suas crenças.",
      "Sem sua armadura de fantoche ele manteve a aparência de um adolescente com os olhos arregalados marrom (que herdou de sua mãe), e cabelos ruivos curtos (herdado de seu pai). Quando criança, ele usava manto verde com uma jaqueta clara em torno deles. Quando adulto, ele foi visto principalmente na túnica da Akatsuki. Quando Sasori revelou o seu verdadeiro corpo, que era um boneco com um par de garras ligado a parte inferior das costas, um suporte para quatro pergaminhos nas costas, um ferrão na cavidade do estômago vazio e aberto, um compartimento no peito direito, e um núcleo de esquerda, seus olhos estavam abertos de forma maníaca, ao contrário de seu normal, com olhos calmos."
    ],
    "info": {
      "Estado": "Morto",
      "Sexo": "Masculino",
      "Aniversário": "8 de novembro",
      "Idade": "Parte II: 35 anos",
      "Altura": "Parte II: 164.1 cm",
      "Peso": "Parte II: 47.3 kg",
      "Tipo Sanguíneo": "AB",
      "Classificação": "Rank S",
      "Afiliação": "Sunagakure",
      "Times": "Brigada de Marionetes",
      "Parceiro": "Orochimaru",
      "Registro Ninja": "33-001",
      "Graduação (Genin)": "7",
      "Graduação (Chūnin)": "8"
    },
    "images": [
      "https://static.wikia.nocookie.net/naruto/images/7/7b/Sasori_%28Parte_II%29.PNG/revision/latest?cb=20141202202433&path-prefix=pt-br",
      "https://static.wikia.nocookie.net/naruto/images/2/26/Sasori_%28Passado%29.PNG/revision/latest?cb=20141202201336&path-prefix=pt-br"
    ]
  },
  "Gaara": {
    "about": [
      "Gaara (我爱羅, Gaara) é um shinobi de Sunagakure. O Shukaku foi selado em seu corpo no dia de seu nascimento, um procedimento que resultou na morte de sua mãe. Considerado como um monstro pela vila e sem ninguém para amá-lo, Gaara passou a desprezar o mundo e começou contando apenas com sua própria força, ganhando o título de Gaara do Deserto (砂瀑の我愛羅, Sabaku no Gaara). Este poder de auto-amor é mais tarde derrotado pela dedicação inabalável de Naruto Uzumaki por seus amigos. Desse ponto em diante, Gaara começa a seguir o método de Naruto e muda as opiniões de Sunagakure com relação a ele. Ele eventualmente se torna o Quinto Kazekage (五代目風影, Godaime Kazekage; Literalmente significa \"Quinta Sombra do Vento\"), uma posição que ele mantém, mesmo depois de Shukaku ser removido de seu corpo pela Akatsuki.",
      "Gaara era uma criança amável, que apesar de ser temido por todos, tentava desesperadamente ser amigável com os outros. No entanto, as ações de seu tio distorceram sua personalidade, na qual o levou a acreditar que ninguém se importava com ele. Com todos pensamentos negativos vividos após a traição de seu tio, Gaara usou sua areia para criar um kanji em sua testa com o significado \"amor\" (愛, ai), como um símbolo de sua resolução de ser um \"demônio que ama só a si mesmo\", e jus ao nome que sua mãe havia lhe dado. Gaara tornou-se emocionalmente retraído e estranhamente silencioso, já que ele sentia repugnância por todos, além de passar a chamar de \"mãe\" a voz do Shukaku em sua cabeça. Ele passou a sentir prazer e uma razão para viver ao matar as pessoas que eram enviadas para matá-lo — e, por extensão, qualquer pessoa que representava uma ameaça à sua existência. Isso só foi agravado pela influência de Shukaku, fazendo Gaara satisfazer a sede de sangue do demônio, o que resultou em sua natureza impiedosa e sociopata, demonstrado quando ele assassinou Baiu e Midare, apesar de seus pedidos de misericórdia. Além disso, Gaara sofria de insônia como resultado de Shukaku estar dentro de seu corpo. Isso causava temor sobre Gaara; caso ele caísse no sono, o demônio dentro dele iria corroer a sua alma. Em função disso, a sua instabilidade e seu desejo de matar aumentaram drasticamente. O ódio de Gaara com o Kazekage antecessor era devido ao fato dele enviar assassinos para matá-lo, e devido esta impiedosa ação de seu pai, agitou ainda mais a sua natureza misantrópica que se estendeu até os seus irmãos, a quem ele nunca via como irmãos, apesar de eles nunca ofendê-los diretamente. No entanto, como citado por Gaara, caso fosse o caso, ele mataria seus próprios irmãos. Além disso, devido à areia o proteger de qualquer lesão, ele nunca viu o seu próprio sangue, até o momento em que Sasuke Uchiha perfurou seu escudo de areia e o feriu. Ao ver o seu sangue, Gaara teve um colapso mental grave.",
      "A infância de Gaara era um paralelo com a de Naruto Uzumaki de muitas maneiras. Ambos eram insuportavelmente solitários e desejavam serem queridos, amados e reconhecidos como indivíduos, apesar de eles serem jinchūriki — eles eram seres humanos, e não os demônios que tinham sido forçados a conter — e foram levados para estados de depressão e desespero. Enquanto Naruto consequentemente desenvolveu a ideia errada de que brincadeiras e travessuras lhe trariam a atenção que ele ansiava, Gaara chegou à conclusão de que ele podia preservar e confirmar sua própria existência, matando todos e qualquer um que o desafiar, garantindo desta forma uma prova de sua existencialidade. Na ausência de reconhecimento externo, Gaara passou a compensá-la, valorizando apenas a si mesmo com a exclusão de todas as outras pessoas. Além disso, enquanto Naruto tinha Iruka Umino e o Time Kakashi para confortá-lo, Gaara nunca se preocupou em fazer vínculos emocionais, nem mesmo com seu pai ou irmãos, como eles também desprezavam e temiam o Shukaku. A pessoa que chegou mais perto de reconhecê-lo era Yashamaru, mas quando Yashamaru foi condenado a traí-lo, Gaara se transformou em um sociopata solitário. Como tal, Gaara não conseguia entender o que motivava as pessoas a lutarem pelos outros, até seu confronto com Naruto durante o Exame Chūnin.",
      "Depois de sua derrota nas mãos de Naruto, Gaara ficou chocado ao descobrir que Naruto entendia muito bem a dor que ele tinha sofrido ao longo de sua vida. Ele ficou ainda mais surpreso ao saber que Naruto nunca tinha perdido a sua ambição de ser reconhecido como um indivíduo, e, em última instância tinha encontrado companheiros que realmente se importavam com ele. Testemunhando a resolução que Naruto possuía para proteger seus amigos, fizeram com que Gaara questionasse o caminho que ele havia determinado para si mesmo quando era criança. Percebendo que ele tinha escolhido o caminho errado, Gaara decidiu seguir o caminho escolhido por Naruto, a fim de, finalmente, ser visto como um ser humano, e não como a Besta com Cauda dentro dele. Ao longo dos próximos anos, a determinação de Gaara para encontrar a felicidade o levou a confiar em seu próprio poder, em vez do demônio. Gaara finalmente formou uma estreita amizade com Naruto, vendo o ninja de Kohoha como seu primeiro amigo de verdade, e tornou-se muito leal em suas decisões, além de desejar proteger seu companheiro. Gaara também passou a acreditar que seu encontro com Naruto foi o maior evento de sua vida e acredita que até mesmo a vida dolorosa de um jinchūriki valeu a pena pela experiência. Gaara ainda perdoou o Shukaku por sua infância miserável, alegando que era só por causa dessa vida que ele foi capaz de encontrar Naruto.",
      "No anime, apesar de ser muito mais calmo e tranquilo do que ele costumava ser, Gaara manteve um senso de humor muito mórbido, como mostrado quando Suiko pergunta para Gaara quanto de seu chakra está infundido em sua areia, com Gaara concordando em deixá-lo saber, mas lhe custando a vida.",
      "Desde que se tornou um dos companheiros de Naruto, Gaara tem de alguma forma herdado sua capacidade de alterar a personalidade das pessoas. No anime, ele convence Matsuri em superar seu medo de armas. Durante a Reunião Kage, ele choca os Kage mais velhos e mais experientes ao perguntar quando eles haviam abandonado a si mesmos, mais tarde, fazendo Ōnoki ficar mais determinado em proteger o Mundo Shinobi. Antes da Aliança Shinobi marchar para a batalha, ele os motiva a deixar suas diferenças de lado, esquecer suas rivalidades do passado e se unirem sob uma mesma bandeira. Ele até consegue fazer Naruto pensar sobre as escolhas que ele tinha feito em relação à Sasuke, afirmando que ele só se preocupa com a vingança. Seu vínculo com Naruto também fez com que ele fosse capaz de jogar de lado qualquer rancor, incluindo o seu ódio para com seu pai, que foi parcialmente responsável pela infância miserável de Gaara. Ele admite ter perdoado as ações de seu pai e chora abertamente depois de saber que sua mãe realmente o amava, e que ela havia prometido protegê-lo para sempre, infundindo sua vontade em sua areia que, como seu pai notou, sempre o protege. Seu amor por sua família também é estendido em seu sonho no Tsukuyomi Infinito, onde Gaara sonha que toda a sua família está unida e feliz, além de Naruto ser um amigo de infância.",
      "Gaara se preocupa profundamente com Naruto e seu bem-estar, e apesar das ações de Sasuke durante seu ataque na reunião Kage e seu status como um criminoso internacional, Gaara tentou convencer Sasuke a sair da escuridão mais uma vez em nome de Naruto, e quando não conseguiu convencê-lo ele derramou uma lágrima pela falha que Sasuke se tornou, e pela decepção que Naruto vai enfrentar. Apesar de respeitar as objetivos de Naruto, seu cuidado para ele não bloqueia suas crenças pessoais, e ele acredita que o bem-estar de seu amigo é mais importante, isto é visto quando ele apoia a decisão de manter Naruto fora da guerra, além de dizer para Tsunade que Naruto corre muitos riscos quando se trata de proteger seus amigos. Gaara também diz, sem rodeios, que é tolice Naruto correr atrás de Sasuke, como ele considera que Sasuke é incapaz de deixar o caminho da corrupção. Embora ele desafie o objetivo de Naruto em trazer Sasuke de volta, ele só diz isso para o bem-estar de Naruto, porque eles são \"amigos\", mas também lhe diz que tudo o que ele pode fazer por Sasuke é algo que Naruto deve decidir por si mesmo, pessoalmente, ainda acreditando que Naruto possa de alguma forma chegar até Sasuke."
    ],
    "info": {
      "Sexo": "Masculino",
      "Aniversário": "19 de Janeiro",
      "Idade": "Parte I: 12-13 anos",
      "Altura": "Parte I: 146.1 cm - 148.1 cm",
      "Peso": "Parte I: 39 kg - 40.2 kg",
      "Tipo Sanguíneo": "AB",
      "Clã": "Clã dos Kazekage",
      "Kekkei Genkai": "Liberação de Magnetismo (Apenas Novela)",
      "Bijū": "Shukaku (Transformações)",
      "Classificação": "Jinchūriki",
      "Ocupação": "Kazekage",
      "Afiliação": "Sunagakure",
      "Times": "Três Irmãos da Areia",
      "Patente Ninja": "Fase I:  Genin",
      "Registro Ninja": "56-001",
      "Graduação (Genin)": "12",
      "Graduação (Chūnin)": "14"
    },
    "images": [
      "https://static.wikia.nocookie.net/naruto/images/e/ef/Gaara_%28Parte_I%29.PNG/revision/latest?cb=20170917114859&path-prefix=pt-br",
      "https://static.wikia.nocookie.net/naruto/images/7/7f/Gaara.png/revision/latest?cb=20170917114827&path-prefix=pt-br",
      "https://static.wikia.nocookie.net/naruto/images/c/c3/Gaara_Part_IV.png/revision/latest?cb=20170914030450&path-prefix=pt-br"
    ]
  }
}